{"city": "chicago", "title": "Great Location Quiet Rooms Awesome Bed!!!", "text": "Our stay at the Amalfi was a great experience. We had never stayed there before, but after reading the excellent reviews on sites like this one, we decided to give it a try. The staff was very courteous and helpful. After we checked in and got settled into our room, we were amazed that the interior looked exactly like the photos online(which is not always the case)! The rooms were a little small, but we found them roomy enough for downtown Chicago. We were a little disappointed with the view from our first room (basically just dumpsters and a brick wall outside our window), but our request for another room was accomodated quickly, and our second night was spent in a room with a much better view of the surrounding skyline. This hotel is not a great place to go for views, because there are only six floors and it's almost completely surrounded by taller buildings.  Don't let that discourage you, though, because it really is a very nice hotel for the price! We found that we were walking distance from the Magnificent Mile, and we even trekked all the way north to the Hancock Center for supper at the Signature Room and back again! We were surrounded by great restaurants, shopping, and entertainment.  The bed was EXTREMELY comfortable! I have never slept better in a hotel before in my life! The hotel offers an excellent breakfast each morning on every level so you don't even have to take the elevator. There is also a nightly cocktail party with complementary beverages every night, but we didn't get to attend because we had dinner plans both nights.  The rooms were very quiet, thanks to the thick walls and central heating and cooling (no noisy wall unit). The TV and DVD player were satisfactory for viewing a movie from the front desk, which proved to be a relaxing end to a day of shopping. The valet parking service made our stay convenient, and for $37 a day we were able to come and go whenever we chose. My wife and I are very frugal when it comes to travelling, so we usually stay in a hotel in the suburbs and drive in to downtown Chicago for sightseeing. After calculating the cost of driving all that distance and paying for parking, along with the hassle that comes with it, we've decided that the Amalfi is definitely worth the price.", "hotel": "amalfi_hotel_chicago", "year": "2006", "date": "2006-12-20"}
