{"city": "chicago", "title": "This is a lovely hotel!", "text": "Myself and my boyfriend stayed here for 3 nights as an early 30th birthday treat from 30 January 2008-2 February 2008. We found this to be a really lovely hotel. The staff were nice and helpful but not forceful or bothersome (which I was concerned about when I read that an &quot;Experience Designer&quot; would assist us with our stay). The only thing I would say on this matter was that we weren't offered anything like this service at all, it was only when we were checking out that I heard someone asking about the shuttle bus service the hotel runs, but I guess if you don't ask you don't get!We found the rooms smart, modern, clean and comfortable and the turn down service offered of an evening by housekeeping is a nice touch. The bed was large and very comfortable, the bedding was non-allergenic and a 'mock' down. The rooms were spacious and stylish and the Aveda toiletries a very nice touch. The room looked just as in the pictures on the site. I was a bit wary of the breakfast service when I read that it was served in the lobby areas of each floor, however this was not a problem at all. Hot coffee, water for teas and a selection of bottled juices were offered. There were plenty of pastries, muffins, breads/loaves and bagels but there are no toaster facilities. Unfortunately we did not take advantage of the evening cocktail reception as our time in Chicago was very limited. The location was great, the area is on the quiet side and the views weren't amazing but Harry Caray's is opposite and Lou Malnati's (absolutely divine pizza pie!) is within a short walk. Magnificent Mile is about a 5 minute walk to the left and the the Chicago River and access to the Loop about a 5 minute walk down the road. If you're looking for places to go I would recommend shopping at Magnificent Mile, there are some good souvenir shops too in the malls, you could finish up having lunch in Pizzeria Uno or Pizzeria Due which are both toward the farther end of Magnificent Mile. The Cheesecake Factory at the bottom of the Hancock tower was really nice, we originally intending on having drinks in the John Hancock Tower bar to take in the views but my boyfriend's vertigo got the better of him on the 96th floor!I would definitely recommend this lovely hotel and Chicago, we had a great time here but unfortunately there was a snow storm so we were quite limited when we were out and about. If you do decide to go to Chicago I would recommend a restaurant called Rose Angelis, it was in a converted house in the suburbs (1314 W Wrightwood Ave) and it took us a few minutes walk to get a taxi back when the city was on stand-by for snow storms but it was well worth the taxi ride. 10 Pin is very close to the hotel and we had cocktails here and a game of 10 pin bowling and Chicago Blues is within the same complex. All in all this was a very nice hotel and city which by far exceeded our expectations, my only regret is that we didn't stay here longer!", "hotel": "amalfi_hotel_chicago", "year": "2008", "date": "2008-02-25"}
