{"city": "chicago", "title": "Amalfi keeps getting better", "text": "Updated info: They're done with lobby construction and the new lobby is very nice with a flowing water feature and updated furnishings. This renovation just happened as they celebrated five years in business. The Amalfi Hotel occupies floors 2-6 or a 17-story office building in downtown Chicago, in a very convenient location... walking distance to Magnificent Mile shopping and within a block or two of five fine steakhouses (Keefers is in the same building, Harry Caray's, Sullivans, Ruth's Chris, Smith &amp; Wollensky are just a block away, Chicago Chop House, Kinzie Chop House, Morton's of Chicago are very short walks).Service is very nice, although I didn't challenge their &quot;experience designers&quot; (why can't we just call them the front desk clerks?). The maids are &quot;comfort stylists&quot;, the porters are &quot;impressionists&quot;. Are we paying for these words? Sounds expensive. And silly. All of the valet, bellhop and wait staff, regardless of what fluffy title they were given, were remarkably kind for Chicago.The best way to experience the Amalfi is to find your best deal on one of the discount websites (I used Expedia) and call the Amalfi to get a rate match. They will do that. You may see a rate above of over $300 a night, but I just stayed there for $132 a night, and you can't beat that at any other classy place downtown. My personal previous best rate was at the House of Blues before they became Hotel Sax at $145 a night. Valet parking, as it is in downtown, was up there.. $44 a night with in and out privileges. Not a trace of cigarette or cigar smoke in the place... it's relatively quiet for downtown... the infrastructure works well (icemaker, refrigerator, door locks, HVAC, elevators, etc.)... and the beds are the best you'll sleep on (better than I own). The wireless networking was fast and smooth, and no extra cost. The LodgeNet television/in-room movie system is still undergoing a transition to HD, so the TV video wasn't HD and was stretched for now, and the reaction to the remote was slow. They promised this was undergoing improvement soon. I'll stay there regularly unless they charge me rack rates.", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-02-04"}
