{"city": "chicago", "title": "great location but rooms are small", "text": "first trip without the kids... so wanted a great location since no car. the allerton was the hotel I got with my $75 night thru priceline. The price and location on magnificient mile was good choice. It was a $30 taxi ride from airport. The revolving entrance was the valet area. The check in was on 2nd floor which was kind of strange. the elevators are tiny so might be a problem if you have lots of luggage. The checkin lobby had a fireplace and looks chic. The hotel decor looked modern. We got a queen room on the 9th floor. The hallway and carpet looked updated unlike other negative review. I did not smell anything bad. Our room had a view of the michigan ave and we could see TIffany &amp; co.  I do agree that the room was small and we are small people. Not a lot of moving room. As soon as you enter, the bedroom and chair, desk are right there. The bath products were L'occitane which smells good. the room was at the corner so it was quiet.The best part of this hotel was that is was walking distance to shopping, food, tourist attractions. The hotel is right on the intersection of michigan ave and huron. So you are right in the middle of the magnificient mile shops. Everything was at the front door. There is the apple store across street. The John hancock up a block and the water tower shops next to it. H&amp;M, ghiradelli chocolate few blocks. The millenium park with the bean structure was 3 blocks on the opposite direction from the hancock building. Gino east pizza right down the street and Giordanos pizza next to tribune place (3 blocks down). We took the subway to the Sears tower and walked to the art institute. We took a cab to navy pier and shaws crab house. We were glad we did not rent a car since hotel charges and parking would be hard and expensive everywhere. There are walgreens and starbucks, dunkin donuts almost every corner. Have fun and wear comfy shoes. We would stay here again since it is less expensive compared to the omni and marriott nearby.", "hotel": "allerton_hotel", "year": "2009", "date": "2009-02-16"}
