{"city": "chicago", "title": "Don't stay here (you'll make it harder for me to book a room!)", "text": "One of Chicago's best kept secrets, you can get a nearly perfect room here often for a fantastic rate. Absolutely fantastic bed linens, gorgeous little bathrooms, quiet rooms, extremely helpful but unobtrusive staff (primarily European--elegant, professional, and intelligent), free high speed internet, crown molding and perfect decor... Having stayed here by myself on several occasions, I have found the front desk staff to be extremely effusive and charming, and every request I have made has been attended to perfectly. I'm not sure what it's like to check in with a large group, so I don't understand the complaints from others in their reviews. As a single traveller, I appreciate the lack of a busy lobby bar. The fitness center is bright, clean, and more than adequate, and there is an additional sauna. There is a laundry room for guest use on the top floor. And per the complaints about slow elevators: on more than one occasion I witnessed seemingly oblivious people staring blankly into space as elevators on the other side of the staircase arrived to take them up to the guest floors--on one occasion I even announced the arrival of the elevator and held the door for one group, but no one involved could grasp the fact that there were two groups of elevators for the guest floors (left and right, not to be confused with those across the hall to descend to the motor lobby), so eventually I just rode up by myself and left them to wait. For the business traveller who understands basic modern conveniences (and complicated signals like &quot;pings&quot; and up and down lights) and wants to be in a quiet, exceptionally comfortable, surprisingly affordable, low key hotel that just happens to be smack dab in the middle of everything, it doesn't get any better. I would say that this is nearly the perfect luxury business hotel, and that families would be more comfortable at some big chain like the Hyatt or the Sheraton, where square footage outweighs small personal touches and peace and quiet.", "hotel": "allerton_hotel", "year": "2004", "date": "2004-11-15"}
