{"city": "chicago", "title": "Allerton Hotel is Okay but not great", "text": "We booked the Allerton Hotel for 4 nights in August through Hotwire. The rate was comparable to the rate we received last year through Hotwire, but last year we were booked at the Drake.It would be unfair to compare the Allerton to the Drake, but after staying at the Drake for nearly the same amount, it was hard not to draw comparisons, or at least to not be slightly disappointed.The Allerton is in a great location, for any attractions on or near the Miracle Mile. That is a positive, the down side is you can hear much of the noise form Michigan Ave. We were in a room within earshot of some young street musicians playing plastic buckets and pails and it made it dissicult to nap late in the afternoon.The first room we were assigned was extremely small and the carpet was horribly stained with what looked like red wine or coffee ( I hope ) the vents for the heating and ac were covered in filthy dust and mold.The front desk changed our romm, and the new room was a bit larger, but the vents in that room were pretty dirty as well. The front desk must not have notified housekeeping of the cahnge, so we were dismayed to return to our room to after a long day in the city, to find it had not been cleaned.If you go into the Allerton knowing it is an older hotel, in need of many updates and refreshing then this hotels is very adequate for a good location, comfortable bed and good water pessure. The downside to the comfortable bed is an extremely loud ac unit that will jar you awake every time it turns on, paper thin walls that allow lot of corridor and nearby rooms to be heard.Hotwire ranks this as a 3.5 star hotel. I would not. I would put it closer to 2.5 and possibly a 3 star.I did not check out the fitness facility, nor did we eat at the hotel. With so many great places to eat within walking distance it seemed silly to spend the money the hotel prices reflected.There is free wifi but only in the lobby, you have to pay 10.00 a day to acess it in your room.", "hotel": "allerton_hotel", "year": "2007", "date": "2007-08-28"}
