{"city": "chicago", "title": "Substandard quality for Crowne Plaza name", "text": "Recently stayed at the Allerton Crowne Plaza for a business conference. The hotel is a landmark hotel, which in reality translates into tiny, slow elevators and an excuse to keep re-using hideous fabric from the '70s. Check-in was fine, front desk was courteous. Only complaint was that my request for a king-size bed was ignored, but I was traveling solo, so settled agreeably for a queen. My room was small, but functional and comfortable. I used the internet before noticing a draft --coming from the window with a piece of the frame cut out! The window was completely closed, but the metal frame along the bottom was cut out. In April, it still gets quite chilly at night, so I was not about to take this in stride. In addition, the hotel is in the immediate vicinity of a hospital, so sirens from the ambulances are frequent and all the more noisy with an open window. I have never encountered something like this before, but when I called the front desk to ask for a room change, they seemed unfazed so I guess it's the norm for this hotel. I asked for a room that did not face the heavily trafficked street, but they said none were availalbe. When I switched rooms, I noticed that my new room had a breakfast menu strewn across the bed and one of the glasses had been used. I can only assume that another guest had switched from that room as well. In any case, my new room was substantially better (warmer!) than the old one and I was satisfied. Until I ordered room service. Speedy and courteous delivery, but short on taste. I ordered the french onion soup and lamb. The soup was too salty, lamb was too bland. However, I did enjoy the warm bread and fries. And the cute little bottle of Heinz. Really, it's the little things. My night was otherwise uneventful, and I slept very soundly. The bed was very comfortable, clean, and sleep-inducing. Parting thoughts: If you are looking for a clean place to stay, with a comfortable bed and convenient internet access, and can overlook the renovations in progress, this is the place for you. If you are looking for luxury or are more appearance conscious, look elsewhere - the Peninsula around the corner may be more up your alley.", "hotel": "allerton_hotel", "year": "2006", "date": "2006-04-23"}
