{"city": "chicago", "title": "Location Price Service - This Place Has It All!", "text": "This was our first stay at the Amalfi - we will definitely stay here again the next time we are in Chicago. The hotel is conveniently located just North of the Chicago River.....walk across the street and a couple of steps and you are at the door of House of Blues and Harry Carey's. Easy walking distance to the theatre district and Magnificent Mile. Don't expect much of a view outside of your window (the building immediately out front was under renovation) - but I'm not in the room much....I'm there to see and experience Chicago!! We had exceptionally warm weather for January, but only used 1 cab the entire time we were there...from the hotel back to the train station....so if you don't mind walking - this is the perfect location with easy access to everything. Their complementary breakfast was nice - great selection of fruits, pastries, juices, water, etc. The complementary drinks and hors d'oeuvres were outstanding. I've seen some previous reviews that complained about the bar staff. Maybe they were there on an off night - or maybe they treated the staff with little or no regard...but all I can say is these guys were GREAT! Yes, there is a tip jar...but come on --- the drinks are FREE - food is free - if you can't spare a dollar to reward the people catering to you....you definitely have bigger problems in this world. We tipped only a couple of dollars......and the bartenders treated us like we were royalty. They were the best! Rooms were clean - robes and slippers were provided (nice touch!). The only disappointing thing - not many extra outlets in the room......there were four girls sharing the room and getting ready with hairdryers, curling irons, etc was a little hectic. The Amalfi will send a bottle of wine to your room if you are celebrating a birthday or anniversary. We requested this at the time of reservation - it was not delivered the first day - but a quick request at the front desk resolved the issue that day.", "hotel": "amalfi_hotel_chicago", "year": "2008", "date": "2008-03-16"}
