{"city": "chicago", "title": "A wonderful stay.", "text": "We spent two nights at the Amalfi. After reading some of the reviews, I sent an e-mail to the hotel to request a quiet room, facing the front, rather than the back side of the hotel (where the loading dock and dumpsters are located). I received a response very promptly and was told that a room on the fifth floor with view on the city had been blocked for us. The room was extremely nice: king-size bed, big windows, very nice soothing decor. The first impression was one of cleanliness. The room smelled good, and everything looked impeccable. The bed was extremely comfortable, the linens of excellent quality, the bath products very nice. Little details I should mention: nice lamps, nice TV with CD and DVD player (DVDs can be borrowed free of charge at the front desk, and some CDs are already in the room), in-room coffee maker, nice closet with iron and ironing board and full-length mirror, magnifying mirror in the bathroom with different light settings for make-up, hair dryer, curved shower curtain rod that allows for more room in the tub/shower and makes it possible to take a shower without ever being in contact with the shower curtain, certificate showing the room is an allergy friendly room.In addition, the manager's reception with great cocktails (Amalfitini and Amore for example) and a buffet with roasted vegetables, tapenade, cheese, foccacia, and a variety of Italian cold cuts is a really nice touch after a long arduous day of shopping! Of course, the lounge is small and seating is insufficient (especially on the weekend), but if you plan it right (arrive there early!), it makes for a very pleasant hour and a half. The breakfast buffet is another nice perk. A buffet is set across from the elevators on each floor: coffee, tea, juices, a variety of pastries, croissants, bagels, and fruit are available to take back to your room on a little tray that is provided. Very convenient!All in all, I would highly recommend this hotel: friendly associates, quiet and comfortable rooms, convenient location with lots of restaurants in the vicinity (Avoid Redfish at all costs. We waited 55 minutes to be served after we ordered, the food was bad, the service inadequate, and our check --as well as the checks of our neighbors on each side-- was inaccurate. We could not wait to leave!) Good restaurant choices are Brasserie Jo for French food and Joe's Seafood Prime Steak &amp; Stone Crab, among many others.We will definitely consider this hotel next time we go to Chicago.", "hotel": "amalfi_hotel_chicago", "year": "2007", "date": "2007-02-19"}
