{"city": "chicago", "title": "Our suite was \"sweet\"", "text": "Reserved a suite at the Amalfi, May 16-18, 2007, for a family vacation. The suites are advertised as being &quot;spacious&quot;, but it was a little smaller than I had anticipated. The king bedroom was quite large and one wall is nothing but curved windows, which is quite dramatic, but the living room (with sofa bed) was a little crowded for four people (with luggage, etc.). The bathroom is spacious, good lighting and nice amenities. It was quite expensive, but many of the hotels were booked due to the Restaurant Association being in town, so maybe that's why rates were higher. They provide turn-down service with chocolates and our suite had two honors bars, two coffee makers and glass coffee mugs, two ice buckets and four wine glasses.When we arrived at 2:45 p.m. the computer was down and they could not check us in. But within 10-15 minutes, it was up and running and the front desk staff (called experience designers) were apologetic and accommodating. They have a very nice cocktail and appetizer hour in the late afternoon with free cocktails (try their lemon martini) and meats, cheeses and breads. The atmosphere in the lounge is intimate, with candles and music. Each of the hotel's six floors provides a continental breakfast on each floor where guests feel comfortable enough to come out in robes or pj's to grab coffee, juice, nice assortment of pastries, and fruit. They provide wire basket trays for your convenience to take food back to your room and it's available for a nice timeframe (two hours). The Amalfi is in a good location - only 3-4 blocks from the Wrigley Building on Michigan Ave. and a couple blocks from the Loop District. It's a short walk to catch the Red Line.If it's raining when you're in town and you're looking for a fun inside activity, the 10 Pin is just a little over a block away. Located in the House of Blues, the 10 Pin is an upscale bowling alley and martini bar. This was our second time there and it was as fun as our first visit. They have great, inexpensive food. Last year, we went in the afternoon and got right in, no crowds. This time we didn't go until about 8 p.m. and all the lanes were full, so there was a 30-minute wait. It's a little pricey, but the atmosphere is great and it's a lot of fun. If you have children, I would go in the afternoon.Another great family place is Ed Debevic's, a 50's style diner at 640 N. Wells St. (about a 10 block walk from the hotel). The waiters sing and dance and are a real &quot;hoot.&quot; All the small kids were having a ball . . . and the food's not bad!", "hotel": "amalfi_hotel_chicago", "year": "2007", "date": "2007-05-23"}
