{"city": "chicago", "title": "Fabulous!! Comfortable and complimentary breakfast and reception wonderful!", "text": "My sister and I just returned from a weekend in Chicago and stayed at the Amalfi. We found an amazing rate on Travelzoo that included valet parking. We called ahead to get early check in since we were going to arrive earlier than expected and the staff was more than happy to accomodate us. The lobby was small but nicely decorated with modern decor. There are only 6 floors in this hotel and our room was on the 5th floor on the back side, Our view was of a small parking lot and a few hotels and condos. I can't imagine that the front rooms have any better views, but we weren't in our room long enough to care about the view anyway. The breakfast on each floor was very nice- donuts, patries, bagels, yogurt, fruit, as well as coffee, teas, and juices- and you take it back to your room. The room was nice and the bathroom was spacious with a rounded shower curtain, lighted make up mirror with seat, and aveda products. The rooms have nice flat screen lcd/plasma tvs, wifi, iron/ironing board, safe, hairdryer, dvd/cd player and writing desk. The minibar was stocked with snacks and drinks that weren't too ridicuously overpriced but still to pricey for me. They have a fitness room that has 3 treadmills, 2 ellipticals, and 2 bikes, as well as free weights. The fitmess room also has filtered water, towels, and 2 tvs. The highlight of our stay was the complimentary evening reception with cocktails/beer and food. The location is great and we walked everywhere during the daytime. It's one block north of the river and a few blocks from the Magnificent Mile on Michigan Ave. The House of Blues is across the street as well. There is a CVS a block away, Keefers restaurant next to it, Harry Carey's across the street(which is where the room service is from which is somewhat expensive), and many restaurants in the area. They offer in room spa services but it was too pricey for us to indulge in that luxury. The staff is very friendly and always ready to help with anything! If you are looking for an affordable hotel in a great location with free breakfast and reception, this hotel is must!", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-07-20"}
