{"city": "chicago", "title": "Some Birthday Surprise!!!", "text": "I booked a suite, for my hubby and me,at The Allerton Crowne Plaza, for my birthday. When booking our suite, I had asked that a refrigerator be in the room, when we arrive. I was told they did have refrigerators and they would try to accommodate me. A few days before we were supposed to go to Chicago I had spoken to someone on the phone from this hotel, that I thought was with concierge services, asking if they did anything special for people's birthdays. I told the gentleman my birthday was our day of arrival. He told me they could do something and then asked me what our estimated time of arrival was. I told him around 10 o'clock in the morning. When we arrived at the hotel, at noon, we had to take a small elevator up to the third floor for check in. No problem. Then, we took another set of ( small and slow) elevators up to our suite. I am now extremely excited thinking everything will be perfect for my birthday! What a major disappointment to find NO REFRIGERATOR and NO BIRTHDAY SURPRISE. Also, to find out later that this guy that was supposedly with concierge services was really a bellman!When I went to talk to the guest relations manager, Brian, I pulled out my Priority Club Membership card and told him that this card apparently means nothing at this hotel. I had spoken to him about the refrigerator, as well as the birthday surprise.He tried to get me a refrigerator that day, but was unsuccessful. We finally got it on Friday evening.(we arrived on Wed.) As for the birthday surprise.. later in the evening of our day of arrival, someone brought up a little basket of fruit, which was kind of frozen, along with a bottle of merlot wine and a card wishing me a happy birthday from the staff. It was more like an afterthought. There was also a problem with staff and late check-out. I was given three different times that I could check out. Once again, I had to call down to Brian to clarify/rectify the situation. He allowed us a later time for check out. Thank you, Brian! I will probably not give this hotel a second chance. To me first impressions are extremely important. Also, when you pay a lot for a Suite, you should automatically have a fridge IN the suite. You should NEVER have to request one, much less pay to rent one! (Are you listening Crowne Plaza?) Also, staff should be taught how to handle guests. I can say a couple of nice things about this place. It was a nice touch to have a relaxation CD and a little package with lavender spray for linens, an eye mask and ear plugs. The restaurant was great. Food was wonderful and reasonably priced for a hotel restaurant. Wait staff was friendly. Also, our suite was very nice. (See pictures) Housekeeping was great! Those women work very hard and they are extremely accommodating. My thanks to them.", "hotel": "allerton_hotel", "year": "2006", "date": "2006-08-22"}
