{"city": "chicago", "title": "Quiet room friendly staff can be noisy outside.", "text": "I stayed Nov. 11-15 in a regular room, second floor. I heard no noise from the other rooms; the only time I heard a shower from an adjoining room was when I was in the bathroom. The fact they have a strip across the bottom of the door from the room into the hallway definitely helped block hallway noise.However, unfortunately the hotel can't do anything about outside noise; i.e., kids yelling on the sidewalk, especially at Harry Caray's across the street; idiotic cabdrivers who have to honk their horns for the heck of it; sirens; etc. If you're a light sleeper and have a room facing Kinzie those noises can definitely wake you up.It didn't seem like the room was as big as advertised; to me, it seemed small. However, everything was clean and the room smelled fresh. The double shower was definitely nice!The bellmen recognize you pretty quickly when you're going in and out and greet you with a smile and a warm hello every time! They definitely seem like they enjoy helping visitors.The front desk personnel were also very friendly and greeted with smiles.I loved the breakfast on every floor! Normally I don't get up in time, but I did 3 out of 4 days this time. It was so nice not to have to get on the elevator and go down to a breakfast area. I wish other hotels would copy this! The croissants were delicious! I'd like to see the yogurt colder, though. I don't drink coffee, so I can't comment on that.Went to the manager's reception 1 night. I don't drink, so the bar wasn't a big deal to me, and the only thing I ate was some cheese with the little toast bites. My friend had several pieces of the meats, some of the tapinades, and the artichokes, which he went back for seconds on. I would agree...it is a small room, and would get tight pretty quick. I prefer the spread Homewood Suites puts out...and they change the food every night.I wish the rooms had little refrigerators, and that newspapers were sold in the lobby. I always buy newspapers wherever I go. A USA Today was hung on my door every day, but it would be nice not to have to walk around the block to a 7-11 to get the Tribune and Sun-Times.Housekeeping had some quirks. The first day she put the dirty plates from the breakfast and green coffee glass cups on the floor outside my door. While the plates were taken, the green cup was left there until my last day there...2 days later. I just waited to see how long it would stay there. Dirty glasses were not always replaced; coffee and tea packets also were not always replaced. I always take the toiletries for the Ronald McDonald house; these were replaced every day. However, when I left a note asking for extra towels &amp; glasses, 2 extra towels and 2 extra glasses were left. The first day when I was leaving I happened to see housekeeping go down the other hall, and told her she could do my room any time it was convenient. She went straight to my room to take care of it!I felt very safe here (am a single female). The halls are very well lit, and you have to walk past the front desk to get to the elevators. I do wish the rooms had brighter lighting, though. Even with all the lights on in the room it was hard to read on the bed. And the chair is more decoration than functional; my friend said it was very uncomfortable.The Wi-Fi in the room was slow sometimes, very fast others. But I had no problems logging on and staying on. Alarm clock was very easy to program.FYI: parking rates in Chicago went up again! The self-park garage at State &amp; Kinzie is $37/day. I moved my car down to the garage on Kinzie just west of Clark (a little over a block away). It's $28/day. The lots on Rush &amp; Wabash also went up to $35-$38. The only place it's less is on Wabash just behind that big church on state; it's $25/day there (probably not for long, though!)It was definitely worth $119 night (Travelzoo special). I would certainly stay here again!", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-11-15"}
