{"city": "chicago", "title": "Worst Hotel I have ever seen!", "text": "I travel the nation almost every weekend of the school year representing my school's track and field team. Never in any of my endeavors have I encountered such a despicable place of business. I was in town visiting, things came up, and I needed a place to stay last minute. This hotel was write in the middle of Belmont and only about 90 a night so I thought wow what a deal right? WRONG! I was angered enough that only one of the two heaters in the room worked, the windows did not shut completely, and that the place was just completely run down. If that was not bad enough after I came in for the night I pulled back my bedding to hop into bed to find pubic hairs and a small blood stain. THATS RIGHT PUBIC HAIRS AND A BLOOD STAIN. So what did I do next? I marched down to the front desk where I asked for clean sheets. They informed me that housekeeping was gone for the day and that they just rented their last room so there was nothing that they could do for me. Never in my experience of staying at inexpensive institutions have I seen a hotel/motel. I just sucked it up, and I went back upstairs and brushed the debris out of my bed. After trying to sleep for about an hour I realized that now neither heater in my room worked. At this point i went back down and asked what was wrong with the heat to be greeted with the response: &quot;There is nothing I can do its broken!&quot; After all this I just went back up and suffered through the night awaiting my chance to get out of there. At some point I finally fell asleep and was abruptly awakened by a lady slamming on my door and screaming: &quot;ITS CHECK OUT TIME AND YOUR STILL GET THE HELL OUT&quot;. I packed up as quickly as I could and headed down to the front desk where I demanded to speak to a manager. I was informed that the only time that a manager is present is around 8am in the morning. I am currently attempting to contact the manager in an attempt to receive a refund via the phone number on the one inch square piece of paper i was handed as a business card at the time of my complaints.", "hotel": "abbott_hotel", "year": "2007", "date": "2007-11-08"}
