{"city": "chicago", "title": "Great Stay Great Location!", "text": "Stayed 2 nights in a junior king suite (pictures listed under executive suite on the Allerton website) after finding a great deal online. This room has a bedroom and separate living area, with a t.v in each! I enjoyed having the extra space knowing that the petite and standard rooms are quite small, but this is a boutique style hotel, and that is what you should expect! With that said, I could have not been happier with the hotel and the location of it. The staff was nothing but friendly and helpful. For example, after hours of sightseeing the first day, when we arrived back to the hotel our luggage was still not brought upstairs. When I called down to the front desk they apologized and immediately had someone bring it to us. The man that delivered the bags then gave us tips on where to go for some decent Chicago pizza! The concierege made reservations for us and always helped with directions! The Location was also great...entrance is on Huron Street, Michigan Avenue is to the right of it. The water tower is a 2 second walk as well as the Hancock tower, Lots of great stores along the miracle mile, navy pier about 10 minutes, less than 5 minute walk to the red line which can take you into the loop where you can easily walk to other great destinations. Bathroom had bath and body works shampoo and conditioner, both smelled great, wish they'd add a lotion to the mix! Never ate at the hotel, breakfast prices were too high, but everything else seemed reasonable for a hotel......they had different drink specials each night in the lounge...free coffee in the morning...Our room had windows on three sides...in the bedroom we had a view of Michigan Avenue, and partial view of the water tower...the other 2 sides were of buildings. In the living area we kept the blinds closed because we were right next to an office building and I could practically read what was on the persons computer screen (but it is a city, and buildings are close together, can't always have a great view)...I do recommend going up to the fitness center at night...small windows, but great view of the water tower and hancock tower out of one of them, and they look beautiful at night... I have no complaints about the hotel, but will list some things that maybe could have been a little better, but did not at all make my stay any less special or comfortable!1. bathroom was small, toilet takes up too much space next to the shower, there is only a small shelf above the sink for toiletries, and a magnifying mirror poorly placed right behind the door, so it got hit every time we opened the door!.....shower head was a little low for a person above 5'9..but great water pressure!2. elevators were slow at times, and smaller than normal (but could easily fit 5 people or so)...if you've been to a small European hotel, these elevators will seem huge :)3. breakfast menu is ridiculously overpriced4. internet is NOT free in rooms, but FREE in the lobby and business center.5. towels and bathroom were not very soft.6. Pillows a little too soft as my head would sink right through them...I found bed to be comfy but my friend hated it.", "hotel": "allerton_hotel", "year": "2009", "date": "2009-11-04"}
