{"city": "chicago", "title": "4 Star? I don't think so..", "text": "I booked the Allerton through Hotwire on a convention weekend in Chicago when many hotels were booked. Based on the previous reviews I'd seen here, I was nervous about my planned three-night stay there. As it turned out, I was right to be.To say that the room is small is an understatement. The floorplans on the hotel website seriously misrepresent the room size. Our room has one queen-size bed, and space only for one night table--I guess two people aren't allowed to read in bed at the same time. The bathroom is similarly small but adequate. The two bath towels, however, are more worthy of a Best Western than a supposedly 4-star hotel. Ragged, thin, and misshapen. I've never been a hotel that does not provide two bars of soap--one for the bath and one for the sink....until now. Yes, there is a tiny bottle of shower gel--I guess my husband and I are supposed to take showers on alternate days during our stay.Wallpaper in the bathroom is peeling. All day long, there have been large plastic bags of dirty linen in the hallway. I've never seen that kind of thing at 4 PM at a 4-star property.Internet is $9.99/day and is wired DSL, not wireless. There's one telephone in the room, located on the desk. I guess we can fumble across the room (all of two steps) when our wakeup call comes.The elevators have been discussed by others. Tiny, slow to come, and apparently one or two are always out of service. Just try not to visit during flu season--it's hard to avoid skin-to-skin contact on most elevator rides here.I will admit that the location of the Allerton can't be beat. But this is seriously the smallest hotel room I have ever been in, bar none. I feel like I'm in a garret, not a hotel. The amenities are limited--no fridge, miserable towels, a phone that has seen better days. I would say to management: Why not just drop the pretense to being a 4-star property? If you lower expectations, your guests won't feel quite so misled.", "hotel": "allerton_hotel", "year": "2008", "date": "2008-10-02"}
