{"city": "chicago", "title": "Not quite like the pictures but ok", "text": "I spent a lot of time researching hotels and just thought this one was so so. It looks chic in the photos but it's missing something...or a lot. It's pretty basic and the rooms are just so so. It's kind of like they wanted to be upscale and hip but missed the mark somehow with the decor. It was like a W wanna be. Don't like to be so honest but that was my impression. All the pictures of Amalfi got a bit redudant as well. We got the message that they like the Amalfi coast which I'm sure is nice. But you didn't feel like you were there with the decor and pictures. Not sure if they were trying to have that effect or some other effect. At least I thought the service was a lot nicer than the W. They had a basic cold breakfast buffet (kind of boring, but hey, it's breakfast) on each floor which is convenient and they have a cocktail lounge that is also included on week night evenings. It seemed like one big business party when I went in, so I got something and quickly left as I didn't want to interrupt everyone that seemed to know eachother from that particular company. I think there are nicer areas to stay in Chicago rather than this area as it looks a bit dingy around the hotel. It has the feel of an old side street that's seedy (even though it's not seedy at all). It's on a wierd street though. Yeah, there are a lot of restaurants in the area, but it's not where you want to be. If your a tourist as you're better off staying near the Water Tower area (on North Michigan Avenue) or near the lake (Lakeshore Drive) where you can walk in the parks, go shopping, and see Lake Michigan within a few steps. This is too far from that. If you've just got business meetings in the area then the hotel is fine. It seems frankly to be more of a business hotel as we saw business people zipping in and out. If you get a good rate and want a safe decent place, then this is just fine. But I think you can find plenty of others that are better in a better more convenient area in Chicago. You have to pay for parking by the way.", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-04-26"}
