{"city": "chicago", "title": "Excellent hotel great location", "text": "I stayed at the Amalfi for 3 nights in February. As previous posters have mentioned, you can call the hotel directly to get a better rate; both the hotel's website and the reservations agent originally quoted $200+ a night. When I pointed out that both Expedia and hotels.com were charging $130 a night, the reservations agent asked me to hold for a few minutes, then said that they would be willing to match the lower rate!The lobby is recently renovated, and the hotel as a whole is very nicely done. From check-in to the time we left, they were extremely helpful and pleasant. When we asked the front desk about taking an architectural tour of Chicago, they looked up the times and price, and even offered to call the Architectural Society to inquire about whether the tours were full. I also overheard another staff member offer to print out movie showtimes for another guest and bring them to another his room!The rooms were large and well appointed; ours had 2 queen sized beds (extremely comfortable and soft) and a clock/radio that you could also play your iPod music on. The shower was amazing (two showerheads) and is stocked with Aveda products. Our room was at the side of the hotel and looked out onto an alley. Previous posts have mentioned the considerable noise from garbage trucks; while you could hear the noise (we were on the 5th floor), it was either evening or morning and not at unreasonable times.There is an open bar every evening but we didn't sample it. The free continental breakfast each morning is a huge plus; they put our a breakfast spread on each floor by the elevators, with bottled juice, pastries, bagels, tea, and coffee. You can get your breakfast while still in your PJs and bring it back to your room, unless you want to toast your bread, in which case you have to go up to the 6th floor.The location of the hotel is ideal for exploring Chicago. It's a short, 5 minute walk to State station; we were able to take the El train (Orange line) from Midway airport directly to State then walk to our hotel. It's right by the Chicago river, a 10-15 minute walk to both Millennium Park and the Magnificent Mile, and within walking distance to many excellent restaurants.", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-03-02"}
