{"city": "chicago", "title": "Impeccable service", "text": "Stayed here six nights with my son. Got a deal at 119us per night for a double queen room on travel ticker, a great resource for Chicago hotels. I wanted something with a breakfast as teenagers are always hungry.We got there early and were able to check in right away. I requested a fan for the room, I like the noise to help me sleep, and it was already set up before I could tip the guy! The front desk is also the concierge and they were very knowledgable on the sights I wanted to see. You check in sitting down and the staff seem to remember you, due to the small room numbers I imagine.During my visit they were experimenting with drink 'coupons'....going to the happy hour which were given to me upon check inthey had discontinued it a day or so later, I still have them as a souvenier. I think they were trying to restrict some guests for ordering too much of their top shelf liquor. I enjoyed their italian beer and their house drink, a lemonish martini. Worth the dollar a drink tip, not required. My son would order a coke but he didn't like the evening offerings. That could be changed around a bit, more finger food as the offerings could be messy when socializing. Perhaps gourmet pizza bits. I only was at the hotel for two nights during the manager welcome so not sure if they switch around the menu. I did notice some 'hoarding' at the continental breakfast, excellent. good quality baked goods, juices and coffee/tea. Also very nicely presented. I did see many people unaware that they could go to another floor if they were out of something, perhaps a note placed on each floor explaning this to alleviate frustration.Also I was able to use the free computer and printer in the business center with two macs and 3 windows and no wait there either. What I liked best was the close proximity to Andys jazz club around the corner.I read in other reviews about the location. It's not bad, a little scraggly but being improved and the proximity to Trump tower it should even become a better area.My room was on the sixth, top floor a nice view, directly across from the lounge. Very nice and quiet after 8. If I return, I would stay somewhere else but I would highly recommend it to anyone visiting Chicago.Also our flight was to be later in the evening and the bell hop watched our luggage.When we returned, they didn't even ask for our tickets and had them ready. Great service, a few bucks tip goes a long way at this property.", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-11-15"}
