{"city": "chicago", "title": "Miserably disappointed....", "text": "I visited the Allerton this past weekend for a girls trip. To say we were disappointed is an understatement. I visit Chicago many many times a year and often stay at many other fine hotels on the Magnificient Mile. I had yet to stay at the Allerton, and can tell you it will be the last time. I can say one thing..it is in a great location. That is the extent of the pro's. This was my girlfriends first time to Chicago and I was so excited for them to experience an old hotel like the Allerton, however now I am embarrassed.From the time we arrived (it was pouring down rain) the valet and bellman could not be bothered to help us. We had to unload our entire car ourselves, and then actually yell to get their attention to come and valet the car. You would think at almost $50 a night for valet they would be somewhat attentive. They did not offer to take our bags to the room or even hold the door, the bellboys continued to have a conversation amongst themselves why they watched us struggle in the pouring rain.We then went to the 2nd floor (odd for checkin) to the front desk, and was greeted by a lady whose name escapes me. She was pleasant enough, but seemed uninterested with the problems we had. I explained to her what had happened and she offered us a &quot;free breakast&quot; which was insulting as it was only the smallest continental breakfast I have ever seen, toast , crossaint, and juice and coffee. But for $5 additional you can upgrade to an even more disappointing buffet.So back at this point, we had found a &quot;great rate&quot; on priceline.com in which I had paid full price or I would have just left right then out of sheer principle,. but we couldnt. Once we got in the tiny tiny elevator, and made it to our room I was fuming. I have never had to drag my own luggage, soaked by rain to my room at a hotel of this caliber on a Thursday evening at almost 9pm. We opened the room, and I thought it was a bad joke. There were 2 double beds, in which you could barely walk by them., The tv was in a position that you could not watch from bed. The bathroom was a larger joke, no counter space and the shower had ZERO pressure. It seemed like I was in a bad movie. The beds had feather mattresses and were extremely uncomfortable. One more pro for the hotel was that they offered 2 glasses of wine in their bar for happy hour, but the bartender was totally aloof and arrogant.Then the topper was there was one tiny bar of soap in the bathroom for the shower, but none for the sink. They also wanted to charge for internet access in the room. But if you want to drag your laptop to the lobby you can have it free there.The hotel has been remodeled, and is very clean. But it is clear that management allows customer service to be at the very bottom of their priority.I have traveled extensively for business and leisure, and am accustom to hotels that appreciate our business and treat us as guests. Unless this is the last available hotel on the magnificent mile, I would recommend NOT giving them your money.", "hotel": "allerton_hotel", "year": "2009", "date": "2009-10-04"}
