{"city": "chicago", "title": "Don't Bother", "text": "I stayed here via a win on Priceline - good thing i didnt pay full rack rate for this hotel! I had one night that I just wanted to relax after a business trip in Chicago and should have continued my stay at the Affinia around the block!I arrived on a rainy Friday, tired and exhausted from the work week. I was here alone, just wanted to chill and relax and take in the Michigan Avenue sights. The hotel has a very odd entrance. You arrive into the hotel to the bellman's area - - the bellman gladly took my two bags and gave me a ticket/receipt. I figured he would just bring the bags up to my room. NOT. They were SO busy with hundreds of bags in this small area -- and then that particular area leads you to a whole other section of elevator banks -- taking you up to the lobby on the 2nd floor. I figured that out....went to the registration level and checked in. (Check in process took forever - the line was very long). While i was there, this poor guy, (father of the bride) was already complaining about his very small room. I was thinking...OH NOOOO - i just got here and there are problems already? I got to my room on the 19th floor and it was TINY. Very poor layout, not very updated just a little box and a very small bathroom that was just looked like they attempted to renovate it, but it was still old. Only one person can fit i there at a time, put it that way. The noise level wasnt bad at all compared to the Affinia around the block. My room faced Michigan Avenue and not the hospital down the block...that was THE only good thing - the room was quiet and i managed to sleep well. The bed was just OK - -nothing ultra comfy/modern. Oh, and internet was additional at $9.95.This was the first time that Priceline has ever disappointed me with a hotel. I wouldn't ever stay here again. And, if I paid full price for this hotel, I would have been really angry. Do yourself a favor, find another hotel in the city.", "hotel": "allerton_hotel", "year": "2009", "date": "2009-10-25"}
