{"city": "chicago", "title": "Best hotel I've ever stayed at and I've been a lot of places", "text": "We had the pleasure of staying at the Amalfi hotel this past weekend. We were there from July 31 - August 4. We had two days that we paid full price for; the other two nights we got a discount online. I will give you the pros and the cons:PROS:(1) Excellent location. You could go for a leisurely walk at night time without there being 400 tourists in your face, unlike the places right on Mag Mile. It was in a safe neighbourhood and close to a ton of great restaurants in the Gold Coast and River North. If you are taking the boat tour, it was about 3 minutes away. We walked everywhere. Our room was facing Harry Carey's, and on the 2nd floor, so I was worried it would be noisy, but it turns out it was completely quiet.(2) Best beds EVER. So comfortable I was sad to come home.(3) Great breakfast spread. They had bananas, apples, oranges, yogurt, coffee (decaf and reg!), tea, juices, bagels, muffins, donuts, danishes, crossiants, etc. It was really fresh, too.(4) AMAZING evening lounge. For free! Get there for 5:25, because the line-ups are pretty intense. They give you free drinks, generous (tip the bartenders) amounts of alcohol in the drinks, and have a wide selection for the open bar. We went every night we were there (actually from 5:30 - 7, despite what the website says). The food spread was really good there, too, they had sliced meats, cheeses, breads, and some antipasto. This was a good idea to do before dinner, so you could relax and then go out for dinner a bit later. (5) We checked in early and they had a room ready for us. CONS:No real complaints. The only thing is housekeeping (I seem to have bad luck with housekeeping!). The first time they did maid service on our room, they didn't give us any more toilet paper, even though we had about one more use left on our roll. They didn't refill our Kleenex, either, even though the tissue was orange (indicating the end of the box). I called down and asked for another roll of toilet paper, and when we returned five hours later - still no toilet paper. Later, we had the sign on our door that said &quot;do not disturb&quot; -- and when we returned they had made-up our room, meaning they entered without permission. I called and asked about this, and they said that the maid had been confused by the sign on the door. It wasn't a huge problem but it creeped me out because I had stuff lying around and wasn't expecting them to enter.", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-08-05"}
