{"city": "chicago", "title": "The Amalfi delivers!", "text": "First trip to Chicago, wanted a nice place downtown. The Amalfi was just that!Location: Just a block north of the river, a few more blocks to lots more like Michigan Ave, Millenium Park, Lake Michigan. I don't mind walking, so the couple of blocks walk from the Clark train station to the hotel was not bad at all. If the weather is bad, a cab ride would be short and cheap.. much cheaper than a cab ride all the way from O'Hare! The train, FYI, was $2 one way.. great deal! Views from the rooms won't be too special, as the rooms only go up to the 6th floor and taller buildings are all around. Oh well, get out and walk! Right across the street is Harry Caray's steakhouse.. I had a very tasty dinner here and really enjoyed the whole place.. totally busy, hour wait, but our waiter was completely on top of things. Condition: They keep a nice hotel! Lobby is a good first impression of the hotel, as it's fairly small but quite swanky. Rooms were the same. Everything was kept up well, minus the ceiling in the bathroom looking kinda rough.Service: Everyone I encountered, from door man to bartender to cleaning staff were quite pleasant and helpful. Nice to see!Perks: The evening reception was EXCELLENT! Very decent selection of comp drinks, including some well drinks, wine, beer, and sodas. Plus, they had a nice spread of meats, cheeses, breads, olives and the such.. and plenty of it. Seating was limited to a few couches and probably 8 tables w/ 2 or 4 chairs. Easily packed, but both nights I was there I was able to find a table within a couple minutes of getting to the room. The breakfast provided was also great! I believe it's available 630 to 930am and is set up on each floor. They provide a very nice selection of coffee, tea, juices in bottles and baked goods like donuts, danishes, breads and more. Baskets and plates are provided, so you can load up all the goodies you want and carry it easily back to your room. For the price of FREE?! Wow! Thanks Amalfi!I would recommend this hotel to my closest friends and family without hesitation, and hope to stay again soon myself!", "hotel": "amalfi_hotel_chicago", "year": "2007", "date": "2007-12-22"}
