{"city": "chicago", "title": "Be warned...", "text": "Just as another reviewer stated, our room was on the second floor overlooking an alley and dumpsters. While we were disappointed in the view, it was not a major problem. What was a major problem was that during 4 nights of our 7-night stay, we could clearly hear the bass from the nearby nightclubs. I am pretty sensitive to sounds and it was practically impossible to fall asleep with the *thump-thump-thump* of dance music reverberating through our room. This was sometimes interrupted by trucks emptying the dumpsters during the middle of the night, which at least broke up the monotony of the music. Our last night there was the worst, as several patrons of the nightclub ventured into the alleyway for smokes (I could see them clearly from my window), so we could hear human voices in addition to the music. This is very unfortunate, as the hotel was pretty wonderful in every other aspect. The staff there was friendly, the continental breakfast was the best I'd ever seen (coffee, orange and apple juices, fruits, and many great pastries), the rooms were comfortable (I even looked into buying a pillow), the bathrooms clean and spacious with a double shower head (although no blowdryer), free happy hour cocktails and snacks every day (yes, free alcohol!!), the turn down service provided free Ghirdelli chocolates, and the location was great, just blocks away from the Magnificent Mile and subway stops. The hotel, in and of itself, was really well put together, and impressive in its own right.All that being said, I would not stay at the Amalfi again. In my opinion, it doesn't matter how great the hotel is - if you can't have a restful sleep at night and you get out of bed cranky in the morning, then nothing else matters. I've stayed at a 2-star hotel that literally had prostitutes hanging out in the lobby in the middle of the night, and had a better night's sleep.If you go and you luck into a room that is not facing the alley, perhaps you will not have problems with the noise, and your stay will be enjoyable and restful. I would also recommend the hotel for those that are going to be out partying all night regardless, and who would thus not have concerns about late night noise. But for those that need some measure of quiet at a reasonable hour in order to fall asleep, I would most definitely recommend looking elsewhere, or at least ensure that the room you book is not facing the alley and is on one of the upper floors, before you confirm your reservation. Otherwise, come packed with earplugs and hope for the best.", "hotel": "amalfi_hotel_chicago", "year": "2008", "date": "2008-07-06"}
