{"city": "chicago", "title": "We Had a Wonderful Stay at the Amalfi", "text": "We had an excellent stay at the Amalfi Hotel in Chicago. The location was a big plus, as it was in River North, just above the Theatre District and the Loop. Both were within walking distance, so that we only had to use a cab twice the whole five days. We walked to the Taste of Chicago, and took the free trolley around the Loop and to the Navy Pier and the Field Museum. The hotel was spotlessly clean, and every single person we met was helpful and cheerful. Our luggage was lost by our airline, and though we checked in at 11:30 at night, we were quickly given toothbrushes, toothpaste and deodorant! Our 6th floor room faced Kinzie St., and it was at the end of the hall (612) so our location was quiet and had a nice view of the city skyline. There was not much construction going on in the museum building going up across the street, and the Trump Tower going up in the next block, so we were never inconvenienced. We enjoyed the quiet and we loved the contemporary decor. Nice touches: incredibly well-stocked honor bar, books, magazines, CDs and nice clock radio (tuned to a jazz station.) My husband had ordered champagne and candles for our anniversary (which we spent chasing our luggage and arriving in Chicago 8 hours later than we had planned) and they were waiting for us...but the ice had melted and the candles had burned out. But it would have been really cool if our plans had worked out. Thanks to the hotel staff for taking care of that for us!It was great that there were very few children in the hotel...and the few we saw were teenagers. The continental breakfast was good, though not filling. We were able to get coffee (which was quite good) and fruit before heading out on foot to get a real breakfast. The white wine at the &quot;cocktail party&quot; was bad, though. And it is really weird to go into this room with Muzak playing and strangers standing in line only talking to the person they came with. (And one couple brought their child.) To make this a party, one really needed a social director kind of person to get people to mix. Everyone got their drinks and went back to their rooms. Weird. We only tried this once. After that, we went to a real bar. My only complaint was that at 9 p.m. we had to call and inquire where our laundry was, after we had been told it would be delivered to our room by 7 p.m. And the laundry service was incredibly expensive. If we had known that at first, we would have just bought more clothes to wear instead of cleaning the ones we had used. (Luckily, our luggage arrived before we left Chicago.)Whenever we have occasion to visit Chicago again, we will be staying at the Amalfi. Highly recommended. They took good care of us.", "hotel": "amalfi_hotel_chicago", "year": "2007", "date": "2007-07-05"}
