{"city": "chicago", "title": "A Little bit of Europe", "text": "After reading the reviews, I was a little hesitant when I found that we'd bid on this hotel on Hotwire and got it for the weekend at $130 a night.We usually stay at 4 star hotels but so many of these were full and there were no deals to be had for this weekend so we took the leap and we were glad we did. Although it's far from perfect in many respects, I have to say that when we walked in and rode up the elevator to the third floor and walked into the lobby, I was reminded of some hotels where we stayed in Europe. Lovely, tall windows and a wide, pleasant seating area with a small reception desk are on the third floor before you take a different elevator up to your room. We arrived early, around 10 am. Sara checked us in and she was very pleasant. She said she didn't have a king bed at that time, but gave us a queen on the 16th floor with a view of Michigan Ave.  Again, the small elevators and small hallways and the very small rooms reminded me of one hotel in particular where we stayed in Paris which just brought back a wave of memories for me. The bed took up most of the room but that was part of the charm for me. There were tall windows that you could open. We opened ours a crack for fresh air and could hear a sax being played on the corner down the street. There was coffee on a small table, a desk, small closet and safe in the tv cabinet. The bathroom had only a shower which is what my husband and I prefer. The bath was clean &amp; provided a small shelf for your toiletries. The hotel also provided a small bag with lavendar spray for your pillows and earplugs and an eyemask with a relaxation CD.  We could see Chicago Place food court out our front window and Michigan Ave. to the beach out the side window. Shades were helpful at night to keep out the light of the busy city but we weren't bothered by the city sounds.  This hotel is close to tons of great restaurants. When we arrived, it was cold and rainy (again reminding me of Paris) so we walked a couple of blocks North (to Superior) and one block East to a little Italian place called Joey Buona's. We had hot bowls of Minestrone and Pasta Fagioli with baked garlic cheese bread dripping with cheese and looked out the cafe curtains as the people walked by with their umbrellas. Everyone in the hotel with the exception of one seemed very personable and willing to help if needed. A paper was delivered to our door each morning.  There are just a few things that the hotel could do to make the stay even better and that would be to keep each room as problem free as possible (little things matter). Our room had a desk light that had a broken outlet, a loose make-up mirror, and a shade that still worked fine but needed to have the bracket holding the rope that worked the shade to be reattached at the bottom. (I did leave a note since I do think the guest should notify the hotel in order for the hotel to attend to these things). Also I would have loved my towels to be larger but I still say the hotel has a charm of it's own.", "hotel": "allerton_hotel", "year": "2005", "date": "2005-10-31"}
