{"city": "chicago", "title": "Excellent Stay at the Amalfi", "text": "We stayed at this hotel for business/pleasure. I requested an early check-in and was accommodated without a problem on arrival. The staff was also very helpful in making sure that the mini-bar had space for my own personal use (I was traveling with an infant and needed room for milk). The room was average size for a city hotel room and the furnishings were modern art deco. The closet space was small, but enough for what we needed. The bathroom was large and had Aveda bath products. The hotel and rooms were very clean and the housekeeping did a great job every day of cleaning the room and providing turn-down service in the evening. Every morning there was a fresh continental breakfast and delicious coffee in front of the elevator. Our room was right outside of the elevator and we did not hear any noise outside our door. The hotel also has a complimentary cocktail hour each night with liquor, beer, wine and appetizers. The room service was delivered from Harry Caray's Restaurant with the prices being mid to high and the quality of food average. The mini-bar had some good snacks and considering what my husband ate, I was surprised it only came to $19 (we stayed for 5 days and he ate goodies the entire time). My husband used the gym and he enjoyed the machines. The gym is also open 24 hours. The staff was very helpful, pleasant, and accommodating. One time we dropped a glass in the bathroom and the housekeeping staff immediately came to clean it up. The only improvement that I can say the hotel needs is the Internet access. The wireless was down at some point every day. The hotel also has a business center that you can use with a printer and fax machine, but the Internet in that room was down when I tried to use it. The engineer was very helpful and apologetic about the problem and he had it fixed within an hour of my complaint. I saw some guests with pets so I think that dogs are allowed in this establishment. The hotel does not have a pool. It is conveniently located next door to Red Fish Restaurant (which has great food) and there is also a 7-11 right around the corner. There are bars and tons of places to eat all within walking distance. This hotel is not as close to Michigan Avenue as some of the other hotels I have stayed at in the Chicago area, but still all within walking distance to museums, shops, attractions, etc. I would definitely stay here again and would recommend this hotel to couples and people on business. The hotel is also family-friendly, but because it does not have a pool, I would not stay here again with my child.", "hotel": "amalfi_hotel_chicago", "year": "2006", "date": "2006-07-08"}
