{"city": "chicago", "title": "Location Location Location--Nothing Else!", "text": "This hotel was highly recommended to me by a co-worker. He was right in the sense that the location is great--we were in the center of the action. I have to concentrate on this to forget about my distaste with the front-desk staff and the condition of the rooms. I booked two non-smoking rooms with two double beds and because I had two 14 year olds in one room, I requested adjoining rooms during the reservation, confirmation and arrival. Since I requested early check in--we arrived before noon so the front desk person just gave us one room. I mentioned that we needed two rooms together and his response was &quot;We are overbooked, check with us later&quot;. At this point we felt very thankful that we had a room to change and put our suitcases in. The room had an ackward set-up, very small and not very clean, and a &quot;lovely&quot; view of the parking garage's wall. After having a great lunch at Giordano's, I went back to the front desk, this time I spoke to a female front desk employee that told me if I gave her my credit card she will hold my second a room in the 5th--Did I mention that our first room was in the 6th floor? I checked back in an hour and a different male front desk employee told me that my smoking room on the 11th floor was not ready yet. I asked him what happened to the room on the 5th floor that I gave my credit card for. After a lit bit of perseverance on my part, he found the paper I signed, however, there was NO room available on the 5th floor. After he reminded me (AGAIN!) of the hotel's overbooked situation he said he had a petite suite on the 6th floor with one bed. At this time, we realized this was as close we were going to get to our other room so we took it. I was dissappointed with the staff--I felt they took a &quot;I don't care pill&quot; before coming to work. I made it clear from the very beginning that having two rooms as close as possible was a priority for my family--however I was misled by the reservations staff and ignored by the front desk staff. If a clean and friendly place is a top requirement for you, I will not recommend this hotel. If location if a top requirement for you, go for it! As for me, I will not stay at this hotel again.", "hotel": "allerton_hotel", "year": "2005", "date": "2005-07-17"}
