{"city": "chicago", "title": "Loved the Allerton and it's staff", "text": "My husband and I were lucky to even get into Chicago, as the weather was terrible and we traveled on the second busiest day of the year. I called Mateo' at the Allerton several times to confirm that we could check in after midnight. He was very sincere and assured me that we would have a room after such a taxing day. After a 12-hour travel day (should have been 3 hours), we arrived at the Allerton. I felt like Mateo' and I were old friends and he treated me as such. He was a precious gem. We upgraded to a junior suite and were glad we did. We had a corner room with a great view of Michigan Avenue (Tiffany &amp; Co., Neiman Marcus, Macy's). The suite was clean and updated. The king bed was super cozy and comfy. We loved having 2 flat panel tvs. The bathroom left a bit to be desired. The toilet was industrial. The shower/bath was normal size, but the drain was slow.We thought we'd really miss a coffee pot in-room, but it wasn't a big deal. We walked to Dunkin' Donuts the first day (don't waste your time, as it was weak), then drank the complimentary coffee at the Allerton. That coffee was excellent! It was the talk of the hotel.The gym at the Allerton was amazing! It was beautiful and clean and comfortable. It had ample equipment. The elevators were on the small side, but they were normal speed. We had no complaints there. The bar was never open or manned when we were in the mood for a drink, but that wasn't a big deal. It made us get out and explore. I didn't read reviews of the Allerton until after I booked the trip, so I was pretty nervous about how it would go. I would suggest that you don't put too much into the negatives. I am not easy to please, to my husband's chagrin, but I was thoroughly pleased with our experience. This is the first review I've written, I hope it helps. We will happily stay at the Allerton the next time we visit Chicago.", "hotel": "allerton_hotel", "year": "2008", "date": "2008-12-29"}
