{"city": "chicago", "title": "Great Hotel in Excellent Location", "text": "My wife and I stayed at the Amalfi Chicago during the last week of August 2007 for 5 nights. I booked the hotel approx. a month and half before our visit and at time of booking we were upgraded to a King Corner Room on the 5th floor which was very nice. Since this was our first visit to Chicago, I asked the staff many questions about the city and getting around. Initially we were going to rent a car but, after talking with the hotel, they assured us a car was not needed since we don't mind walking a little a bit and don't mind using public transportation as long as it safe, clean, and easy to use. Well, arriving at Midway Airport, the &quot;L&quot; train takes you from the airport directly to downtown with a stop being 2 blocks from the Amalfi! That trip is was only $2.00! If a cab, think at least $35 and if shuttle $15-18 per person. Talking the &quot;L&quot; was enjoyable and fun way to get a glimpse of Chicago on the 20 min or so ride. So glad the hotel told me this as a car would have been a waste of money in rental fees plus $40/night in parking. The trains/subways/buses all interact with each other (Chicago Transit Authority). Each time you get on its $2.00 to go where ever and if you can transfer within 2 hours for .25 cents. For our 6 night, 5 day stay, we spent less than $20 and we went many places outside of the downtown area such as Andersonville, Wrigleyville, Bucktown/Wicker Park, and Chinatown. With the location of this hotel, you are pretty central in downtown. The walk to all parts of downtown was nice since we were in the &quot;middle.&quot; For example if you stayed on the Magnificent Mile, you are on one end of downtown to get over to Millennium Park or Navy Pier; you have to walk to the opposite side. So, the location of the Amalfi was prime. The hotel itself is very modern and hip. The staff was very friendly on check in/out. Rooms were very clean and corner room was filled with windows. The TV was regular (not a flat screen plasma or LCD as many would think for this kind of hotel). A DVD player is provided and at the front desk, there was a stack of DVD's which I think you can checkout. A well stocked mini bar was provided although we did not use it. The rooms have free WiFi which was nice as some places we went to during our visit I found in our room using my laptop. The bathroom was nice with good room and Aveda products are supplied. The only somewhat downside to the bathroom is that if you are short, you may not be able to reach the toilet paper roll as they mounted it kind of far away from the toilet ... LOL. The bed was very nice and comfortable as well as large! A copy of USA Today is provided every morning as well as some free magazines (I think they supply those one a week) - We got copies of In Style and GQ Magazine. As mentioned, the hotel is only the first 5-6 floors so, you won't get the &quot;awesome&quot; views as in some other really high rise hotels but, we were perfectly fine with that. We were on the 5th floor and I did notice they had some conference rooms mixed in the floor which was a bit odd. Also, upon re-entering our room the first night we greeting with a bottle champagne which was very nice! Each night during turn down service, a few squares of Ghirardelli's chocolate was placed on the pillow.The breakfast buffet is a very nice touch. During our first night, there was quite a bit of food through out the next morning. But, in following mornings, I noticed the buffet would get wiped out. I think my floor got packed out with guests as the week went along which caused this. One morning, I even got there before 7am and most everything was gone. But, not to worry if reading this ... just get in the elevator and go one floor up or down. I found myself going to 6th floor where there were many options as many guest did not think about even going to other floors. I say take advantage of this buffet because it is free with high quality pastries, muffins, bagels, bread, fruit, coffee, and Tropicana juices in bottles.The nightly happy hour is also a great gesture by the hotel but, was &quot;ok.&quot; We actually forgot about it until near our final night. When we went a few minutes before starting there was already a small line. On going in, seating is very limited. The meats, cheeses, eggplant, and olives were all good. But, the drink choices are limited. They were serving two kinds of bottled beer (Miller and Peroni) and pre-made martini-like drinks along with wine and lower end house liquor. So, don't go and expect to have a call order which many guest were trying to do. Within 30 minutes, the room was packed and of course came the sound of complaints about seating, choices, etc. which I thought was rude. A great gesture but, if out on the town at night enjoying a site or something, don't feel the need to rush back to hotel for this. This happy hour is FREE - so it is what it is but, I still say it is great for the hotel to offer it.There was a construction project going on across the way from our side of the hotel. But, given the amount of walking, site seeing, and transit rides we were doing, we pretty much slept hard until the next morning so, the construction really did not bother us. During out check out day, we noticed the sounds from site much more but, that was because on previous days we were already out of room and hitting the city. Overall the price and services offered by the Amalfi are excellent. Most hotels I looked at were at least double the nightly rate. For under $200/night this hotel is a good value if you are like us; spends as low as possible but, expect good quality. In other words, the extra &quot;wow&quot; factor for a 5 star hotel does not justify the doubling (or almost tripling) of price and our Chicago experience would have been the same.", "hotel": "amalfi_hotel_chicago", "year": "2007", "date": "2007-09-09"}
