{"city": "chicago", "title": "High Dollar High Class", "text": "My fiance and I were visiting the Chicago area to visit some family and we opted to spend our last couple of nights right in the downtown core of Chicago to take full advantage of the sights.The location of this hotel is fantastic. We were able to walk easily (within about 5-15 mins) to any restaurants, bars/clubs or the Magnificent Mile. The decor in the main lobby is very chic and modern, as was the decor in the room. The internet in our room did not work, so we had to spend some time with the help desk to get it up and running. Our floor had a lounge in it where the hotel hosted a happy hour each night - with complimentary appetizers and drinks. And while I found the quality of the wine rather disappointing, the appetizers themselves were quite delicious (no chip and dip here! ). That lounge itself had no real wow factor, and was a bit of a disappointment considering how pristine and sharp the rest of the hotel was in appearance. Our room had a horrible view, but that didn't particularly trouble us. The bathroom was top notch , equipped with a wonderful shower head and high quality bath products (Aveda).The hotel itself seems to have been a remodeled building, where the hotel appears to only occupy a few of the floors. The lobby is adjacent to another lobby, which is for the commerical businesses that appear to also occupy the building. While I have read other reviews which stated the staff were extremely friendly and helpful, we did not find this to be the case. The were outright cold and seemed preoccupied when dealing with us.The price was a tad high, as were the parking rates per day, but in a major city, and given the location, that was something we had fully expected.If you want a hotel with more ammenities (spa, pool) then I would say that this isn't it. However, for the location and the new, chic and clean rooms, it is lovely little place to stay.", "hotel": "amalfi_hotel_chicago", "year": "2007", "date": "2007-12-08"}
