{"city": "chicago", "title": "Horrible really horrible!", "text": "This hotel is right in the heart of North Michigan Avenue. A great location, but a crummy hotel. When you enter the hotel you have to take an elevator to the third floor to check in. It can be confusing. Then you have to switch over to another bank of elevators to get to your room. Parking is $40.00 a day. The lobby of the hotel is beautiful. Too bad the rest of the hotel doesn't measure up. When we were waiting in line we watched and overheard another customer arguing with a check-in clerk. The problem was that she needed a room with two beds, not one. The clerk told the customer &quot;Sorry you booked on Priceline we don't have to honor ANY special requests. You get what we give you&quot; !!!! HUH? We were floored as we had booked on Priceline ourselves. We didn't ask for anything special, we quietly checked in. We usually ask for a nonsmoking king and 99% out of 100 times hotels accomodate us. We have never encountered such rudness.Not saying anything to the person checking us in was a huge mistake. We were checked into room 623. We have had rooms on cruise ships larger than this room and it was right across from the elevator bank so we could hear everything. The room was the size of a walk in closet with a only a double bed. The carpet was dirty. The linen on the bed was worn. If the linens on the bed were clean or not was questionable. So much for that &quot;comfort bed&quot; they advertise. If this hotel had them we didn't see it in our room. Our phone didn't work and our windows didn't have a darkening shade. You could see the hooks for them, but the window didn't have one. We called the front desk, no chance of changing rooms because we booked on Priceline, however the said they would send some one up to see about the window shade. They never showed up.The windows were filthy. The furniture was nicked and worn. The wallpaper was worn. The water trickled out of the showerhead. Ugh, what a nightmare! Thank goodness we were only spending one night there. NEVER AGAIN! We and others were treated horribly because we booked with priceline. When are hotel employees going to figure out online booking portals are here to stay and if they don't like it, then don't release the rooms to be booked through online travel websites. This hotel does not deserve the three stars listed on priceline and other travel websites.", "hotel": "allerton_hotel", "year": "2006", "date": "2006-06-18"}
