{"city": "chicago", "title": "Allerton. Digged it. Loved it. Repeat", "text": "All men aren't created equal, so our opinions will differ. Go to the Allerton, and expect an excellent visit. I have NO complaints.I won a Hotwire bid for $90/night (worth every penny and more) for Friday through Sunday. I arrived around 5pm, the doorman took my bag as I exited the cab, gave me a claim ticket and informed me it would be in my room 10 minutes after checking in; was it? YEP.Check in is on the 3rd floor, and you have to switch elevators to go up to the rooms. Check-in was hassle-free, the staff was very friendly and attentive, this even though the hotel was obviously packed and busy. The elevators are pretty small, by U.S. standards, but you can tell it's an old building, full of character and charm. The small elevators are forgotten when you realize you have 5, extremely fast, elevator cars.The hotel is obviously 'well done', you can tell from the moment you enter through the revolving doors into the bellman's area and up to the lobby. But when I got to my room, on the 6th floor, overlooking Michigan Ave., my suspicions were confirmed. PERFECTION! CHARM! Beautiful. The entire hotel has a very European feel, guest rooms included.The room was small, but delightfully decorated, with a full size bed, a beautiful armoir, and sitting chairs. The bathroom was cozy, had a full size shower fitted with a shower head set high enough for a professional basketball player. What this place lacks in space, it more than makes up for in charm and comfort.It is located right in the middle of the Magnificent Mile shopping area, about 4 blocks from the John Hancock building and Water Tower, there are restaurants on the streets around it. I just can't rave enough about this place. I will definitely stay there again.One thing, I had planned on taking the train from O'hare to the hotel, at some point I must've taken the wrong exit on the red line and hailed a cab, however, when I did walk to the Chicago station, the closest one to the Allerton, I found it to be a walk way longer than I had anticipated, and I only had one carry-on bag (though packed to the max, as I'll be here for 5 days) and a knapsack with my camera and personal belongings. I'm glad I opted for the cab ride. May I suggest getting off the red line at the Clark station, which is completely handicap-accessible, then hailing a cab to the hotel? That ride will set you back a whopping $4.25! If you've got bags to haul, you'll thank me!", "hotel": "allerton_hotel", "year": "2005", "date": "2005-11-14"}
