{"city": "chicago", "title": "Could be fine for some travellers but we hated it.", "text": "I didn't get the best deal I could have on this stay, which just makes me all the more irritated about the Allerton. I attempted to contact in-house reservations prior to check-in to discuss adjusting my rate (I felt a bit entitled as I was booking for an entire week at the end of a miserable Chicago winter), but I never received a call back. Due to the circumstances surrounding my trip, I didn't have a lot of time to badger management about this issue, so I let it be and hoped that the hotel would impress regardless. I will say this, the rooms are very pretty. There were some issues with peeling wallpaper, but it was not that noticeable. Beds have feather toppers and feather pillows (undisclosed on the web site), so I now have a sinus infection from a week's worth of constant exposure. On a side note, I didn't figure out that the pillows and topper were feather until nearly the end of my stay, at which point removal would only have served to make the bed more uncomfortable. These are flat, pokey featherbeds, not the high-end kind, so wear thick fleece pajamas.The ice machine noises the AC was making when I arrived were easily remedied by turning climate control off. The windows are a nightmare, don't open them. This hotel is right across from Northwestern Hospital, so be prepared for ambulance noises at all hours. I guess if you are a big shopper, the location could be a selling point. For us, beyond being nice to look at, this place is absolutely not worth your time at the price. My first room (standard king) was very spacious, plenty of room for yoga, and it even had a chair and a bench. Unfortunately, it was also right next to the elevator. I grew up in a town with trains and planes, so I got used to the whooshing fairly quickly. However, the doors here do not go all the way to the floor, and they are thin, thin, THIN! I rolled up a towel and shoved it under the door as a sound barrier, but it made no difference at all. After the second night of no sleep due to loud conversations outside my door at all hours of the evening, I insisted on being moved. The gentleman at the front desk did not argue about switching my room, but he did point out that there was no way he could prevent people from having conversations outside my door in the future, regardless of location. Between exhaustion and frustration, I had to talk myself back from punching him in the jaw. Why would people randomly stand around MY ROOM, assuming that my room wasn't located at the gateway for entering or leaving the floor? Really. Room 2, also a standard king, was much smaller, and was one of those rooms with a door joining it to the room next door. Remember how thin those doors were? Our neighbors loved Ray LaMontagne, acoustic guitar singalongs, and noisy sex. Yay! I could not bear the thought of moving again, and they at least kept it quiet most of the night. This is the room I was in when my husband got into town, and it's the one we stayed in the remainder of our trip. It was a bed to sleep in, and nothing more. He's never going to let me live down not going with his first choice, the Blake.", "hotel": "allerton_hotel", "year": "2009", "date": "2009-03-18"}
