{"city": "chicago", "title": "Less than Tip Top", "text": "Reviews here are accurate. Great location, iffy everything else. Arrived at check-in to see a small but angry line of people. Friday evening, a line of customers....and one person working the 4-place front desk. I spent the wait trying to figure out what everyone's problem was. Turns out it was my problem, too. Depsite a King bed reservation, they had only double beds availabe. &quot;Anything you can do&quot;? No. Take it or leave it, essentially. The word &quot;KING&quot; on the reservation means nothing. This was a reservation made through the Crowne Plaza website, not a 3rd party. Not a big deal, I was expecting as much based on what I read here, but I'm posting it so the next people know. Room was nice, but small. Once we heard &quot;double&quot; we knew it was going to be tight. By small, I mean that we were re-arranging furniture for better use of space. My face was 6 feet from the door and it felt like I was sleeping in the hallway. One in our group actually got a king room (one out of 3 parties) and that's a nice room between the elevator banks. Judging by the fire escape diagram, most of the rooms look like they're the size ours was. It's an very beautiful, but old building, so if you're used to old buildings...things like water damage around the windows, tiny bugs in the room (no screens on the windows...don't open them unless you want visitors), great water pressure for 90% of the time, interspersed with a) no water pressure or b) a 20-degree change in water temperature. When leaving, the doorman waved us away from the limo we thought we were taking to the airport. &quot;It's For someone else&quot; we're told. Well after 5 mins the driver finally approaches us and we find out that is inded our limo, thanks buddy. There sure seemed to be a lot of hotels in the area, and although this was inexpensive I'm sure you could do better. Pictures attached -- I got a great shot of the hotel from a nearby apartment. I also took pics of the water damage and some streaks were I killed a few bugs on the ceiling. Happy hunting!", "hotel": "allerton_hotel", "year": "2005", "date": "2005-08-10"}
