{"city": "chicago", "title": "Great Location ok room not ok staff", "text": "You cannot beat this location. Walkable to everything in Chicago. Great beds--very comfy, dvd player in room with a few cds and dvds to choose from. Decent breakfast buffet of rolls, pastries, etc, but coffee was bad. Cocktail lounge had decent drinks for free during happy hour. Staff such as doorman/porter were very nice and friendly. Problems were:*Old product in mini-bar, even back to June 2008*Loud mini-bar*could hear everything through vents to other rooms--clearly word for word*cold air flowing--couldn't figure where it was coming from--did not have on*glasses by sink were dirty upon check-in.*called front desk about dirty glasses and was told to go to the buffet/credenza in hall to get clean cups so they wouldn't have to come upstairs, but buffet was locked. Staff did not know this was their own policy.*in- room robes too rough and scratchy to wear* had room with 2 queen sized beds but only enough towel/hook space for one person unless you wanted your towel resting on the toilet. Also, only enough product for one person.All of this could have been taken care of if FD supervisor chose to. I listed to her all of these issues and she chalked them up to &quot;good ideas for management&quot; to know about but seems not to do anything about. When I communicated the issues to her at night I asked if she would be able to do anything for us to compensate for this and she said no. I said comping our taxi to the airport would be good and she said that since it is not the hotel's company she couldn't. I said to her that all taxis will take cash and that the hotel could pay for it. She said she would talk to the manager about it but when it came time for us to leave, nothing was mentioned upon checkout and the girl checking us out new nothing of our issues.So, if management would change to provide service as well as take care of properly maintaining this hotel it could be the property that they THINK it is: unbeatable! For now, it is just a swanky looking hotel in a great location, but the excellence is only on the surface. They need to get over themselves and just be nice to their guests no matter how great the location is.", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-11-09"}
