{"city": "chicago", "title": "Small rooms Rude Front Desk Rip off.", "text": "The hotel was in a good location, and there was one very nice and helpful employee who helped us with our bags. However, the rooms in this hotel are the size of a matchbox. We arrived early and my husband was not feeling well, but the front desk curtly told us we could not check in until after 3pm - leaving us to walk around for four hours in the cold. When we finally did check in - (when you stay at this lovely hotel you need to take two elevators up to your room - when it is busy, this takes FOREVER) We got to our room, which was tiny. It had a view that would have been great if the windows were not so small. I was in Chicago on business and needed to use my computer to check my email. The internet connection in our room did not work, so my husband called and asked for assistance and was told that someone would be up to help us. A minute later they called back and said that the connection in our room was not working and that we could come and use the free wireless connection in the Lobby. I lugged my computer down the elevator (another long wait) from the 21st floor to the 3rd floor lobby. The free wireless in the lobby did not work. I asked the person at the front desk for assistance (they were not busy - my husband and I were the only people in the lobby at the time and there were at least two employees in the lobby area) The person behind the desk told us how to do it and we did what he said, four times. We then asked again and the desk clerk told us to use the white phone to call someone to help us. The person who came to help us told us to do exactly the same thing as the person behind the desk did. They each gave us the same password and the same information to input - It never worked and no further help was offered. SO we went to their business center to at least check in and print our boarding passes. The business center charges $20 / hour ($5 / 15 minutes) for internet use and .35 / page for the printer. We used the computer to check into our flight and print our boarding passes. The clerk at the business center charged us $8.50 for 5 minutes on the computer and 4 pages we printed. (in other words, he over-charged us...should have been $6.40 at the most) We have stayed at all kinds of hotels from hostels to 5-star hotels all over the world and this is one of the worst experiences we have ever had.", "hotel": "allerton_hotel", "year": "2006", "date": "2006-10-20"}
