{"city": "chicago", "title": "Wonderful experience", "text": "My husband and I stayed at Amalfi for one night in February. We lucked into finding this hotel through a Travelzoo top 20 deals email and only paid $94/night for a king. Reading the previous reviews on this site it seems we got a great deal. Our stay was amazing. The renovation is now complete and the lobby and rooms are gorgeous. The mattress and sheets were very comfortable. A few others remarked on the size of their rooms. I felt our room, 633, was more than adequate. I did not feel the room was at all small. But perhaps that is because our room was a king versus two doubles, perhaps? The room included a nice lounge chair and lamp by the window which was nice to sit back in and peruse the Chicago publications the hotel offered in the room to read. The double headed shower was warm and powerful. We probably showered about 10am on Monday morning, and hot water was not an issue. The Aveda bath products were a nice treat. The bathroom, and the room in general, looked and smelled very clean. Now that I think about it even the hallways of the hotel smelled wonderful. Just a nice clean smell, nothing heavy or like perfume. The complimentary reception for guests on the 6th floor was a nice touch. A tip jar was present and we gladly tipped with each trip to the bar to get another delicious Amalfatini, their signature drink (although they offer many other drink choices...I saw quite a few cosmopolitans). The food offering at the reception was adequate, but nothing spectacular. A selection of meat, cheeses, crackers, and a vegetable/dip tray, if I remember correctly. But we weren't looking to fill up as we had reservations at The Prime House for 7:30, which was about a 8-10 minute walk away. The 55 dry-aged steak there was fabulous! The complimentary continental breakfast was also appreciated. I wasn't wowed by the offerings which were kinda standard cold fare selections (pastries, bagels, fruit, yogurt), but hard to complain about a free breakfast. What I was wowed by were the staff members. Everyone we interacted with were very friendly and helpful. It's amazing what a difference that can make on your overall impression of a hotel, or for any business for that matter, I suppose. Simply put you just felt very welcomed. It was a nice change of pace from other Chicago hotel experiences we've had. Our family travels to Chicago 1 to 2 times a year for just a small get-away and to take in a few of our favorite eating destinations. We usually try to find accomodations for about $100/night. We enjoyed our Amalfi experience so much we will probably be back irregardless of cost, as I don't imagine our $94/night offer will be often repeated unfortunately. We paid $44 for hotel valet parking (again the staff were wonderful) with unlimited in and out priviledges, but the location was so convenient that we just chose to walk everywhere.", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-02-20"}
