{"city": "chicago", "title": "Amazing Boutique Hotel!", "text": "My parents and I stayed at the Amalfi in July 2008 on our summer trip to Chicago. It took a few minutes of driving in circles to find it, but eventually we did. The moment our car pulled up to the curb, two helpful men were there to take our luggage into the hotel and valet our car (valet survice is offered). It`s true that the lobby is small compared to most hotels, but what it lacks in space, it makes up in quality. The whole hotel smells like fresh flower and zest, and the bright, modern colours really add a nice touch. The conceirge booked us into our room right away, and we had staff bring our luggage up to the room. Our room was on the top floor of the hotel (there are other businesses on the higher floors), and the best place to be. The room was quite small, but it was very clean, comfortable and had a pretty good view from the window (not like it matters all that much). There were many new magazines like InStyle, ect on the desk, which was great. The bathroom stocks the most amazing Aveda products, which I admit to taking a few home with me. The two-headed shower is lovely and the bathroom is overall very clean and modern. Our room was right across from the room where they offer free happy hour and light food at night. You would think it would be noisy, but from in our room, you could hear nothing. The happy hour was great, you could go in (even with your children, but bringing young ones could be a problem) and get whatever drink you like (tip if you want), and there were an abundance of breads, cheeses, meats,ect. Very nice to go to before dinner. In the morning, they offer breakfast on each floor, right outside the elevator. I went in my PJ`s every day, and they had a good assortment of fruits, juices, coffees, teas, croissants, buns, pasteries, bagels, ect. The only thing my family complained about was the lack of hot food or a toaster for bagels, but I think it wasn`t such a big deal. If your floor was out of some pasterie or whatnot, you could go to the floors below and take one of theirs. The Amalfi offers a &quot;business&quot; center, which is basically a very small room with two computers and a printer. That is fine since the internet is free, and almost always the computers are empty, so you don`t have to wait. The fitness room is large and well-stocked, though we didn`t use it. For restaurants in the area, try Harry Caray`s across the street (great bar food), or for a really hip, cool environment try the restaurant which is right behind the hotel, called Rockit Bar and Grill. VERY good food, young atmosphere. I would refer anyone to this amazing hotel!", "hotel": "amalfi_hotel_chicago", "year": "2009", "date": "2009-01-17"}
