{"city": "chicago", "title": "Pleasant Great Location Good Value", "text": "Booking the night before our 1-night stay in Chicago for holiday shopping, this hotel had by far the best rates for a decent place downtown and an excellent location right on Michigan (well, the front door is just around the corner on Huron). The mixed reviews left me wary, but thankfully my sister had stayed there a couple times and recommended it. Glad she did.We booked the &quot;petite classic&quot; room, the smallest room available. The reviews and the hotel's own info left it unclear what size bed to expect - anywhere from barely bigger than a twin to a queen. Also, some reviews said the rooms were Euro-tiny. Maybe we lucked out - both of our rooms were ample in size and had double beds (check-in clerk said they were queen, but I don't think so).The rooms had been refurbished recently with warm yellow paint and updated, modern bathrooms. Though smaller than the average hotel room, the layout is nice and the room felt cozy in addition to sufficiently roomy. It has an armoire, desk, and closet. Our 16th-floor rooms faced south with a nice view. There are no blackout shades, however. The drapes don't pull shut all the way; only sheers cover the windows entirely. I actually left my sheers open, too, to enjoy the view as I fell asleep.My 7-year-old niece bunked in the closet! It was big enough to make a pillow-bed for her, and we draped a cover over the doors to make it like a tent. She loved it. I loved having the bed to myself.Though we were right by the elevators, we didn't have any issues with noise in the least. It was totally quiet. The staff was very nice. Those on site were nicer than my reservation agent, whom I spoke to before deciding to book on hotels.com ($10 cheaper per night). Valet parking is steep - $45. I think self-park is at least a block away, and we arrived on a cold, snowy night so we forked over for valet.Didn't try the restaurant, though my sister remembers loving the breakfast buffet. For a restaurant, I recommend Rosebud on Rush, 2 short blocks away. Good affordable Italian basics in reasonable portions in a cozy brownstone builing.I would definitely stay at the Allerton again if it is the best deal - and I understand that it usually is.", "hotel": "allerton_hotel", "year": "2007", "date": "2007-12-05"}
