{"city": "chicago", "title": "Modern amenities but understaffed at times", "text": "My husband and I stayed at the Amalfi for the weekend because most other hotels we were interested in had outrageous rates. I found the Amalfi on TripAdvisor. We paid $279/night.The Amalfi is located in a decent location near the river. Numerous good restaurants and bars are within walking distance. You can also walk to the Magnificent Mile. We tried out Bin 36 for dinner and drinks, Keefers (right next door) for drinks, Tempo (several blocks up) for breakfast, Grand Lux Cafe (on Mag Mile) for brunch and Sushi Samba for dinner. I prefer to stay on the northern end of the Mag Mile, close to the lake, but this was a good alternative.The Amalfi is decorated in a modern style, and they always have loud music playing in the lobby. The decor is bright and refreshing. The rooms are clean but a little cramped for two people. I felt like we were always stepping on eachother when passing between the bed and TV. The bathroom is a good size. There are Aveda bath products. The rooms seem to be newly furnished with a contemporary style. The hotel is only 6 floors, so there aren't any views.Some nice touches are the complementary cocktail and hors d'ouevres reception every night from 5:30-7 and complementary continental breakfast including fruit, juice, coffee and pastries, which is served on every floor every morning. It is very nice to come out of your room in your pajamas to gather some goodies and take back to your room.I had a few complaints. First, the back of the hotel can be loud at night. On Friday night, we stayed in room 440, which faced an alley. This alley has about 10 dumpsters which were emptied periodically all night long. The noise was so bad that we asked to switch our room for the next night. We were told to go to room 419, but when I knocked on the door, someone was sleeping in it. (This was after I double-checked with the front desk staff because there was a Do Not Disturb sign on the door.) I asked again for a room and ended up getting a much quieter room facing the front of the hotel.My second complaint is that the hotel seems to be understaffed. There are only 1 or 2 front desk staff working at a time, and you inevitably have to wait a while for one to be available. Also, the front desk staff also serves as the concierge, so one of these people may be occupied for 15 minutes or more helping someone with directions or reservations. The front desk staff seemed a bit unprofessional at times and didn't have the willing to please attitude.Valet parking cost $37 per night!!! We waited for about 25 minutes to get our car back on a Sunday afternoon.So all in all, it was a good experience, but I don't know that we will stay there again.", "hotel": "amalfi_hotel_chicago", "year": "2006", "date": "2006-10-10"}
