{"city": "new-york-city", "title": "Depends on the room you get", "text": "My boss and I just completed a three day stay at 60 Thompson. We got corporate rates of $250. I received room 59 upon check-in and it is not at all a special room -- standard NY crunch. There was no desk, although there was a long rectangular table nested under a higher, square table that served as a nightstand, so I pulled out the long rectangular table and used it as a desk, when I was either sitting on the couch or the large lounge chair. If you have need of back support to do any work, this won't work well for you. Unfortunately, pulling that table out took up most of the remaining available footprint. Two people can't walk past each other at the same spot in this room. When I arrived in room 59, there was no shampoo (although there were other amenities), the phone didn't work and no flower in the vase (supposed to be an orchid in a little square glass vase with pebbles). I didn't realize this until turndown service came and filled my ice bucket, at which point I tipped $2 -- then the service rep graciously noted that my flower was missing and brought me one. In my opinion, even the corporate rate of $250 was just a bit much for this room -- a fairer price would be under $200. My boss' experience was different -- when he went to check in, they informed him there was no room for him even though he had a guaranteed reservation. However, they did offer to pay to put him up at the Soho Grand that night and the next night, they appear to have upgraded him to a much larger suite, Room 100, which they comp'd (this must be what is normally the $400/night room. It was nice of them to comp him, but then he was really quite upset that the reservation hadn't been honored). This is a truly large room, with a separate sleeping area and an enormous entertaining space with a ponyskin area rug. There is a proper desk, two TVs (one of them flat screen LCD) and two bathrooms. Cookies were in the room as part of the suite service. Amenities in both rooms were by Fresh. Suite Room 100 had a wood floor. Standard Room 59 had carpeting. Both rooms had king beds. The service, as has been noted elsewhere, was exceptional (despite my boss not getting a room on his guaranteed reservation and with the exception of turndown service, who I suspect might not have offered me that flower until the tip was forthcoming -- but at least the tip urged an offer of a flower). Room service was exceedingly polite, intelligent and thoughtful. As has been noted elsewhere, the neighborhood is choice. The weather in NY was sub-zero, so we walked two and a half blocks turning right out of the hotel and found this little basement Cubana restaurant (called, I think, the Cubana Cafe or something like that) at which was the best grilled corn with hot spice and cheese and ethereally fresh chicken soup. Available for a song and delectable (and hot!)Overall, I'm torn as to whether to stay again (I don't think I would want a room like 59 at $250 again, but nor do I think it would be fair to get a room like 100 at the price of $250 -- if only they had something in between!).", "hotel": "60_thompson", "year": "2005", "date": "2005-01-22"}
