{"city": "new-york-city", "title": "Good enough but will never go back...", "text": "Just returned from a 5 night stay at the 414 and I was very disappointed after having read all of the great reviews here. First impression based on the outside of the building was that this was going to be a great place but I was wrong. The gentleman who checked us in was very nice and I will say all the staff was friendly and helpful. We were given room 204 which was in the front building right above the reception area and facing the street. The halls in the building are depressing. Dark gray or black carpet and the walls were painted a very, very dark purple if I had to guess. I was so dark it was hard to tell. The room at first glance though seemed nice. It was a pale yellow with 2 twin beds since this was a mother daughter trip! Upon looking closer though the room was in desperate need of updating. Scuff marks on the walls, chippy paint on the window sills, carpets could use a deep clean. In the bathroom on the ceiling there was a huge place where there had been a leak that was patched but it was brown and nasty looking and could stand to be painted over. Also there was a place on walls near the ceiling where paint was bubbling off the wall. It almost looked like masking tape had been put on there and painted over and now it was peeling off. Towels I could tell were clean but they sometimes had stains on them. Aside from those issues the bathroom was clean. bathtub, sink, and toilet were cleaned good daily. We had a window air conditioner which ran nonstop but never fully cooled the room down. It blew right into a piece of furniture that the old tv's used to be in but haven't been removed from the rooms yet. We tried to move it a bit to get some air going but due to the size of the room there was nowhere to move it to so we had to make due. We had nice fluffy comforters but only slept with a sheet since the room was so hot. And you couldn't open the windows and try sleeping since the street noise was horrible. I expected some noise but this was rediculous. I finally bought some ear plugs so I could sleep. Also with being right above reception area we heard the front door SLAM shut any time someone came in. Not only did it make the loud noise it also vibrated the beds we were in. also we could feel the people next door stomping around and hear other people from their rooms through the vents in the bathroom. If you kept the bathroom door shut that seemed to help. The beds were nice, clean, and very comfortable. Just all the noise and bumps in the night made it sometimes very hard to sleep. Breakfast served downstairs was always fresh but I warn people to stay away from the coffee. It was SO strong. I had to try and dilute it with water but I finally ended up going to starbucks for my coffee every morning. Several times they didn't even have any coffee. Once it ran out they took their time making more. I will say that the 414 is in a great location near restaurant row and times square and I never felt unsafe in the nighborhood. Also they had nice clean beds. Those are the only good comments I can write. From what I've heard the front building will undergo renovations soon and if I had stayed in the back building which has been redone things might have been different. I picked this place because of the reviews and because I wanted to stay somewhere small and cozy, but in the future when I go back to NYC I am going back to the big, well known, crowded hotels not the 414.", "hotel": "414_hotel", "year": "2006", "date": "2006-09-22"}
