{"city": "new-york-city", "title": "Nice additon to midtown", "text": "It was a busy week in NY and I had trouble finding a room at a good hotel (I'm picky) so I decided to give 6 Columbus a try. The staff is well trained, the doorman asks your name when he takes your bag and then radios inside so that you are greeted by name at the desk. As I came and went from the hotel, I was always addressed by name. I arrived around 1pm and they were able to provide a room then. I had a queen deluxe room. It did face the narrow alley but I would much prefer that to the noise of 58th street. There is no view on 58th, it is a narrow street and looks onto the glass building of the TimeWarner center. The room size is typical of a NY boutique hotel - small but comfortable and well appointed. I'd rather have a smaller nicer room than a large yucky room. (If you want large and yucky, I can give you that list.) Everything is new and clean which is always a plus. There is a small wardrobe instead of a closet so don't overpack but it is adequate. The bathroom is small also (I had one with a tub) but manageable once you figure where to put things. It might be a little cramped for 2 people, depending on how well you like each other! The doors are heavy and do slam loudly so in the morning if you are not an early riser you'll probably hear them. Each room has it's own central ac/heat which is nice and not the norm in New York. Unless it is a new building or completely renovated, you don't have much temperature control in many NY hotels. I like having my room cold at night and toasty in the morning so I appreciate the unit. But I do have to mention that the fan is very loud but it makes for good white noise for sleeping and drowning out slamming doors. The pictures on the hotel's website are accurate. There is a japanese/sushi restaurant in the hotel which was good but when it's not open, you have to go out which isn't really a big deal. But if you like to have room service in the morning, this isn't the hotel for you. There is coffee/tea and pastries in the lobby until 10am but you have to fetch it yourself. I have stayed at/checked out many hotels in the area and this one is probably one of the nicest. The Peninsula and FS are my favorites but taking a step down from those, if this is the area you want to be in, I'd recommend it. Since it's a new hotel without much history, you can email me if you have a specific question.", "hotel": "6_columbus", "year": "2007", "date": "2007-11-12"}
