{"city": "new-york-city", "title": "Sleepless in Soho", "text": "I just came back from a pretty terrible stay at this hotel, fortunately only for one night. One sleepless night that included crappy service, that is. I was in Soho with some friends celebrating a birthday and we opted to stay at 60T because of the proximity to our activities in/around the neighborhood. I got a decent rate due to the season: $455 (tax incl) for a queen double. My room was on the 3rd floor -- which I should have realized is right above the bar. Ordinarily this may not even be a big deal, save for the fact that at this hotel the bar was totally packed and they pump music until 3am. Speaking of the bar, what a nightmare. We went down there for a drink before dinner and when the hostess was no where to be found, we went in and encountered several empty tables with &quot;reserved&quot; signs on them. Eventually she wandered out and rudely told us that we could stay there until 9pm, but then she'd need to kick us out. That was at 7pm, and she seemed exasperated when we said we were only having 1 drink. We stopped by to see if we could get an after dinner reservation before we left, and she stood there ignoring us while hanging up coats for a few minutes before I &quot;interrupted&quot; her. Though we should have gone elsewhere, we actually closed down the bar at the hotel, which was okay given that had we chosen to go to bed, we wouldn't have slept with the music going so loudly. What really po'd me, however, was that at 6am people started getting up and flushing toilets which sounded like they were right next to you. The noise from these was amazingly loud and of course lasted through the morning. Our friends on another floor said they were awoken by it as well, and that it actually sounded amplified! I think their walls are made out of tissue paper and spit! Otherwise, the hotel seemed okay. It's not like you get much in NYC for your money. The neighborhood is great. The rooms are small, but everything is brand new. There's a crappy flat panel tv on the dresser, and a cd player/stereo in there too. (BTW, does anyone use cd's anymore?) The toiletries in the bathroom are pretty good. The beds were pretty comfy, with decent linens, which obviously didn't make up for the no-sleep dilemma. I should probably also mention that I was surprised at how clumsy and ill-trained the bellmen are. Though they always seemed to have 2 guys on duty, rarely were they around to open the door or help with bags. They sure love tips though! ;^)During check-out I mentioned that the hotel was really loud and the desk clerk, who also checked us in, kind of snickered and said, &quot;Oh, well, you were right above the bar.... &quot; Nice!I just glared out her and replied, &quot;Well, you checked me into that room so you must have known that. Regardless, we closed down the bar, that wasn't my issue. Your walls are so thin that every time someone flushed the toilet it sounded as if I was in their bathroom with them.&quot;This was met with no response. None whatsoever. I mentioned that I was from DC and that they have another hotel opening, to which she cheerily replied that 'yes' they did. Most hotels would offer something -- at least an apology when you told them your stay sucked.Or maybe I'm just used to good service?....", "hotel": "60_thompson", "year": "2008", "date": "2008-01-07"}
