{"city": "new-york-city", "title": "A perfect Anniversary Weekend at 70 Park Ave.", "text": "My husband &amp; I decided on a trip to NYC w/o kids for our anniversary. After scouring many different hotel sites I had narrowed it down to 2 and 70 Park had a deal I couldn't refuse.Location: Central to midtown and an easy cab or subway ride to the east village/nolita &amp; the Lower east side. We found it to be an extremely safe and mellow area on the weekend. If you are coming into Grand Central it is 3 short blocks to stroll no cab necessary.Lobby:Small but nicely furnished &amp; very boutique-y. Bellman was very friendly and there were computers by the concierge that could be used. Iced lemon water, apples and the New York Times were available to guests.Wine Reception: What a pleasant event. Every evening a wine reception is held - and as it was summer we had delicious white sangria &amp; another cabernet sauvignon to choose from. A nice way to kick off the evening before heading out to dinner. (the bar also had a seriously good happy hour with $5.00 cocktails and discounted nibbles post-wine reception)Room: We had reserved a King Premier room and were graciously upgraded. We had a great view , the bathroom was GORGEOUS with a jacuzzi tub and a separate tiled shower stall. We had absolutely no issues with street noise and we were facing Park Ave. The bed was as good if not better than the Westin Heavenly Bed or the beds at the W. Tons of pillows which I love. Bath amenities were plentiful and there were many nice touches like evening turn-down, pillow chocolates and very plush robes. Rooms were not small but on par with typical NYC hotels. Huge HD TV too.Staff: Everyone we encountered was very helpful &amp; friendly and many wished us a happy anniversary. Summary: We loved it and will return - the location is perfect for us and we enjoyed the more personal yet upscale feel of this Klimpton property. Note: Halls and public areas are very well lit and if I was a solo female business traveler I would feel safe here.", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-07-13"}
