{"city": "new-york-city", "title": "Good location", "text": "I stayed in this small hotel for a night in the last week of July. Since it was a Sunday I got to pay USD 99 for the night (from hotels.com). Customer service is okay. I arrived at the hotel in the afternoon and since the check-in time is 3 PM I was asked to keep my bags with the staff. When I came back at 11 PM I saw that my room was ready (with the A/C on at full blast, imp in July) and my bags were in my room. The lady at the frontdesk in the afternoon was a little on the &quot;unwelcoming&quot; side, i.e., she didn't receive me with the kind of attitude you usually see in hotel receptionists (though not rude). However, when I checked in at night a different person was there and he was good. He even told me that I could have free continental breakfast tomorrow morning from 7-10 AM. Regarding the hotel itself, it is a townhouse sort of building converted to a hotel. You could see apartments all around the streets. The hotel is located in the hell's kitchen area of Midtown West. This is an older part of the town. The hotel is very close to Times Square and other prime locations (Broadway, Empire State, Macy's). For the location I would give this hotel 5 stars. You can walk from the hotel to most of the major attractions in couple of minutes. The hotel room was nice; it had all amenities except a fridge and coffee maker. I guess you don't need a coffee maker since you get free cofee in the morning with your breakfast. The bathroom was huge!! I liked that a lot. The only thing I didn't like was the bed. Also, one of the windows near the fire escape didn't lock.I would highly recommend this hotel for its location, however, if you have some time you can get a 4*/3* hotel in Midtown West and Midtown East for USD 120-140 from priceline. If you get a good deal on this hotel and are expected to spend most of your time out of your room then go for it. A caution the street leading to the hotel appears deserted at late night. If you want to stay in the &quot;richer&quot; part of midtown stay on the east side.", "hotel": "414_hotel", "year": "2005", "date": "2005-08-16"}
