{"city": "new-york-city", "title": "Five star service!", "text": "I just came back from a 4 night stay at the 70 Park avenue hotel. I always have the best time when I am in New York and my hotel stays are very important to me. I love staying in hotels! This was my first time at this particular one. I will list the pros and the cons about this establishment.PROS:*The service: This hotel gets a 5 star for the service it offers its clients. The employees go out of their way to make your stay enjoyable. Everyone is professional and courteous. The concierge even called me to ask me if she could do something for me. They have a wine reception from 5 to 6 in the lobby where they offer you a complimentary glass of wine. This is a nice way to meet other guests. *The location: You are next door to Grand Central terminal, subways, buses. It is very central.*Peacefulness: It is a hotel that caters to an older clientele so you don't hear yelling in the hallways at 3 AM from partygoers. I enjoyed that because I go to bed early so I can enjoy a full day in the city. I did not hear a single thing from the other rooms even though they were occupied. I appreciated that very much.*Kimpton loyalty program: You get some perks if you enroll in their loyalty program. You get free wifi in your room.....15$ from the minibar....free nights after eligible stays...CONS:*The rooms: This hotel has definitely seen better days. It was designed many years ago and it shows. It is very traditional. I was assigned a room that is a queen room but I know what a queen bed is and this was not one! It was a double bed. I thought the room would have been bigger. SInce I was alone, it was more than fine but a couple would find it a bit too snuggly. You have an armoire for your clothes but no drawers for your underwear and such. You have to put them at the bottom of the armoire. Paint was peeling off the bathroom ceiling, there is no fan in it and the door could use a coat of paint. These are all minor things that can irritate the hell out of you if you paid 300$. Since I got an excellent rate, 159$ per night even though the hotel was full, I did not complain. That said, I would go back because of the service and the location. Like I said, this hotel gives a 5 star service and I commend them for that. I stayed at other hotels more luxurious than this one but where I would not go back because I thought the service was next to non-existent. Paint you can put on but great service is hard to find.", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-08-25"}
