{"city": "new-york-city", "title": "standard hotel / fantastic service", "text": "We stayed here for three nights at the start of our honeymoon.We arrived at 1am after a nightmare trip from the uk after our travel agent thomas cook did their best to ruin our honeymoon to find a fairly standard hotel in a good location for tourists with friendly staff. On the second morning we asked at reception if we had any messages as our transfer fron the airport had not arrived and we forced to pay for cab.The receptionist said that there had been no messages but that she would contact the shuttle company to find out what had happened The pre-paid vouchers we had been given by thomas cook did not have the actual shuttle company name on them so the receptionist Googled what was on the vouchers and rang the first three companies on the search when they could not help she then rang thomas cook in the uk to find out what was going on. After putting her on hold for several minutes they then told her it was our fault for not phoning the shuttle company when we arrived at JFK.Showing customer care that was so lacking at thomas cook she told them not to be so stupid as she was not able to find the firm to contact the shuttle company even with access to Google.She then demanded to know the name of the shuttle company so she could find out what went wrong. On completion of that call she rang the shuttle company and was told that they knew nothing about our trip.She told them that that was not good enough and that we needed a return transfer to JFK the next morning and that she was going to stay on the line until they sorted that out with thomas cook which she did and 10mins later we had the transfer that thomas cook should have sorted out. In all this lady spent almost hour and made five phone calls sorting out a problem that was nothing to do with her or her hotel because she understands the meaning of the words customer service in a way that thomas cook would not know where to start and thats why I will be going back to this hotel but will never spend another penny with thomas cook. HINT (looking after customers is cheaper than advertising for new ones) The other staff were also helpful they got us into a fantastic steak house that was packed with an hours notice and when we got back to our room we found a bottle of cava on ice chocs and a congratulations card from the staff . Just to complete the service next morning when the shuttle was ten min late picking us up the staff noticed this and without being asked rang to ask why their guests were being kept waiting. Service is what makes or breaks a trip and thats why I'll be gioing back to this hotel", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-09-04"}
