{"city": "new-york-city", "title": "Great location beautiful restaurant awful service and organization", "text": "We booked our weekend stay at the 60 Thompson and requested a non-smoking room. Upon arriving at the hotel, I noticed that my room had an ashtray and I called down to the front desk to request for a non-smoking room. They said that nothing on the reservation stated that we had in fact requested non-smoking, and would only be able to switch us to a non-smoking room the following day. (Our confirm clearly said &quot;non-smoking&quot;). The hotel claims that when the hotel room is booked via outside reservation agents, the request for non-smoking is not given to them. After insisting multiple times that it was important to us, and going down to the lobby with our confirmation as proof, we finally got an upgrade for the night to a beautiful, large suite. Some complaints about the suite: the wireless Internet didn't work, the TV in the bedroom refused to change channels, and the toilets were so noisy they would have scared small children. Upon checking out, we found on our bill a $10 charge for the Ethernet cable they had provided us when the Wi Fi failed. (We complained and didn't end up having to pay for it). Also upon checkout, we were shocked to find a $220 charge for the minibar, even though we hadn't used anything. Word of warning: I had noticed in both rooms we stayed in (the suite and the regular room the next day) that the minibar did not have full inventory to begin with -- this was probably the source of the discrepancy. Make sure the list provided in the minibar in fact matches the inventory, because some of the items --- &quot;Intimacy Kit&quot; ($110++), and Tocca Candle ($50) can run steep.Disappointingly for such an expensive and &quot;upscale&quot; hotel, the gym was located in the musty, dark basement level and was a whopping 15x15' room. It included 2 treadmills, one bicycle and one step machine, which, when we were working out, were all occupied. Ventilation is minimal and there are no windows in the room. When I returned home, I realized that I had left my phone charger in the hotel room. When I called to file a search request, the front desk told me to call back the next day when housekeeping arrived. No reassurance, remorse, or any sign of standard procedure here regarding lost items --- while this is acceptable behavior for a $100/night hotel, in my mind it is not for a $400+/night hotel. Overall the staff seemed to be hired for their looks, not their commitment to quality service. On the bright side, the restaurant Kittichai is stunning and the food delicious. The room service menu is abundant with Kittichai selections, which is a delight. The suite we had was gorgeous despite the technical difficulties we had. The wonderful SoHo location may make this hotel a worthwhile stay, although if you're looking for seamless 5-star hotel service that usually comes with this kind of price tag, don't count on 60 Thompson to deliver.", "hotel": "60_thompson", "year": "2007", "date": "2007-01-28"}
