{"city": "new-york-city", "title": "This must be one of the best hotels in NY", "text": "After reviewing what seemed like hundreds of hotels for our NY trip, we decided upon 60 Thompson - and we're so glad we did. It must be one of the best in NY and I would definitely recommend it. All the staff couldn't do enough for us - the doormen were always friendly and concierge/reception staff also always helpful and friendly. We tipped the doormen/concierge/housekeeper when they helped us with things (~ $10 each time), but I believe this is the norm for NY, so it didn't seem strange.I could rave on and on about this hotel, but it really is an amazing hotel in a really good area. I agree it is a typical hipster nouveau trendy hotel, and slightly (not &quot;vastly&quot;) over-priced, but I think you get what you pay for and at 60 Thompson, attention to detail and customers was spot on throughout our week long stay, which means more to me than paying less for sub-standard service.The rooftop bar is lovely - the perfect setting for a cocktail or two after a long day shopping, and the restaurant was also very good. I'm not a huge thai food fan, but it really was good.The only niggle I had while I was there is the first room we were given was really noisy - direcly above the bar (which, incidentally is a lovely cozy, comfortable place), but we asked to be moved and no sooner had we asked, we were moved to a higher floor which had a larger, brighter room with a better view. I believe this may have been a superior room, but we weren't charged any more than originally quoted. Oh, a niggle of my husband's is the mosquito bites he received while sitting next to the trees in the bar at the front of the hotel, although this isn't really the hotel's problem.If you are considering staying in this hotel, ignore any negative reviews and go for it - you won't be disappointed.ps - we had no problems with the air con!pps - really good restaurant Antique Garage around the corner on Mercer Street.", "hotel": "60_thompson", "year": "2009", "date": "2009-06-10"}
