{"city": "new-york-city", "title": "A hip boutique with great food and drinks", "text": "I only spent one night at this hotel, but I can certainly say that I left with the wish to return. Great location within walking distance to Chinatown and shopping in Soho. Convenient to 2 subway stations. When I checked in a bit early on Sunday, I got upgraded from a Queen Superior to a King Deluxe on the 3rd floor, room 32. Very spacious room with a couch. The upgrade was nice, but the room smelled like smoke - I found out during checkout that the 3rd floor is all smoking rooms, so request a room on a different floor if this will bother you. The Fresh toiletries in the marble bathroom was a nice touch. They also had Kiki de Montparnasse items in the dresser drawers (lubricants, condoms, etc.) - naughty! There was a disclaimer in the drawer that said that if the item is opened, then you will be charged for it, but when we arrived, one of the Kiki kits was clearly already opened (but not used), so housekeeping did not replace it properly. In the evening we went to the A60 Rooftop bar, which you have to show your key to get into if you're a guest. Otherwise, I believe you have to be a member. There were 2 sides to the rooftop bar, one that had the actual bar and was already full according to the bouncer, and the other which had table service. Nice views of the city. But don't go there hungry, b/c they don't serve food on the rooftop. For casual appetizers, head to the Thom Bar on the lobby floor (2nd floor). The Bar has a masculine feel, like a mix between a library and hunting lodge, with dark wood and modern furniture. There was a dj spinning ambient tunes. The chocolate braised shortribs were to die for! Excellent food and great drinks muddled with fresh fruit, although they took a very long time to arrive, and I downed mine in 2 seconds (not much there). Very friendly reception staff. Great food, good drinks. But I requested ahead of time that a special note be left in our room upon arrival for my friend's birthday, and they did not deliver on this, so the custom touch was missing. Housekeeping also took a while to bring extra sheets.Overall, a memorable experience. I would give 60 Thompson another stay upon my next return to NYC.", "hotel": "60_thompson", "year": "2008", "date": "2008-06-01"}
