{"city": "new-york-city", "title": "6 Columbus - Pretty Good", "text": "I was in NYC for a business trip and stayed at 6 Columbus for 2 nights.LocationThe property is right across the street from the ACE subway line and The Shops at Columbus Circle. It is a great location that is close just south of Central park and an easy walk to everything mid-town. Oh, there is a Starbucks next door too in case you need a caffeine fix.StaffALL the staff were wonderful to deal with. They were friendly, professional and helpful. You would think this is one of the basics.RoomI'll post some photos, but the rooms are a reasonable size. I wouldn't say that it was a large room, as the king bed just barely fit with the 2 side tables, but it was serviceable. No complaints.The view was the back of another building. I had the curtains drawn the whole time and thought it was fine. If you want a brighter room and a good view, ask for a suite in the FRONT of the building. The decor is slick, but I agree with the other reviewers in saying that it is a bit too dark. I like dark hip lounges, but would like the bedroom a bit lighter/neutral.The worst thing was the air conditioning system. It worked, but it was basically an on/off switch run by a thermostat. This isn't bad in itself as the temperature was kept at a comfortable level, but when on, it was LOUD. Really loud. I found it hard to do a video conference on my computer with the fan on...something that I've never had issues with in other locations. Room AmenitiesNicely furnished with Frette robe, Dean and DeLuca snacks in the mini-bar, and Fresh bath products are a nice touch.Hotel AmenitiesThe building is old and it shows its age. You can either think of this as quirky and charming or dumpy. I prefer the former. :-)It isn't a newly constructed hotel with a work out room, pool, etc. Not a big deal to me as I work out by walking everywhere while traveling.The hallways seem a bit dark...as do the elevators that are covered in dark pony skin or something. This is the hotel's attempt to be hip and slick. I can take it or leave it and would rather have brighter hallways and rooms.There is a pretty restaurant off the lobby that serves Japanese inspired foods. It is pretty vibrant at night. It is OK (not great), and a bit expensive... Nice atmosphere but if you just want good food, you can do better just by going on a short stroll around the block.Oh WiFi...like all travelers these days, I need wifi...and the hotel is smart to have fully blanketed the building with FREE wifi. A big plus! What's with hotels that still want to charge for wifi access after already gouging for the stay?OverallThis hotel has been greatly anticipated. The retrofit is decent but nothing really to write home about. A bit dark for my tastes.I thought it was a nice hotel and would stay here again. Great location, excellent staff, decent room. If you can get a good price, it is a good play to stay.", "hotel": "6_columbus", "year": "2008", "date": "2008-08-01"}
