{"city": "new-york-city", "title": "Great find in NYC", "text": "We just got back from an incredible trip to New York City and Philadelphia. We stayed 1 night at 6 Columbus in NYC and it couldn't have been better. The location is great if you don't want to be at Times Square and you don't want to go as far as the &quot;Upper West Side&quot;....this hotel is located in the middle of them. It is very close to the Trump and Mandarin Hotels. It is next door to a Starbucks &amp; across from large grocery store (Whole Foods?).Now for the hotel itself. Check in took only seconds. The hotel features a very cool decor with a great city vibe. We went for the cheap seats and got a Pod Room - which is a full size bed. The room is tiny but it is flawlessly designed to maximize space. Do be careful not to hit your leg on the bed corners ~ can be quite painful :) The bed was very comfortable and had crisp white bedding. I must admit, we are not a fan of down type pillows. There was a stocked refreshment case, but we did not use it. The flat panel t.v. was quite nice . The view from our window, well we had a lovely view of nothing, but we were not in NYC to look out our window. Now for the bathroom....I have to say I now want rip out my own bath and copy the one from 6 Columbus! The floor is heated ...don't underestimate how incredible this feature is. NYC at Thanksgiving is VERY cold and this floor feels fabulous on your frozen toes. There is a very cool tiled shower (no tub) and great bath products. They even thought to give you Q-tips and Cotton balls....a lovely touch. The bathroom sink is really beautiful too with a cool gooseneck style faucet. The towels smell great too ~ sound weird I know, but the towels aren't perfumey, they just have a nice fresh smell to them ~ very pleasant.The hotel staff was excellent and they had our luggage loaded in to a cab before we ever blinked...they make everything look easy here.I would highly recommend giving this hotel a try. If you are ever planning to visit the Macy's parade then this location would be terrific. You won't see it from your window, but you'll have total access in just steps....without the chaos of Times Square.", "hotel": "6_columbus", "year": "2008", "date": "2008-11-29"}
