{"city": "new-york-city", "title": "Surprise surprise!", "text": "In the past I've stayed at the Skyline and Warwick hotels in NYC and had great experiences. I like to try something different every visit, and this time I was short on money but taking my sister, so I wanted her to have a good room. After reading all the great reviews of 414 on here I booked without hesitation, although I'm not crazy about the Hell's Kitchen area. They called to confirm the day before I left which has never happened at the other hotels. My hotels in the past have taken up quite a bit of space and been impossible to miss, so when I arrived at 414 and saw nothing more than a small door I knew I was in for something different. We had to buzz in to enter which I've never done before. I was horrified by the dark &quot;lobby&quot; which is really just a desk and a couple of chairs. They wouldn't let us check in early but said we could store our bags there while we go out. They didn't have an actual luggage storage area. Instead she told us to leave our bags by the door, and she gave us a colored sticker to stick on them. I don't know what the point of this was. When we finally did check in we just took the bags without being asked anything. The staircase up to the room was dark and narrow. I was scared of what I would when I finally entered the room but was really finding it all quite humorous that my sister was experiencing the sterotypical ghettoness of New York for her first trip. The hallway was so dim, only lit by a light bulb on each floor. However, when I entered the room I was so impressed. It was small but spacious enough for us. I searched around for bugs or mice or blood stains or some other disgusting thing but found nothing. The bed was extremely comfortable. The staff was all very friendly. Most of the things they advertise that come in the rooms aren't actually in there. You have to call down to the lobby and they will bring them to you. We were always greeted with a smile and offered friendly conversation by the front desk, and even the maids. Although I loved the buidlings in the area, I felt a little scared walking alone with my sister at night. After dark there were a lot of restaurants on the street, each one with one person just hanging out in front. However, this is just a fear I have in any American city, including my own (but I don't walk here, so it's not a problem). My impressions of the hotel went from disappointed to disgusted to being excited to return. It's not a high-class, upscale hotel, but it was by far my favorite room and the best service I have encountered at any New York hotel.", "hotel": "414_hotel", "year": "2004", "date": "2004-12-01"}
