{"city": "new-york-city", "title": "Great but showing some wear.....", "text": "My wife and I have stayed at 60 Thompson two other times over the last four years. Each time we stayed for about a week. It had been about a year and a half since our last visit and we took advantage of a &quot;good deal&quot; on the basic queen room at $299. Well $299 doesn't get you much at all in NYC so we were thrilled to find a good deal. And, at 60 Thompson you do get a lot - attentive bellmen, cool staff, rooms where everything works, great showers and a nice bathroom. The Soho location can't be beat.In the past we always upgraded to a larger queen room. It wasn't available for this visit and we sure missed it! It has more room, an extra chair and a view to the front. The standard queen (which is smaller) only has a rear building view and you get some noise from air vents from the building behind the hotel. Our room was neat and clean but there were signs of wear. The couch had a stain and some of the towels seem to be a bit old. (They aren't the same brand they used to have. I used to think 60 Thompson had the thickest towels in NYC!) We also needed to call down for new shampoo and conditioner three out of seven days. The lobby area is very worn looking, with faded fabric pillows and carpeting. I ordered a glass of wine on the rooftop lounge and the reusable plastic glass had a huge crack!Staying there for a week we had a lot of reasons to interact with the staff. They were always attentive and friendly. The bellmen were especially nice and greeted us each day. Any requests we had with the front desk were addressed very quickly. Everyone seems &quot;on the ball&quot;.It's a pretty cool place and a great location. But it isn't plush. If you can get the premium queen and a room pretty high up I think you will enjoy it a lot. My stay 8 months ago at the Soffitel, the #2 ranked hotel on Tripadvisor in NYC, wasn't as good as 60 Thompson. In NYC I am always grateful for a room under $400 with a good staff, a clean room and air conditioning and plumbing that work. When you add its location it is hard to beat. Now, if they could just bring back those uber thick towels and refurbish the lobby........", "hotel": "60_thompson", "year": "2007", "date": "2007-05-24"}
