{"city": "new-york-city", "title": "Great Location would stay again", "text": "We recently stayed at 6 Columbus for two nights as part of a three week NYC stay where we changed hotels a few times to experience different neighbourhoods. Our first impression was that the front desk were not too friendly, however the doormen were extremely friendly. On check in we were given a room on the 2nd floor, (243 i think?) and it was pretty much what you see on the internet pictures. Nice retro style, but small room, if that was a queen bed then i'm the queen of england! it was barely a double i think. Bathroom was nice with good keihls ammenities....however we didn't stay in this room long, we had a shower straight away as we'd just come in from DC on the train, and immediately realised the noise of the air con unit outside was absolutely insane! It was a constant hum and every five mins it would 'kick into gear' and go up to a dull roar! We both said, 'we can't stay in this room' so went down and asked to be swapped, they had a room on the 8th floor available which was nowhere near as noisy so we took that one, even though it had a slightly strange smell about it-i think perhaps a weird air freshener? Room 845 (i think) was a bit bigger as well, and also had a window you could look out not a frosted glass window where i felt a bit claustrophobic like in the 2nd floor room!Staff were helpful, we asked one of the doormen for a dinner reccommendation and it was good, didn't eat at the hotel restaurant so can't comment on that.Loved the location right opposite the Time Warner building with Whole Foods in the basement which we patronised for breakfast, lunch and snacks, the subway is also right there too which is handy. We walked to 9th ave where there are many great restaurants and it was only about 7mins walk which was great. Would definitely stay here again and make sure i get a high floor room, we had a Queen deluxe i think and we got what i thought was a great rate on quikbook. Note: take the elevator up to the roof deck and take some photos from up there, we got some great shots, if they ever get the bar open up there it will be an excellent spot.", "hotel": "6_columbus", "year": "2009", "date": "2009-05-10"}
