{"city": "new-york-city", "title": "Great if you like bugs and bird excrement - see the pictures", "text": "God help you if you booked via a booking channel that doesn't specify the room type, like priceline.Lobby nice, doormen always exceptional. Room 49: nightmare. It's tiny, but that's not the issue - I've stayed in the Hudson's even tinier rooms happily. It's not pleasant to have nowhere to open your suitcase except on the bed, but that's not the big problem here.The window in the room overlooks a waste disposal pipe in an internal airshaft, with a view across to adjacent rooms. That is, if you can see through the window given how much encrusted bird excrement cakes it - check out the photo.Of all the hotels I've ever stayed in, this is I think the most depressing layout. I couldn't deal with that aspect of the room, so I returned to the front desk. Lula on front desk told me I could pay almost $600 to upgrade to a better room - still nothing special, not up to an average Marriott or Hyatt standard - and she literally walked away when I complained. The general manager Barbara Lopez left notes every night asking to be contacted if anything could improve my stay, but she never replied to my email.The bathroom had silverfish bugs - check out the attached photo. I didn't bother complaining at the time because of my horrible prior experiences with Lula and Barbara, but I showed them these photos upon checkout and they didn't care or offer me any sort of amenity, not even a discount on my $20 minibar.This stay was approximately halfway through a 120-night vacation at 4* hotels throughout the Americas. It was easily in the bottom 10% of my hotel stays. I've stayed in NYC hotels around 40 times this decade, and this was easily the worst experience of the lot.I was so looking forward to my first stay in a Thompson hotel. I'm now about as anti the brand as it is possible to be.Avoid this hotel unless you are paying for a specific room type - but if you're gonna overpaying that much, just choose a better hotel.", "hotel": "6_columbus", "year": "2008", "date": "2008-10-12"}
