{"city": "new-york-city", "title": "Killer Location but Worse for Wear", "text": "We have just returned from New York and we stayed at the 414 Inn/Hotel after reading its review at tripadvisor.com. It has a killer location, only a few blocks from Times Square, Midtown, but in a quiet leafy street, and minutes from major subway links.For NY it has a nice concept: boutique hotel, and unsually for USA provides a breakfast, albeit a modest one with Kellogs mini cereal packets, large croissants and muffins, and mini bagels; fruit juices, coffee and tea (if you are Brit, you'd better take your own PG Tips because the US Lipton tea is insipid at best, and also some of the economy priced US bakery foods do taste like sawdust).The rooms were of good, size and appointed with a flat screen 37-in TV; a nice gesture. The so called legendary staff were okay I suppose when we were there. Free internet access and Wifi is available in public areas. Rooms have iron, hair-dryer and thankfully, safes.Certainly the hotel's website projects a &quot;boutique&quot; image, but during our visit, the hotel seemed the worse for wear, particularly as we had to fork out $220 per night per room. Okay, it has a great location, but so do many other hotels, and the owner needs to to re-invest some of his profits and sort out the following before it comes just another dire establishment for which NY is infamous:1) During our entire stay one of the busted lightbulbs in the bathroom wasn't replaced; the bathroom floor may have been wiped daily but it sure didn't look it; the bathroom door never closed as it stuck to the door frame. The bathroom was nice and spacious and apart from the floor was otherwise, quite clean and generously stocked with quality toiletries. The bath/shower was clean and there was very good water pressure in the shower. Toilet was clean as well. 2) The air-conditioning's coolant was not topped-up so it never really cooled the room; and it was a noisy unit3) The window blinds were tatty and need replacing. One of the 2 windows would not stay open for access to the fire-escape, which is a total no-no in terms of NY Fire Department regulations (one did stay open)4) I don't know how often they vacuum the carpets in the public areas and in the rooms, but they looked really dusty and desperately need shampooing or replacing with tiles or wood or laminate floors.5) The old cabinet where they kept the old fashioned rrom TV was still there with the doors hanging off the hinges, so quite unsafe if you have small children in the room (which we didn't)I would recommend the hotel if they sorted this all out; otherwise they need to reduce the rates to reflect the lack of re-investment in comfort, cleanliness and safetyAnd by the way, if you are on the 4th floor, you'd better prepare to struggle taking your luggage all the way up; there's no lift!Hope this helps,Ken", "hotel": "414_hotel", "year": "2006", "date": "2006-10-09"}
