{"city": "new-york-city", "title": "Ok but nothing special.", "text": "Stayed at 70 Park Avenue for 5 days in April 2009. We chose the hotel based on price because so close to the Easter period hotel prices seemed to be spiraling upwards. THE GOOD - On the whole our stay at 70 Park Avenue was fine. The room was OK sized for New York and broadly speaking we couldn't fault the cleanliness. The staff on the few occasions we encountered them, were helpful and friendly. The room and the showers seemed quite new. A great flat screen TV as well as a DVD player. An ipod docking station was provided.New York Times was delivered every day. The concierge helped us book restaurants for dinner and even had Pizza delivery menus for the rainy day. Free Wifi in the room if you choose the option to become a Kimpton Member - basically sign up to their newsletter for free and get free internet access. Otherwise it is $11 a day to have wifi in the room. THE NOT SO GOOD. The room was very poorly lit and several of the light fixtures weren't working. We had a room on the 6th floor and the view was of a concrete wall. The bathroom had no window and very little ventilation.No shower gel or toothpaste was provided and housekeeping were very stingy with the L'Occitane bathroom products. They didn't leave enough shampoo or moisturiser for two and didn't always replace things. Overall 70 Park Avenue is OK but it can't really be called a boutique hotel. I've stayed in NYC many times in many different locations and compared to my stays on the Lower East Side and Greenwich Village, this neighbourhood was far too quiet and without enough of a buzz in the evening. Time Square is close by but if you've been to New York before and already done all that touristy stuff then this hotel isn't in the greatest location. The hotel was pretty good value for money (since NYC is so expensive) and rooms are clean and in really good condition but be prepared to take the subway or cabs downtown for nightlife.", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-04-23"}
