{"city": "new-york-city", "title": "Bait and Switch ...", "text": "First off, let me tell you that my husband and I have spent hundreds of hours and thousands of dollars in the Hollywood Roosevelt over the past several years. We lived in Hollywood during most of that time, and we encouraged many, many of our friends to stay there while visiting us in LA. We also spent several NYE's and multiple Memorial/Labor Days with you. Since we moved from LA, we chose you to stay when business brought us back to LA. We LOVE the Roosevelt Hotel!!!! We have always been treated with the utmost respect and, in fact, were recently upgraded when we checked in for a 1-night stay in 11/08.Based on this love, we booked the Six Columbus via a travel agent to celebrate my husband's 39th birthday this past weekend, for a studio suite at the rate of $220/nt. Although there were cheaper rooms available at your hotel, we decided to spend a bit more since it was my husband's birthday. We were so sorely disappointed that I must bring it to your attention in the hope that it will be addressed. We arrived in NYC at approx 4 pm on Wed June 3rd, 2009, and travelled to the Six Columbus, which took approx 1.5 hrs by the time we got our luggage. Our plan was to check in, freshen up and then meet up with friends for a dinner reservation at the Gramercy Park (Rose Room) for dinner at 7:30 pm. When we arrived we were informed that the front staff already knew about Dean's birthday, and that we were being checked into room 111, &quot;a very nice room.&quot; When the bellman took us up to the room, we were disappointed to discover that the room was not in any way a &quot;suite&quot;, but a regular (albeit nice) hotel room. We contacted the front desk, and the person assured us that the room was in fact a &quot;studio suite&quot; even though there was no suite area whatsoever, and the room did not match the room photos displayed on the website we had booked through (www. newyorkluxuryhotels.com). Even the bellman who brought our bags confirmed that the room was not considered a &quot;studio suite&quot; but a king superior room. We felt hustled - our first and stereotypical experience of NYC.We contacted the travel agent with whom we had booked, and that agent began the process of straightening things out, and ultimately relocating us to another hotel. All the while, time marched on as we attempted to solve our problem ON MY HUSBAND'S BIRTHDAY in the hope of making a timely dinner reservation in NYC. In the interim, the (lovely) bellman came up and informed us that the manager, Costas, had &quot;upgraded&quot; us to a king suite. The bellman took us down to room 20, which was the EXACT picture on the website depicted on that site of the studio suite that we had booked (as well as the king suite on that site). Unfortunately, the room was on the second floor directly overlooking the street, and EXTREMELY NOISY. Because we knew that we were being jerked around, and that this room was not an &quot;upgrade&quot; but the original room that we were promised, we protested. By now we had lost any chance we had of making our reservation at the Gramercy Park for dinner, and we were still dealing with our room situation. My husband went down to discuss the situation with the manager, &quot;Costas&quot;, and came up fuming with the comment that he should have known he was going to be hustled by a Greek (my husband is himself Greek - in fact we were married in Santorini, Greece). Extremely disappointing start to our NYC trip, and we did in fact miss our dinner reservation at Gramercy, which could not be rescheduled due to how busy they were that night. Basically, my husband;'s birthday celebration with friends was ruined thanks to &quot;Costas&quot; at the Six Columbus.The next day, thankfully, we moved to the Smyth Tribeca. Now THIS IS A HOTEL that knows about service!! We were treated with courtesy and respect, and the hotel was great! Too bad that one of our four nights in NYC was ruined.", "hotel": "6_columbus", "year": "2009", "date": "2009-06-09"}
