{"city": "new-york-city", "title": "Best in Soho 1/3 the price of Mercer!", "text": "I was skeptical, but the staff, service and GREAT beds won me over. I paid $189 on a holiday special, and got upgraded on check-in to a Deluxe King. First of all, let me say that I am young and supposedly hip, that is to say I am Jason Pomeranc (that's Pomerantz)'s key demographic. That settled, Mr. Pomeranc's people know what they are doing. My stay at 60 Thompson kicked off what turned out to be the better part of a long weekend in New York during the transit strike. I stayed at two other hotels, my usual Westin Essex House and the Sheraton New York for the last (emergency) night. I had just spent a week in Canada, so I was a bit weary of hotel-hopping. From the moment I arrived at 60 Thom, I was treated like family. Check in was a breeze, and considering I had a ton of luggage from my week's travels to bring in, the bellman was as cool as could be. I only detected an air of snobbery on one of the bellmen who, thankfully, was pretending to be uninterested in another set of guests. I have a sinking feeling that during a certain time of year, they hire a number of people who can't help having a certain attitude that tends to put off some guests. Moving on...My room, #93 on the ninth floor, faced east toward Soho as all the Deluxe Kings do. The dark hardwood floors and stark furniture give the room a loft feel, especially when you open the windows and let the wind blow the curtains. My first gripe was practical: there isn't enough darn closet space! My closet must have been on a structural column or something because there wasn't one but two areas where it was about 4&quot; deep - barely enough room for a hanging suitcase and clothes and two hotel bathrobes. The king bed was great, just a massive white cloud ready for the magic to happen on its extremely comfortable mattress. The slick 42&quot; plasma screen TV came equipped with a DVD player and separate aiwa CD stereo, and they even gave me a cable to connect my laptop to the TV speakers, so I could play whatever music I wanted. This is something they wouldn't do at any of the other hotels I stayed at this trip. As for the rest...well...the &quot;couch&quot; made a nice luggage bench, and the big leather chair had no desk so it became a clothes hangar. Ah well, the bed made up for either. The bathroom, with its black-marble walls looked nice, but was just a basic shower...although the shampoo by 'fresh' was very good. All in all, the room was beautiful, but I would have added a sexy Aeron chair and a good working desk. I could definitely live full-time in one of these rooms. One evening, when I wanted to dine in my room but not pay room service over-prices, the front desk gladly gave me a laminated menu book of all local restaurants that deliver. In the case that a restaurant didn't deliver, I was gladly told that they would send someone to pick anything up in the neighborhood. Now, that I haven't seen in a hotel before. This place surprised me. The public areas are well designed and well-kept (although I didn not try the bar and restaurant), the rooms are classic SoHo, and the service is r e a l...all these factors make 60 Thompson an ideal bet, especially if you can get a rate under $200. If they charge you over $300-400, I'd really consider splurging ont the Mercer.", "hotel": "60_thompson", "year": "2005", "date": "2005-12-23"}
