{"city": "new-york-city", "title": "Overall Great Stay", "text": "Stayed 4 nights in mid December in what seemed to be pre-holiday peak season. Deluxe King ran 440-440 per night. WHAT I LIKED: Friendly seemingly genuine service. There is a hip attitude pervading the place, as evidenced with the photo shoot occurring in the bar upon our arrival, but we were almost always greeted with warm smiles and very friendly service. The one exception that comes to mind was the concierge desk; they seemed disorganized and hassled, and offered curt responses to requests. Just avoid them.I like smaller sized properties, and this was just perfect in that regard. I also liked the residential feel to the place; it was like staying at a hip friends pied a terre. Room was thoughtfully designed and reasonably sized. Good-sized well-designed marble bathroom with solid water pressure and temperature regulation. Bed was very comfortable, but wouldn't call it memorable. Sheets may be Frette, but really just standard hotel line with a few noticable repairs. Towels were pretty standard and not Frette. Twice a day service kept towels replenished and room in order, but they were slightly skimped on Fresh sugar toiletries.Didn't eat at the property...too many good options nearby. Of note is that Aquagrill is VERY near. And so are Kee's Chocolates!Fantastic location for shopping and exploring. SOHO is in many ways one big mall, which sounds kind of sad, but it's not that bad.WHAT I DIDN'T LIKE:Room was more skuffed up than I would have liked. Although room 88 was relatively quiet, imperfect seal of windows let it a bit of noise. Spot on chair and marks on furniture were too noticeable. Although visually appealing, some furnishing were of so-so quality, but certainly not as bad as W chain.Location not great for finding available taxis easily. Consider car service. Several Spring St subway stations are nearby, as is Dean and Deluca, which is great.All in all, I would stay here again at a better rate. Perhaps need to try Mercer for comparison.", "hotel": "60_thompson", "year": "2006", "date": "2006-01-02"}
