{"city": "new-york-city", "title": "Never again...", "text": "This was my second visit to Manhattan.70 Park avenue Hotel I had checked in and they confirmed my reservation for a king deluxe room. They gave me my keys and sent me to a room on the 7th floor. I found it odd that the room was a step and a half right in front of the elevator doors. My first thought was this was going to be a noisy stay. I walked in to what was supposed to be a king deluxe room to find a tiny bed there. The room was terribly small. I knew this couldn't be right so I went back downstairs to ask the girl at reception what type of room that was. After playing on the computer for a minute she admitted that I had been &quot;downgraded&quot;. However, the price of the room was to remain the same rate as a king deluxe. She offered me a free continental breakfast to make up for it. I was quite angry. Not only was I downgraded but they tried to pass off the same rate as a king deluxe. I could get breakfast from starbucks down the street. I demanded a king room just as was reserved and confirmed. She told me there were no rooms left. I demanded that she find something upgraded in that case. Going back to her computer she miraculously found a king deluxe room. Off I went to the new room. Nobody helped me move my stuff I had to go up and down bringing keys and moving my bags. What service. When I brought the keys to the old room back, upon my arrival back to the new room there was a man in there, saying he was &quot;checking on the mini bar technical difficulties&quot;I did not like that. I didn't trust him not to poke around in my stuff. The mini bar was locked anyhow. So he never did &quot;fix&quot; it. Well I should have stayed in the previous one as this was the size of a shoebox with a bigger bed. I came to realize soon after that she placed me right beside the maintenance room that had a heavy door that would slam at least every 20 minutes throughout the entire night for the entire duration of my stay. Needless to say I did not sleep much after being jolted every 20 minutes. I was considering going back to reception to change rooms but was afraid of what they would come up with next, and wondered what other strange people would pop up in my room unexpectedly. The room is very dark, not many lights. The bathroom is miniscule. The blinds had brown stains all over them. The bedding had holes in it, as well as the sheets. Housekeeping changed the towels but did not clean the sink nor the bathtub. I have stayed in Manhattan before at the Hilton Garden Inn, and their rooms were immaculate and huge, that was luxury. I did not partake in the wine reception. I was too tired from lack of sleep and really didn't want much to do with anything else at this hotel.Instead I took a cab to the lounge at the Time hotel...now that was lovely.", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-09-24"}
