{"city": "new-york-city", "title": "Big thumbs up all round !!!! (visited from UK)", "text": "We visited NYC from the UK for a 5 night stay at the end of November/beginning of december and the hotel was excellent put simply!The staff are really friendly and helpful (down to earth friendly not [-] kissing friendly!). They all were polite and we enjoyed chatting to them as we left in the morning and returned later in the day. Concierge was really helpful right down to booking a table at a sushi restaurant for us a few blocks over when we realised the one downstairs was closed on Mondays....We had a pod room, which did face the building at the back but ultimately it's that or the busy street at the front of the hotel- I know which one I'd prefer (and did!). It was adequate size wise as was the bathroom (heated floor and powerful shower were just the job after being out all day). The bed was massive and possibly the most comfy we've slept in! Flat screen tv was just the ticket as was the ipod stereo on the bedside table.location wise the hotel can't be faulted. We ended up walking most places as nothing was more than a 20 - 30 min walk away really- time square was about 20 mins max, 15 if you didn't have to keep stopping to cross the roads. And if that sounds alot believe me there is more than enough to keep you entertained walking around! Yellow cabs could be got right outside on those occasions we didn't fancy the walk, on our final day we got a yellow cab down to the Staten Island ferry port for about $18 then spent the afternoon walking up to the hotel stopping for coffee and shopping along the way. If you walked it with no stops you'd be looking at 1.5 hours or so.Sushi restaurant and bar are super cool (as the hotel in general really), pastries and coffee in the morning in the bar watching the world go by is a good way to start the morning, and tasty sushi in the evening in relaxed surroundings a good way to end it.The one negative was that the room we had was at the end of a corridor (with two other rooms)- some nights we got a bit of noise (lift door &quot;ding&quot; or a door slam). This was reduced by closing the door that allowed access to the three rooms so all in all not a big issue.We used a generic hotel booking website so got a decent deal. I'd happily recommend this hotel and make a return visit in the future. When we go to London we stay at a hotel called The Hoxton and this hotel is very similar in style, atmosphere and comfort.All round excellent.", "hotel": "6_columbus", "year": "2008", "date": "2008-01-03"}
