{"city": "new-york-city", "title": "So overrated.", "text": "I recently stayed at the 60 Thompson for work.The hotel itself is pretty. The main floor with the bar is clean and elegant, not too designy but modern and minimal. Lots of dark wood, very Thai insipired. The staff is very nice and well trained and certainly try to make everything as smooth as possible. However, when you get there they give you an explanation speech on the special hotel amenities. At the end of the day the special amenities are a bar and a restaurant - and that's it. My room - which was supposed to be a superior king at 549.00 - was a closet. It was so small, I can't even image what the standard rooms look like. The room is minimal, pale greens and greys. Nice - but nothing special. If you stay in these kinds of hotels they all kind of look like each other after a while. There was nothing particularly distinguishing. The bathroom is nice and big. Dark marble - but shower only (in case you like to take baths). The shower amenities were the bare minimum - nothing special. Shampoo, conditioner and a bar of soap. No shower cap, toothbrush etc. Turndown service is nice in that they give you a brownie on your pillow. The &quot;gym&quot; - let's call it that - is in the dark, dank basement. It is an even smaller room - say 8 feet by 8 feet, with low ceilings and no windows. 2 treadmills, a bike, and an elliptical machine piled on top of each other. There is no business center and if you need to use a computer - you are forced to stand at a tiny laptop at the check in counter. God forbid you should have people waiting. Or worse, have to wait yourself. I have to say it's the first hotel I've ever been in without a business center.The room service was a little unusual as well. Minimal - but way too minimal. I ordered the grilled chicken breast and literally got a sliced grilled chicken breast on a white plate. No bread, no salad, no decoration, no condiments. I got that they were going for minimal, but looked more like hospital. All food is Thai inspired so even the chicken noodle soup and the grilled chicken breast had a very strong Asian infusion flavor to them. The breakfast &quot;buffet&quot; is really non existant. 5 bagels, 5 croissants and some toast on a plate. The menu looked ok, but i just wanted something simple off the buffet and sadly there wasn't much of a choice. So all in all - nothing bad - but certainly not worth that kind of money, or buzz. I think if you want to stay in this neighborhood I would recommend the SoHo Grand which really has all amenities a proper hotel should have.", "hotel": "60_thompson", "year": "2008", "date": "2008-12-11"}
