{"city": "new-york-city", "title": "Great Location; Disappointingly Average Hotel", "text": "Stayed two nights in April with my wife, who accompanied me on a business trip. I spent a lot of time in advance of the trip trying to decide where to stay. Knew I wanted to stay in SoHo to be near my sister who lives there. My sister typically refers people to the SoHo Grand, but LOVES the rooftop bar at the 60 Thompson. A client who is in the hotel industry, spends a lot of time in NY, and is otherwise &quot;in the know&quot; recommended either The Mercer or 60 Thompson. At the time I initially checked availability, The Mercer was full and - even it they were not - the rooms were significantly more expensive than 60 Thompson. However, a couple days before I left for the trip, rooms became available at The Mercer and the prices between the two hotels got a bit closer. I stuck with 60 Thompson b/c I didn't want to spend the extra $100 a night. I regret doing so.60 Thompson is in a nice, quiet location still close to all the shopping and restaurants. Rooms are acceptable in size given they are at a boutique hotel in NY, adequately finished and clean -although not very interesting. Check-in was a little strange. We arrived early, so we gave them our cell number and went to shop and grab a late lunch and drinks. While we were out I called to see if we could upgrade our room from a King Superior to a King Deluxe, as I was having reservations about being in their standard sized room. I was told by the reservationist that a King Deluxe was not available, but, as she hung up, she confirmed that we were remaining in our original reservation &quot;which is a King Deluxe.&quot; Before I could clarify whether she meant to say &quot;King Superior,&quot; she hung up. I immediately called back to clarify whether we were remaining in a &quot;King Superior&quot; and whether she was correct when she told me there weren't Deluxe rooms available. This time I was told by someone else that I was being put in the Superior but Deluxe rooms were available and we could upgrade for an additional $50 or so, which I elected to do. Very minor, but I was surprised that there was this confusion given how small the reservation department was. My wife and I also remarked how beat up the lobby was. This is one of the first things you see when you arrive at the hotel. It really sets the stage for what you expect of the rooms, restaurant and bar, although I think the rooms, restaurant and bar are all in significantly better shape than the lobby. You'd think they'd keep things looking nice. Instead, it looked like wall and floor coverings and furniture had not been touched in a few years. Doormen did a nice job getting us transportation and loaning us umbrellas as we headed out in the rain. Service in the bar was acceptable. I left 60 Thompson disappointed. Not b/c it was a bad stay, but b/c I was expecting something just a little nicer, hipper and more special. When I go back I will either save a few bucks and stay at the SoHo Grand or splurge a few bucks and stay at The Mercer in the hopes of getting the experience I was hoping for at 60 Thompson.", "hotel": "60_thompson", "year": "2008", "date": "2008-05-08"}
