{"city": "new-york-city", "title": "Liked 60 Thompson A-LAH!!!!!", "text": "I stayed at 60 Thompson last weekend and was pleasantly surprised given some of the comments I've read here. To begin with, the location is great. There are many many fabulous restaurants (Kin Khao is awesome!!!!) within a few blocks, as well as wonderful shopping. The doormen and bell hops were extremely nice and helpful. It took a while to check in, but who cares? The lobby is a bit shabby. It does need new carpet and a new look overall...it looks better at night. We had a standard queen room on the 6th floor. The view was nothing great, but it wasn't bad either. The bed was one of the most comfortable I've had in a hotel (I've stayed in 6 different hotels in NYC in the past year so I'm getting good at judging these things :) . I don't know what some people's problem is with a duvet cover vs. a sheet. They wash the duvet cover just like they wash a sheet and put a new one on for each guest. It's really better....less to get all tangled up in. The size of the room is, well, small. But not as small as rooms at the Hudson. There's a bit more space to navigate. The bathroom is very nice...not terrific lighting for putting on makeup and the shower/tub is only big enough for one person, but it's all dark tile w/ white fixtures....very pretty. The shampoo and lotions are from Fresh and smell fab. I went to the Fresh store to buy them but too expensive!! The best thing about this hotel is the rooftop bar. There are very cozy couches up there, strong drinks, and a great view. It's open way late into the night and when everything else was dead it was hopping. Seemed to be a very international crowd at the hotel. I would definitely stay there again. It's also convenient for driving into and out of the city. The exit for the Holland Tunnel is 2 blocks away. Valet parking is $35/night. One note is that we paid $179/night for this hotel thru Expedia. I would not pay more than $200/night to stay here. If you can get it for $200 or less per night, my opinion is that it is a good deal.", "hotel": "60_thompson", "year": "2004", "date": "2004-08-10"}
