{"city": "new-york-city", "title": "mixed feelings", "text": "After reading the reviews on this site, I booked through hotels and stayed 4 nights from Dec 28-Jan 1. Was told if I had direct booked I would have had a shot at a better room facing courtyard with king size bed. Wasn't offered because of discount hotels booking.First of all, the pluses: Great central location within walking distance to everywhere we wanted to go. Very nice staff, wrote us a welcome note and gave us a bottle of wine upon arrival. They were available for questions, recommendations if needed. We felt comfortable coming and going. Room was clean and attractive in a low budget kind of way, and bed was not great but comfortable enough. The continental breakfast was a nice touch. The caring staff tried to solve problems as they arose. Checkout was at noon and we were able to store our suitcases in the lobby area after checkout but before we left town.Minuses: Room was small and not much storage area. Very narrow staircase offered great exercise but hard to maneuver with suitcases. We were on the fourth floor, and the first 2 nights we were there it was so hot in our room that we couldn't sleep. Radiator heat with no room controls; had to open windows just to make it bearable, which brought in the noise from the street. Don't stay here if you are a light sleeper who can't sleep through street noise! The room temp was better the second two nights but we still had to have windows wide open. One bedside lamp wasn't working and we couldn't find a control for it but when I felt down the cord there was a break in it where safety wrap had come off, a dangerous lamp but since it wasn't working anyway, there was no real threat. The bathroom fan had no on/off switch either, so we couldn't figure out how to get it on. It was needed as the bathroom gets quite steamy and humid. The hot water in the shower was more like lukewarm, not as hot as I like it. Breakfast coffee one morning was ice cold and undrinkable. Croissants were fresh and tasty; muffins seemed day old (stale). Overall, I had a decent experience because it's NY and the trip was great all together. I liked the location very much; had never stayed on the west side and it was so convenient for theater. Restaurant row is literally a block away. I can't say I'd stay there again though; especially on the fourth floor in the winter. If you try it, request a lower room facing courtyard for less noise (so I'm told).", "hotel": "414_hotel", "year": "2005", "date": "2005-01-03"}
