{"city": "new-york-city", "title": "Expected 4 STAR received 2 STAR", "text": "Sadly, I read the reviews on this site. I went to expedia and saw great reviews. Love the Murray Hill area of NYC, so I said, why not? We wanted to stay at a 4 star hotel in NYC to celebrate SPRING with the kids while they were out of PreSchool.The photos online looked great. The description of the Kimpton &quot;kid friendly&quot; service was what sealed the deal. We didnt want to bother other folks at the hotel when our 3 year old wants to show his behind.Remember, we thought we were going to a 4 star hotel for the $325/night price. We chose this hotel because of what others reviewed on it.CHECK IN1. The lobby was a lot more dated than the photos show. they have a wonderful photographer. :)2. We were not offered our kimpton kids welcome pack, which was sad, cause i kind of pumped it up a bit to my kids to get them all excited about their mini-vacation. 3. Bell Hop service was not available.The ROOMS (We had two rooms side by side)1. Bathroom was not cleaned and mold in the shower/tub grout. 2. Much smaller than the pictures show3. Bathrom was more of a closet than a bathroom. Using the toilet, knees literally hit the wall.4. Grandma Chic is too nice of way to describe the decor. 5. Carpets in both rooms were old/stained/in desperate need of a cleaning6. Windows were dirty/dusty window seals7. Wall paper was peeling/ripped in some places8. wires were hanging from behind the wall mounted TV (Not power cords09. NO coffee Maker? 10. Ice bucket, yet no ice11. $16 for a karaffe of coffee that gives 3 cups (.includes $4 delivery fee, and 20% tip)12. $30 for an omlette...(includes $4 delivery fee, not the 20% tip)13. One outlet by the TV had 7 electronic items plugged into it, it looked like a major fire hazard, and being on the 14th floor, was a bit nerve wracking.14. Furniture, TV, wine glasses, tables, bed side tables all had at least 1/4 inch dust on them.15. Baseboard Moldings: Need of a major paint job/cleaning.CHECK OUT(Checked out at 9am)1. Very slow process. There were about 7 people checking in/checking out. 1 person working the desk.2. Their site stated that could arrange a stroller rental. I asked the front desk person when checking out since we were locking our luggage in storage for the day, would they help us get another stoller for the day (our 4 year old decided he had enough 5 mile walks). She stated NO. I said, but your site says you can do it. She replied, NOPE, we cant help you.WE CANT HELP YOU..... isnt that the kiss of death at a hotel, much less a 4 STAR hotel. 3. The Bell Hop took forever to give us our storage tickets4. Nobody was to help us to the car when picking up luggage later that evening.Okay, the positives:1. Hotel Rep, Matt S, tried helping us by offering dinner or breakfest on them. However, after seeing the attention they gave their rooms, I was not dining in their eating areas.Would have been nice to have a credit or some sort of value given back to me without having to ask... didnt happen.2. They did regrout the moldy tub, which once completed, was great. We didnt complain about the room that was moldy too. My suggestion is they should inspect their tubs.3. Wonderful location.4. Starbucks is less than a 100 yards away5. Good apples in the lobby. (be sure to wash)All in all, it was an okay stay. i would not recommend this hotel if you need to actually stay in the hotel. If you are just using it to lay your head at the end of a long day and getting up right away, than it would be okay if cleaned better.", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-04-17"}
