{"city": "new-york-city", "title": "A complete disappointment", "text": "Our 3 day stay was to celebrate our first wedding anniversary and to round off a 2 week stay in the USA. Feel utterly ripped off and totally regret choosing the hotel. The only positive thing we felt about it was the location, which was fantastic.Issue 1:Took ages to check in, a very luke warm welcome. We'd been so excited about staying there and this reception dampened our spirits somewhat.Issue 2: We decided to splash out and stay in one of the so-called larger rooms at $500 per night, which was one of the smallest rooms I've ever stayed in. We had to store our suitcases elsewhere as they wouldn't fit in the room. That was after the wrong cases were delivered to our room...Issue 3: Very hot room, which was confusing as the hotel had air-conditioning. We had to phone down and ask someone why it was so hot. &quot;oh yeah, that's because the air com system has blown out, it might be fixed later..&quot; Interesting that no-one had told us this when we checked in. The air con started working about 6 hours later.Issue 4: This is a big one, and one which we pointed out to the staff. On our second day we waited about 5 minutes for the elevator to take us from the 9th floor to street level. Giving up on waiting we decided to walk down the fire escape, which wasn't a big problem until we hit the 2nd floor and could go no further as there was a pile of furniture blocking our path. Undeterred we walked back up a floor and found another fire escape on the other side of the building. Alas, on the 2nd floor this was stacked up with crates. Which we had to lift up and move to get out. Really glad there wasn't a fire or we would have all been in trouble. The hotel were acting illegally by blocking these fire escapes and I was disgusted by their lack of consideration for guests. Issue 5:Just a general note on the tedious staff and their 'too cool for school' attitude, got very boring after a while and made our stay uncomfortable We had a fantastic time in NY, but felt absolutely ripped off, we paid $500 per night and had a thoroughly annoying experience. It's not even that exciting as a 'style hotel', and we're stayed at enough of these in our time to have a pretty good benchmark.", "hotel": "60_thompson", "year": "2005", "date": "2005-06-29"}
