{"city": "new-york-city", "title": "Wonderful stay at 6 Columbus", "text": "I've just returned from three nights at 6 Columbus. Having stayed at New York's Hudson Hotel a few years ago, I knew what to expect at this property, which seems to be similarly marketed to the young, urban, and hip set (not sure if that's me, but...). I had a Queen Superior room. It was nicely appointed, contained Fresh bath products in the bathroom, a heated bathroom tile floor that was most pleasant, a flat screen television hung on the wall, and a well-stocked mini-bar with top shelf alcohol and Dean and Deluca snacks. The room is not the largest room I've ever stayed in, but by New York standards, it was more than adequate. The bed fit in the room just fine, and when I'm in NY, I don't come to hang out in my hotel room.That said, my room could easily accommodate two people, which seems to be a point of issue for some reviewers here. There are two drawers for storage under the platform bed and a wardrobe for hanging clothes. Nice touches include an umbrella should it rain (it did while I was there so that came in handy), turndown service with a little mini brownie, and excellent (and adjustable) task lighting bedside and on the desk.There is a restaurant just off the small lobby, Blue Ribbon, that has sushi (It's okay. Some would say great. I would not) that somehow manages to also do room service and traditional American breakfast for the hotel. There are restaurants in the neighborhood, a pub next door, and a Duane Reade pharmacy/convenience store on the corner.I had difficulty adjusting the heating and cooling system in the room. It could be my own ineptitude, I don't know. The controls were those manual &quot;point the dial at the number&quot; controls. I am of the digital age: press an arrow up to a number or down to a number. Anyway, the climate in the room was perfect the first night. Then, it rained, which as you can imagine changed the humidity and outdoor ambient temps and all bets were off after that. I didn't call anyone to complain, and I still slept just fine.There is also a VERY small lobby which, particularly on the weekends I imagine (that's when I was there), uses music to assist in creating a hip and happening scene. The music can be loud in the elevator and in the lobby, but you won't hear it in your room. I guess that covers it. Oh, they seem to spray or pump in a signature scent, similar to what other hotels are doing these days. I find it pleasant. Slightly tropical with hibiscus notes, perhaps? Either that or they have some nice smelling cleaning products! While not offensive or in any way excessive, if you are sensitive to smells, be warned.The hotel is located across the street (W 58th) from the Time Warner Building at Columbus Circle. Great location. Overall, I would recommend this property and look forward to returning soon, probably next month.Happy travels!", "hotel": "6_columbus", "year": "2008", "date": "2008-05-18"}
