{"city": "new-york-city", "title": "GREAT Stay at 6 Columbus!!", "text": "I booked this hotel based on its location, price and traveler reviews (on TA and elsewhere). We stay in the city somewhat often, so we know space is at a premium and affordable rooms are hard to find....especially in good locations! I have to say, you cannot beat the location of 6 Columbus! Easy to find, it is just behind the Time Warner building with top notch shopping and dining just across the street. The subway station is also just across the street, making travelling throughout the city a snap. If you'd rather take a taxi, the doormen will happily hail one for you in a matter of seconds! Central Park is just steps away and on a good day, you can stop by Whole Foods (in the Time Warner center) and pick up fixin's for a picnic in the park......joyous! Yes, the rooms are small. We had a pod room and really, it took me back to my college dorm days! That being said, everything in it looked new and clean. The bed was super comfy and the heated bathroom floors were GREAT!! The fridge was well-stocked and the cabinet was filled with gourmet goodies. There was a small closet....and really, how much closet space does one need on a trip?? I never hang all my clothes when I go away....it was ample for us. There were 2 down sides that I can think of: 1) The lighting in both the bathroom and room were horrible for putting makeup on and 2) the room was HOT when we arrived, so we opened the window, but just beware of all the pigeon POOP ( I will say that in the days previous, it had been quite chilly!).The service was AWESOME! I really noticed how pleasant everyone was. When we arrived, our room was just being cleaned, so they happily stored our baggage until our room was ready...just a short 15 minutes later. When we called for an iron and ironing board, one arrived within 5 minutes!! The front desk always greeted us by name and were fast and courteous.I got a great deal on Priceline, so that was just icing on the cake. This hotel was WAY better than many of the others we have stayed at for double the price! I would absolutely recommend this hotel to anyone!", "hotel": "6_columbus", "year": "2008", "date": "2008-05-11"}
