{"city": "new-york-city", "title": "Fundamentally unacceptable", "text": "6 Columbus was disappointing during my recent two-week stay. I travel as a consultant to non-profits, and my clients understandably want to keep hotel expenses reasonable, which 6 Columbus's rates do accomplish. I am content with a hotel that falls far short of luxury, but 6 Columbus did not meet basic needs. The rooms are small, including &quot;suites,&quot; which, surprisingly, are not really suites but rather single rooms like all others. My room reminded me of a college dorm room. It had no closet but did have a small armoire, regrettably not deep enough to hold a clothes hanger back to front, and wide enough to hold very few shirts or suits. Inquiring at the front desk, I was alerted that two cupboards were built into one side of the base of the bed, which I had not seen since a duvet hung over them. This helped, but it meant I had to get on my knees to retrieve anything. I was a single traveler; I cannot imagine how more than one person could negotiate this room. Of course the hotel finds plenty of space for its in-room mini-bar, food, and souvenir concessions. That duvet, by the way, was not clean (showing organic remnants of a previous guest), and was finally laundered or replaced on the fourth day, despite my earlier requests. The duvet is the only bed-covering: there's no sheet, so you sleep under the duvet (which, for me, became unbearably hot) or nothing. I soon realized this was not such a bad thing. Because the noise level is high (especially from staff in the hallways--and I was not even near the elevator), the only effective strategy is to turn the AC way down so it runs as much as possible to drown out the noise at night, and then it's so cold in the room that the duvet is perfect. A large roach or water-bug ground into the carpet remained for several days after my arrival (and impossible to miss) until I forced the cleaning person to deal with it as I stood by and watched. The cleaning staff was invariably pleasant; one day, however, I returned to the room at 5 in the afternoon to find them just starting on my room, which was inconvenient. The room telephone received calls, but I could not dial out or retrieve messages that were left (though they announced their presence through the blinking light). A manager came to the room to try to fix it and confessed that the hotel's whole phone system was &quot;a total mess.&quot; In two weeks the phone was never fixed. One night I called the front desk, via my cell phone, to arrange an early wake-up call the next morning and the call arrived as requested. The next morning after that someone from the staff banged on my door at the same early hour, shouting that this was my wake-up call but my phone wasn't working. (Unfortunately, that was to have been my sleep-in day.) Room was quite dark, even with all the lights on full, as the window gave on to a deep air-shaft that let in little light. Bathroom was to the usual small-hotel standard. Hallways are very narrow and are made more difficult to navigate by room-service trays, which spend entire days without being collected. Sometimes these sit in stairwells, which must surely be a safety violation. The in-room information book says they deliver the NY Times every morning, but instead they delivered the NY Post, an entirely different species of newspaper. I pointed this out at the front desk, and although the staff-person seemed not to grasp what I was saying, they did deliver the Times (along with the Post) the next day and most days thereafter. Front-desk staff was generally cold and unhelpful. Concierge was pleasant and doormen were eager and cheerful. Entry hallway leading from lobby to elevators is kept very dark (sexy and mysterious, I guess) but I found it impossible to see when entering from the brightness of the street (often via a small homeless encampment outside) and guests were forever colliding with each other in that dark hallway. 6 Columbus cultivates a chic and high-attitude veneer but does not address the essentials of what a hotel must minimally provide. Internet is $10 per day; I might expect a hotel that tries to trade in trendiness would offer it for free, as so many now do. They do respond somewhat to nudging. Still, for a two-week stay it grew depressing, and I cannot recommend this hotel.", "hotel": "6_columbus", "year": "2009", "date": "2009-06-24"}
