{"city": "new-york-city", "title": "Great Find...But Watch the Steps!", "text": "This little hotel is a glorified B&amp;B with some nice accoutrements such as enormous plasma TVs, spacious, well-lit rooms, a quiet interior courtyard and nicely refurbished bath. We did not stay for breakfast, but the baked goodies were delivered in from a local bakery just as we were checking out around 7 to catch a train. The lobby/dining area is a little bizarrely furnished and was vaguely reminiscent of a dorm room filled with cubes and tables and chairs that would have seemed ultramodern about 15 years ago. The reception was about what one would expect for NY...a little brusque, but not at all unfriendly (there is a difference). The only caveat I would give is that the rooms lie primarily in a building separated from the reception area by a small courtyard, and, to reach the rooms, one must climb a very narrow stairway. This is not a not a problem if one doesn't have much luggage (and we had very little), but I was reminded of the flat in Barefoot in the Park to which most people arrive winded from the climb. Not for the infirm or disabled!The courtyard would be a lovely spot to have a glass of wine or your morning nosh. The room was so quiet that I had trouble sleeping from the LACK of noise :-)Located steps from the Theater District, we had dinner at a great Italian spot Southwest 44 (on, you guessed it, the SW corner of 9th Ave and 44th St., about 2 short blocks from the Inn). It's a real neighborhood place with very reasonably priced food that is served in portions enough to satisfy even the most ravenous appetite. My mother had a lobster ravioli that was simply out of this world, and I had bowtie pasta with cavetelli, spinch, garlic and scallops. Delicious. The original proprietor who is probably in his 80s still greets customers. The first time we went here was with a theater friend who introduced us to Jeff Goldblum and other regulars who were sitting next to us right up front.", "hotel": "414_hotel", "year": "2006", "date": "2006-07-24"}
