{"city": "new-york-city", "title": "Absolutely unbeatable for the price", "text": "First off, TripAdvisor needs to immediately correct this hotel's one-star rating as well as its average &quot;$802 per night&quot; rate. Both are skewed on criteria to which I am not aware.I am a former native New Yorker, and I've stayed (both before and following my move) in a variety of the city's best hotels ... as well as a few of its worst. Including this one in its previous incarnation, where I had the displeasure of seeing mice periodically pop their heads through holes in the pink shag carpet. (I only wish I was kidding.) Thankfully shag and mice have long since dispersed.I received a rate of $145/night -- for a queen room, not one of the now-infamous &quot;pods&quot; -- via booking directly through their own Web site. Even considering the nosedive NYC hotel rates take in January and February, that's a total steal. That said, my room was nonetheless very small, and I banged my shins on that infernal platform bed on multiple occasions. I also had some issues with my A/C-heat system, which is the only reason I'm not giving this place five stars.The location next to the Columbus Circle subway stop makes it a perfect juncture for reaching most areas of the city via subway, and although it's too cold to appreciate it this time of year, I'm sure its location practically next door to Central Park will prove a major bonus as well.Blue Ribbon, for those of you unfamiliar with the city, is one of its best &quot;minichains&quot; (with only 4-5 total), and the 6 Columbus location is its first uptown. I ate there and was highly, highly impressed: it's some of the best sushi in a city filled with formidable sushi restaurants, including the infamous Masa across the street.Sadly, it looks like management is already onto the fact that they priced the rooms too low: their winter rates are already up 50% (to $215/night for this upcoming weekend - on their site, not Quikbook).", "hotel": "6_columbus", "year": "2008", "date": "2008-02-06"}
