{"city": "new-york-city", "title": "Exceptional Service and Value", "text": "My wife and I stayed at 6 Columbus during a random weekend in New York this February. We found 6 Columbus through Tripadvisor and were encouraged by its ranking (#128 as of this writing). In short, we were not disappointed with our choice, as it turned out to be anf extraordinary value for a NYC hotel!First off, a caveat about the location for this hotel for people not familiar with NYC. It's located right off Columbus Circle, a good 20 minute walk from Times Square. This wasn't a deal breaker by any means, however, and the Columbus Circle Subway stop is right near the hotel anyway. A Taxi ride right into the heart of Times Square was a measly $3.50, as well.Upon arrival, the doors were opened for us and we were greeted with a smile and a polite welcome by everyone in the modern-decor lobby - a great way to start a stay. Check in was a non-issue and we quickly found ourselves in one of the animal hide (fake)-lined elevators going to our room on the 9th Floor (there are 12 floors of rooms with two floors above that).We opened the door to our Queen Deluxe room and found a warmly lit, intimately sized room with a modern twist. Dark Teak floors are throughout the the main room, and you have amenities such as a Flat-screen LCD TV, mini-fridge, safe, bathrobe, iron/ironing board, iPod Alarm Clock and one of the most comfortable hotel beds we've ever slept on! The brown teak headboard for the bed spanned the entire length of the wall behind us, but stopped short from the ceiling by about 6-8 inches. This space hid a recessed light that lent a nice, indirect glow to the room when on.The bathroom seems light standard fare, but is very clean and boasts an interesting extra feature - heated floors! What a treat to not step onto a cold tile floor after a nice, hot shower.After settling into our room, we made our way downstairs where we found Eric the Concierge. He was perhaps one of the most helpful and knowledgeable concierges we've ever had the pleasure of meeting. He helped us with everything from our dinner plans to making reservations for us at a comedy club he recommended. Definitely a great resource to have when in NYC - even if you consider yourself knowledgeable.We had lunch at the Hotel's Blue Ribbon restaurant (Japanese) and found it about average and maybe a tad overpriced - quite contrary to the hotel. Mind you, there was nothing wrong with the Sushi we ordered, but it wasn't anything to write home about and the service was impersonal but prompt. I would say it's convenient, but you have better choices literally right across the street in the Time-Warner Building. One other note about the hotel - bring your own computer, as they do not have a business center. Overall, 6 Columbus was an excellent value, and I would highly recommend it as a great hotel outside of Times Square.", "hotel": "6_columbus", "year": "2009", "date": "2009-03-01"}
