{"city": "new-york-city", "title": "Superb find!", "text": "We spent 13 nights at this fantastic hotel. Originally booked a deluxe King at an excellent rate on Perfect Escapes but found a great deal for a suite on Tablet Hotels web page although we stayed in a Studio King on our first night. Long story but handled very well by the hotel &amp; we loved that room too. It was huge with a balcony &amp; enormous bathroom &amp; good view of a corner of Central Park but we decided to move to the suite. We were given the choice &amp; it was a hard choice actually! But the rooms of the suite were very quiet, beautifully appointed with clever design features &amp; gave us plenty of space for a long stay &amp; overlooked 58th St &amp; the Time Warner Center with a glimpse of Central Park as well, &amp; exactly as portrayed on the hotel's web site. Nadia kept it in great shape for us during our stay &amp; it was lovely to see her smiling face every day.The delightful Julian welcomed us on arrival after our long flight from Australia, charming Caeser showed us to our room &amp; greeted us by name every time we saw him again. As did everyone at this gem of a hotel including Ciaron &amp; Stan who run a fabulous bar &amp; helped make our stay so fantastic, along with Richard &amp; all the staff at the marvellous Blue Ribbon Sushi restaurant where we ate several times. Terrific menu, sublime food &amp; decor &amp; most reasonably priced.Getting around NYC was as easy as. Great subway across the road literally seconds away but anytime we needed a taxi Anthony &amp; Parry were always on hand &amp; must be two of the most affable doormen in town....aside from the others working at this hotel.Room service swift &amp; not at all expensive for a hotel of this stature &amp; location and neither was the well stocked mini bar. Free internet &amp; breakfast downstairs in the mornings...which we never got to eat! Too many laughs at night in the bar! This was my 6th time in NYC. Have stayed in a variety of hotel types but wanted to try somewhere new. Doubt that I would ever stay anywhere else again unless rates go through the roof which they might well do. Then again I would probably pay them as we had such a magnificent time.An easy walk to theaters, Whole Foods across the street for a quick bite, Chemist &amp; Starbucks next door &amp; anything else you might need close by.We are kinda fussy travellers but appreciate service par excellence &amp; a hotel that turns out to be what it portrays to be. No wonder we can't help but be blown away by this wonderful stay at 6 Columbus. Spend the extra for a suite, studio or deluxe room &amp; have a ball! We feel indebted to everyone associated with this hotel &amp; wish them continuing success", "hotel": "6_columbus", "year": "2008", "date": "2008-04-11"}
