{"city": "new-york-city", "title": "Fantastic location - loved it", "text": "My husband and I stayed here as the first leg of our honeymoon.I'd stayed here before on business (i.,e I wasn't paying) so it was a bit of a splurge as we normally stay at cheaper hotels in NYC (Washington Square Hotel).I booked through Quikbook and got it for almost half the advertised rack rate. The King deluxe room is advertised on the hotel's website for around $650. We're Brits and are a little intimidated by all the tipping that goes in the the USA but it was pretty painless here. The bellboy greeted our car (tip) and another brought the bags up to the room (tip).The room was lovely, very stylish, not huge but hey, it's New York. It had a sofa, mini bar, treats, marble bathroom, robes, safe, big bed with lovely soft pillows. All the comforts. The hotel was very quiet and you never really see anyone else around.A lot of stars stay here, we got our picture taken one evening leaving as the paparazzi were waiting for Kirsten Dunst who was staying there at the time. There were fashion shoots happening in the (small) lobby and guest list queues waiting to go into the bar. Talking about the bar, the roof-top wasn't open (May) and the Thom bar on the first floor was pretty expensive and full of non-guests and wanabes. I think there's better bars in walking distance to be honest so wouldn't hang out here.Great location if you like being in the heart of Soho and Tribeca, we walked to Bubbys Diner for breakfast and a great restaurant called Jane on West Houston for dinner. I asked the concierge to make a dinner reservation one night and they are great - a card was put in my room stating the reservation and directions on how to get there. We went to Public in the lower East Side and the food was lovely.The turn-down service is cute, bottle of water and a brownie.If you can get it for a good deal, stay there. Much better than staying uptown if you like neighbourhood restaurants and cool shopping.", "hotel": "60_thompson", "year": "2007", "date": "2007-05-28"}
