{"city": "new-york-city", "title": "All in all a great stay in a fantastic city!", "text": "We have just returned from our first visit to NYC and this hotel was a fantastic part to a superb holiday. We booked through Expedia and got a great deal including flights.The hotel is in the perfect location - few minutes walk form Grand Central and right in the heart of the famous NY sights - Empire State building and the Chrysler building. It was perfect being so close to everything and not having to travel far to visit other sights.When we arrived at the hotel, unfortunately the room we had booked was not available to us. However, the hotel did everything they could to help us - they put us in a temporary room on the 17th floor with amazing views and gave us complimentary breakfast vouchers and a mini bar raid voucher. The room was fine for a shower and sleep after a long day travelling from the UK. The following day they moved us to our king deluxe room on the 15th floor which was amazing. It was extremely clean, had a lot of space - lovely seating area over looking the city streets and Grand Central, amazing bathroom with plenty of mirrors and gorgeous products which were replenished regularly, large plasma tv, massive comfy bed, quiet air conditioning, cosy dressing gowns, free wi-fi. A great room to stay in after a long day sightseeing.All of the staff at the hotel were extremely helpful and were happy to provide you with items that you needed - I requested hair straightners and got them 5 mins later. The concierge were helpful in printing off boarding passes and were available if you needed anything. The bell boys were friendly and there to help.The wine reception, which was held in the lobby every evening from 5 til 6, was a great added touch and was well deserved after shopping/sightseeing. The attached bar had happy hour from 5 til 7 with some tasty cosmos and other cocktails at resonable prices.All in all a great stay in a fantastic city!", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-05-29"}
