{"city": "new-york-city", "title": "Great Location Friendly Staff", "text": "We spent two nights here when we were in Manhattan on business. The location is great -- Murray Hill is a good neighborhood with plenty of places to eat and drink, and the hotel is right down the street from Grand Central, so it's easy to get anywhere.The hotel staff was friendly and accommodating as they always are at Kimpton properties. The wine reception in the evening is a nice Kimpton touch also.Our king room was an okay size, but the layout left something to be desired. it was hard to work at the desk because the chair backed up to the foot of the bed and the large screen TV was just above the desk. I don't go to New York to watch TV, but it was NCAA tournament weekend and my team was playing. Unfortunately, the hotel doesn't get CBS, which is rather amazing since the studios are just a few blocks away. When I asked about the reason, I was given vague answers about the signal being hard to get in Murray Hill, or maybe it's because they're moving the transmission towers. I think it probably has something to do with the digital transition, but that's just a guess. The TV was not so hot either, even though it was a 42-inch flat panel. It took forever to warm up, and the picture was never very clear. My only other complaint with the room is that there was no coffee pot. They offer complimentary coffee in the hotel restaurant, but who wants to have to get dressed and mingle with people for that first cup of coffee in the morning? It's a minor detail, but it puzzled me that there was an ice bucket in the room when there were no ice machines anywhere, yet no coffee pot.The decor was nice, the bed was unbelievably comfortable, and the bathroom amenities were first class. The wireless connection was good, and they have a business center in the lobby where you can print out boarding passes for your flight home.I would stay here again and highly recommend it, especially if you don't care about watching TV.", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-04-04"}
