{"city": "new-york-city", "title": "6 Columbus was Fabulous!", "text": "My boyfriend and I stayed at 6 Columbus for four nights at the beginning of April and had a fantastic stay. Now I'm considering it for a trip in the fall with my sisters. When we got to the hotel, we were greeted at the taxi cab's door by the very friendly doormen. I have to commend the hotel on the doormen they have working for them...what fantastic and friendly personalities they all have! Our room wasn't ready upon arrival, so the manager gave us complementary drinks at the Blue Ribbon Sushi Bar - a great little bar to frequent before dinner or when you come back from a long day of shopping (get the grapefruit cocktail listed on the menu!). This simple gesture was a great indication of the stay we were going to have.Once we got up to our room on the 7th Floor, we were surprised at how cozy and lovely it was. The room was small (I believe we booked a Queen Superior), but that is normal in New York, and neither of us were bothered by it. There were cute little touches all about the room - magazine racks with up-to-date publications in them, like Time Out New York, a vase with a real flower on the nightstand, an i-pod dock, under-the-bed storage. The bed was lovely, and very comfortable. Every night we slept very well. The bathroom was a good size with a deep tub, so no showers overflowed onto the floor. There was a window/shelf in the shower to place your toiletries. The toiletries - by Fresh - that the hotel supplied were fantastic. The towels we so fluffy! OH! And the best part of the bathroom - the heated floor in front of the shower area! It was fantastic in the morning to step onto a heated floor and I even found myself standing on it after our long days of walking.My only &quot;issue&quot; with the room is that after we both showered, the room itself got rather humid and muggy. The location of the hotel was fantastic. There was a subway stop right across the street where we could get downtown very quickly. One of the nicest things was being able to get up, grab a coffee at Bouchon Bakery across the street, and take a morning walk in Central Park. I had reservations about staying uptown, but ended up being very pleased with our location because I liked having the access to the Park, the Upper East Side, and being able to get downtown to Soho so quickly and easily.As I said up above, I am already considering 6 Columbus for a trip in the fall and would recommend it highly! From the staff to the comfy towels and bed to the fantastic location, I could not have picked a better place to stay!", "hotel": "6_columbus", "year": "2008", "date": "2008-05-06"}
