{"city": "new-york-city", "title": "Vastly Overpriced Hipster Hangout", "text": "To be fair, I never actually intended to stay here. I was supposed to be booked into their sister hotel the Gild Hall down in the Financial District and my assistant swears that's what she did and the problem was on the Thomspson central booking site. Oh well,. My plane was late, it was raining, my car service didn't show up and I arrived at the Gild Hall 15 minutes before my scheduled meeting and ws told that my reservation was up here. The taxi took 15 minutes and the credit card payment system didn't work so I walked into 60 Thompson with literally no cash in my pocket and late. The aura is typical hipster nouveau trendy with lots of Euro music going on and and so I pretty much knew I would have a small room. At the desk the man said my room was &quot;ready&quot; but not available because it hadn't been inspected. That was because of the late check-out. I said &quot; Huh&quot; I never heard of a check-out as late as that and in any even I was late and they should give me anothert room. They didn't and kept me there about ten minutes while they finally processed me into what on of the front desk people called a really good roomThis is not a really good room It is a standard modern small room with King bed and small couch and chairs and bureau and flat screen. No desk to work at (but if you are a true hipster, I suppose, desks surplusage). The bathroom is nice and there is a large shower and no tub. The WiFi works for $10/day.As I dropped my bag and flew out the door to my meeting, I noticed it seemed warm in the room and so set the thermostat at 68 F. I returned at 9 pm and found the room hot and called down to the desk. They said they would send somebody up to &quot;fix' the thermostat. Instead, they sent a maintainance guy who was carrying a standing fan! I said, no, what I wanted was for somebody to make the air conditioning work and he opened the windows for the time being and went away. When he returned he told me that they had &quot;turned on&quot; the air-conditioning in the hotel - in fact, it had been turned off for the whole hotel because somebody complainted that it was too cold. Huh???? Finally I got some air conditioning. A later call for a wake-up rang unanswered about 20 times before I quit.This is a perfectly adequate $210 hotel. It takes real chutzpah to ring you up for $345", "hotel": "60_thompson", "year": "2009", "date": "2009-05-06"}
