{"city": "new-york-city", "title": "Nice hotel with great staff", "text": "I have stayed in several Kimpton properties, and have enjoyed each one. This one is no exception. I took my daughter here to see some shows, and enjoy NYC for her birthday weekend. This is absolutely the smallest Kimpton hotel room I have stayed in, but for NYC, it was a well-above average room. And we were upgraded to a king sized room. But for the price we paid (in Manhattan!), the value absolutely cannot be beat.The staff is commendable, especially their &quot;do-everything&quot; doorman Santiago. We were very impressed with his service -- actually saw him run down to the end of the block to help a family getting out of a cab and carry their bags back to the hotel. He helped us with restaurant recommendations and directions several times. The reservation had our room rate wrong, and it was promptly fixed by the front desk without the slightest fuss. Since they had the room ready, we were allowed to check in before check-in time, again, no fuss there.The location is great if you want to be a 15 minute walk from the bustling Times Square, but don't want the crowds and hectic nature of that place. It's also only 4 blocks from Grand Central, and less than 10 minute walk from Empire State Building (which we could clearly see out of our room window, an added bonus). Quick bites in the morning (delis for bagels, McDonald's, etc.) are all within 2 blocks.Nice things:1) SOOOO comfortable bed2) Nice flat panel TV3) Wine reception4) Computers at concierge table for guest use.5) Prompt and fast housekeeping (our room was fully serviced by lunchtime)There were a couple of disappointments, all minor1) Bathrooms tiny but quite stylish.2) Windows need better soundproofing3) Room service must get ice (even with ice buckets in rooms).4) Lack of much children's programming on TV (no Nick or Disney!!! Yikes). Might not matter for you depending on your situation. We weren't in the room much, so no big deal.5) Room service menu priced beyond all comprehension (that's OK, I never order it anyway)", "hotel": "70_park_avenue_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-07-20"}
