{"city": "new-york-city", "title": "Would definitely stay here again", "text": "We have just returned from our stay at 6 Columbus and our experience was very different to that of some of the other guests. We booked a Queen room for a reduced rate via the Quikbook website. The Quikbook site clearly stated that the room was for a maximum of 2 people. Upon arrival, it was clear that booking via Quikbook meant that you were given the smallest rooms in the hotel. There was no way that 2 people could stay comfortably in this Queen room.There was only 1 single wardrobe, no natural light, hardly any floor space around the bed and nowhere to store our 2 large suitcases. I spoke to Lula on the front desk and she went out of her way to ensure that we were happy with our accommodation. She showed me 2 other rooms which were much more suitable for couples and managed to offer us a larger Queen room at an extremely reasonable upgrade price. Throughout our stay, Lula made a point of checking that everything was ok with our room. With regards to the rest of the hotel we really couldn't fault it. All of the staff were extremely friendly particularly the doormen. We didn't try the restaurant but we did drink at the bar a few times and they even served sushi to us at the bar. My only gripe would be that the bar area is quite small with limited seating. The room we actually stayed in was a great size. The double wardrobe was more than adequate and there were large drawers under the bed also. The ipod docking station was a nice touch as were the Khiels toiletries in the bathroom and the free daily newspapers. The room temperature control took some getting used to but overall it served it's purpose and the underfloor heating in the bathroom was very welcme after a hard day's sightseeing. The bed was also very comfortable.Housekeeping did a great job at keeping the room immaculate and also turned down the bed every night leaving little treats on the duvet.In addition to the great service and comfortable room, the hotel is in the most amazing location. The Time Warner Centre is literally across the road which houses a large Whole Foods market and lots of nice restaurants. Starbucks is next door and there were several places to get a great breakfast just up the street. Columbus Circle was right on the doorstep including the best entrance to Central Park. Overall we really enjoyed our stay at 6 Columbus and we would definitely stay here again on our next visit to New York.", "hotel": "6_columbus", "year": "2008", "date": "2008-10-23"}
