{"city": "new-york-city", "title": "Great Location Disappointed with Service", "text": "My wife and I booked a room at 60 Thompson to celebrate our one year anniversary. I must first say that we were looking for a place in the heart of the village, and it will be tough to beat the location and atmosphere of 60 Thompson. My main grievance comes with the staff. We had booked a King Deluxe smoking room for the night. We checked in, (they did mention Happy Anniversary) and were shown to our room. The hardwood floors and bathroom were great. We right away noticed it was not a smoking room so I called the front desk to confirm. They relayed to us that in fact it was not a smoking room, but they would send someone up right away with keys to our new room. When we entered the new room, I was shocked. No hard wood floors, tiny bathroom, tiny room. I asked if it was in fact a King Deluxe room and they said they had none of those available in smoking. I was a little disappointed, what happened to the room I had booked, did they give it away? I was told we were moved to a lower level room due to availability. I then mentioned that there must be a rate differance since it was a lower level room, and I was given no cooperation on this and my request for an explanation was denied as they danced around the reason. I had in my hand proof of a guarenteed King Deluxe Smoking room. I ended up paying that rate for a Queen Superior room. Most days I would have let it slide, but on my anniversary, I was dissapointed.As stated before, the location is wonderful and right smack in the middle of the village, close to everything. I have stayed in many hotels in NYC and this was very disappointing in terms of service. Next time I will stay in the Mercer or SoHo Grand. I have stayed in both before, and regret trying out 60 Thompson on such a special night. You may enjoy the roof top bar, it was nice for a drink or tow, bu the heartbeat of the village is down on the street, not in the &quot;members and gusest only&quot; rooftop bar. You may find you check in on a day where the staff is on top of their game, but at those prices, they should be on top of their game everytime, every guest, especially those celebrating special occasions. You will be guarenteed service each and every time at the other two village hotels mentioned above.", "hotel": "60_thompson", "year": "2006", "date": "2006-07-11"}
