{"city": "san-francisco", "title": "Scabbi-Gail Hotel", "text": "We stayed in the Abigail Hotel for 5 nights, we chose it as it was the cheapest we could find and we were on a strict budget!Having read the other reviews we were not expecting The Ritz but it was disappointing. We arrived at 1am, after being up 24hrs travelling from the UK. Our taxi driver told us we were on the outskirts of the 'rough' area, and advised us not to go past our road!The hotel was shabby and dated, there were also lots of down and outs roaming the streets as well! The man on reception was very helpful (and staff were excellent throughout our stay)The lift was small and rickety. Our room was on the top floor facing the nearby Asian Arts museum.I have to say that the hotel would have failed miserably on a Health &amp; Safety inspection (see photos), the windows were cracked, some were nailed shut, others did not shut properly!! The plug sockets were obviously dangerous, with masking tape and dodgy wiring.The bedsheets (although clean) had cigarette burns in them. The bed was clean and comfortable though.Noise wasnt too much of a problem, with either traffic or nearby locals. We both had jetlag so went to bed about 9pm each night and were awake by 5am so sat in bed watching local news reports of nearby shootings!! We were out all day and so only used the hotel as a base.We had been advised at the time of booking that the hotels restaurant was closed for refurbishment, but there was a lovely bar/bistro on the corner by the hotel, which showed films on a monday night, and had a very friendly helpful barman!Be warned that the hotel is near to some very dubious areas, and when walking back from the cinema/shopping centre we took a wrong turning and ended up in some very unsavour streets! The bus stop taking you to the Harbour/Pier 39 etc is just across the road so definitely use this if you are travelling back in the evenings.I have given this hotel a 2 out of 5 as the staff were very good and helpful.", "hotel": "abigail_hotel", "year": "2008", "date": "2008-02-02"}
