{"city": "san-francisco", "title": "Best hotel in san Francisco!", "text": "We stayed at the Argonaut in June 2009 for ten nights. The first week we had a Twin Queen room with a Bay view - it was perfect! We had an amazing view of Alcatraz and although the street can be noisy, it didn't disturb us at all. The room was very comfortable, clean and spacious. The bathroom, although small, was adequate and they even have a list of toiletries you can buy if you've forgotten anything! We were also provided with animal print robes which you can also buy at the end of your stay! The mini bar is well stocked and there are tea/coffee making facilites.For our second week, we stayed in a Deluxe King. The view from this room was nothing special but as it was at the back of the hotel, it was very quiet. Again, the room was perfect and exceptionally clean.The staff at the Argonaut were wonderful! Everyone we met was very friendly and helpful. John the doorman was particularly nice and gave us plenty of tips on places to go and how to get around. Reception staff were helpful and all the bellboys friendly and fun!We ate at the Blue Mermaid once and also ordered room service once. The room service was reasonably priced, delicious and quick to arrive.We attended the wine hour every evening. If you wanted a seat, you had to get there a good half hour before so most evenings we would take our drinks to our room. One night, my partner got id'd during wine hour even though he is 31 - he was not impressed seeing as this happened quite a while into our stay.We loved the nautical theme which was present throughout the hotel. The location of the hotel is perfect! The cablecar turnaround is yards away and plenty other attractions. The hotel is surrounded by good restaurants and some funky bars! Over the road is Ghiradelli Aqua Park which is great if you want to do a bit of swimming or have a quiet moment on the beach.All in all, we had the most amazing time at the Argonat and can't wait to go back!", "hotel": "argonaut_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-09-05"}
