{"city": "san-francisco", "title": "We were well cared for", "text": "My boyfriend and I stayed at the Andrews May 14-17 and highly recommend it to anyone looking for a good value hotel with an ideal location.From the airport, we found the hotel without any issue, even with it being our very first time in San Francisco: We rode the red AirTrain line (SF's airport shuttle) to the BART station (SF's subway system). From there, we rode the Richmond or Pittsburgh-Baypoint bound BART train (about a 15 min ride) to the Powell St. stop and got off. The hotel was just a few blocks away.In addition to being close to BART stations, the hotel is ideally located in SF's theatre district. We were able to walk to all of the places we wanted to see: Chinatown (2 blocks), Nob Hill (about 4 blocks), Fisherman's Wharf(~1 mi), Ghiradelli Square (~.5 mi), museums (~7 blocks). Shopping is just the next block over. The only site that was a trouble to get to was the Golden Gate, which is a good 2 to 2.5 miles away. If you are not at all of fan of walking, take the cable cars. The hotel is right next to the line.The Andrews itself turned out to be everything we had read about in the reviews. We got the best deal on our Corner King room through its website (-------). The room was extremely clean and offered a spacious closet, tv, bathroom with a stall shower (if you want a bath with tub, ask for a Comfy queen room instead), ceiling fan and two large windows for sunlight and a breeze. There was noise in the evenings from the street below (particularly from the parking lot in the back), but that is expected of a city, and the noise was tolerable. I can only recall hearing one firetruck at night during our three-day stay - I didn't feel that they were a grave problem, though perhaps we may have lucked out. The area around the hotel is quite safe and we felt quite comfortable walking out at night. Both the front-desk staff and cleaning staff were extremely friendly and helpful, giving us tips on getting around the city and even fixing our swipe key when it refused to unlock our room door. The morning continental breakfast was substantial and lovely as was the tea/coffee reception in the lobby. In the afternoons, they left out fresh fruit in the hallways. And we did give the FINO restaurant a try - we were thoroughly impressed by its dishes.Overall, I would highly recommend the Andrews Hotel. I loved most the special attention we received, the courteous staff, the hotel's initimate atmosphere, and its history (we got a kick out of the elevator). We were most definitely well cared for and will be back again.", "hotel": "andrews_hotel", "year": "2005", "date": "2005-06-07"}
