{"city": "san-francisco", "title": "Small but comfortable", "text": "This hotel is a little out of the way - about 2 blocks west of Union Square, and maybe 6 from Chinatown. There are a few shops and restaurants nearby, so it's not isolated, just not in the best location for walking. The Italian restaurant in the lobby smelled fantastic and has free wine tastings in the evenings (though we never had the chance to go). There is $25 all-day parking behind the hotel that is manned during the daytime, and if you've got a room in the back, you can at least keep an eye on your car at night. It felt fairly safe and secure. There is also a small night club directly behind the hotel in the parking area, which gets only a little noisy at nights, but not annoyingly so. I actually could not hear the music inside at all from my room -- just the occasional drunk in the parking lot. The rooms got a little stuffy with the windows closed, but they do open (1 in room, 1 in bathroom), which allows for good ventilation. There is a heater, but no A/C or fan. The cont. breakfast is small, but tasty. It is served on a table in the hallways of every floor, so if you run out of something on your floor, you can call the front desk or simply go to the next floor. The staff were very courteous and helpful when I stayed there. The rooms are small. And I mean, small. I don't have the official statistics, but we did some comparison measuring at home and came up with about 120-130'sq including a tiny bathroom. We had a room w/ 1 Queen, which was a big enough bed, and very comfortable, but it was so small we couldn't fit a rollaway (which are available, leading me to believe there are larger rooms available). NOT recommended for families but it would be fantastic for singles or couples who don't mind a decent walk to attractions - at least the walk is interesting. I'd love to stay there again, but I usually go to San Francisco for Chinatown, so we probably wont due to the distance.", "hotel": "andrews_hotel", "year": "2008", "date": "2008-02-16"}
