{"city": "san-francisco", "title": "Affordable and great location in San Fran", "text": "I booked this hotel for my recent 3 night stay in San Fran on the recommendation of my travel agent. I went directly to their website to book and was surprised at the affordable rates they were offering. Also, as I booked more than two nights, I received a further 15% discount, which was great. I also booked an airport pick up and return through their recommended airport shuttle service provider (Lorries)... however you can get cheaper services... so shop around. Even if you pre book a collection, be sure to pick up a brochure or 'What's On' pamphlet in San Fran and they will have heaps of services listed with discount coupons saving you up to $5US per ride. Unfortunately I booked and paid a deposit for the return before realising that there were cheaper shuttle services.The hotel is really central, I walked to Union Square each day, down to Market St (and caught public transport round to Fishermans Wharf) and caught buses and cable cars everywhere else I needed to go and there were stops so close to the hotel. There are a lot of mini marts, internet and restaurants close by (ie two - three shops away).Breakfast is included, but it is only tea and coffee, blueberry and chocolate muffins, and toast / bread with butter and jam. I actually liked the arrangement though because I don't eat breakfast but was able to make a sandwich and take a muffin to eat later on in the day. There is also a coffee dripolater in the room which is handy. One of the staff, a really nice girl by the name of Leila (or similar), was extremely friendly and helpful and gave me all the infromation and directions I needed to go to Petaluma (2 hours bus ride north) to Premium Outlet Shopping. She also advised which areas to stay away from at night as they can be unsafe for single female travellers.The rooms themselves and the corridors and even the reception area have painted murals on the walls and this gives the hotel so much character... it really is charming. I stayed in room 712 and whilst I didn't have a view or anything the room was excellent with a queen size bed and separate bathroom with bath over shower. My TV wasn't runed in though... I suppose I could've called reception to fix it... but I don't watch TV much so it didn't really matter! I would recommend this hotel and the price was really affordable.", "hotel": "adante_hotel", "year": "2009", "date": "2009-03-07"}
