{"city": "san-francisco", "title": "Cheap AND Surprisingly Pleasant Stay In San Francisco", "text": "I loved this hotel. When my boyfriend originally booked this room and told me that he got a hotel room in San Francisco for less than $50 per night during April (one of the best months to visit San Francisco...the other is October), I was weary of his decision making skills. I looked online prior to going just to check out the Adante. From what I saw, people seemed to like it except for the cheesy looking murals on the guestroom walls. We were only going for the weekend, and I thought, &quot;Well, why not?&quot; This hotel is GREAT! It is in a great location. We took the BART to Powell Station, and the hotel is about 1/2 a mile northwest (right down the street from Union Square). From the outside, the physical characteristics of the hotel do not do the service of the staff and the quality of the rooms justice. It really does look historic. However, the lobby is very nice. They have plush sofas inside to sit on and rest, and patio furniture outside so that you can enjoy the hustle &amp; bustle of the city. The service at the front desk is just about the best that I have ever received. The man at the front desk was extremely professional. He gave us maps of the city and made suggestions for us first-time visitors. We arrived early and they even let us use a storage room for our luggage until we checked out.There is a cafe connected to the hotel. It is an Internet cafe so that makes it very convenient. I ordered a cappuccino, however, I would not order another one. They were very nice in there, but the coffee was not anything special. It tasted more like hot water than espresso. Every morning there was a continental breakfast. Not much food, just blueberry muffins, juice and coffee, but hey for $50 a night I wasn't even expecting that. We checked in at 3PM on a Saturday, and we received a room on the 6th floor facing the alley and neighboring buildings. It was not a view worth starring out at, but I thought it was cool and appreciated it because I have never lived in a big city so it kind of gave me the impression of what it would be like to look out your window if you lived in New York City (see attached pictures). There was also chicken wire above the alleyway to keep birds from flying into the rooms as there are no screens on the windows. BE CAREFUL OF FALLING OUT! :-) Very few of the rooms face out over Geary Street. I would say not more than three rooms on each floor so about 18-21 rooms. The ride up to the room in the elevator is quite scary. The elevator is nice inside but it seemed as if it was the original &quot;lift.&quot; It wobbled and creaked as it made its way up the floors.  The room was cozy. NO A/C but this never bothered us. We opened the window, and there was a ceiling fan in the room to generate air circulation. There is a heater in the room which we never needed to use. The weather was beautiful. We had one king bed and a sofa with a pullout. The TV was recessed into the wall so that saved space. There was a small desk w/ Evian Bottled Water (for purchase) and a coffee maker w/ free coffee. The bathroom was surprisingly nice. It had been fully remodeled and kept up to date. The shower was very clean as was the sink and toilet. There was also a large closet in the bathroom that contained hangers, a safe and an ironing board. I believe that the bathroom used to be a guestroom because you could actually enter the bathroom from both the hallway and our room. It was a private bath also (not shared). The murals on the wall were kind of cheesy. It would be more fitting for a room in Puerto Rico (with the birds, fish and pastel colors), but it honestly didn't bother me because I was satisfied with the overall quality of the room and the service.In the elevator, I heard a few conversations regarding noise that people were hearing throughout the night, but I never heard anything. I have stayed in hotels where all you can hear is the party next door or people stomping on the floor above you, but it always seemed quiet to me when we were in the room. There are thousands of beautiful and exquisite hotels in San Francisco from what I saw when I was there. I would gladly stay at the Adante Hotel again. I was extremely pleased with the service and quality. You would never expect it from passing by, but it really was a pleasant stay here. I would recommend it to couples, singles and people enjoying the sites of the city. I probably wouldn't recommend it for families unless you get 2 rooms just because the rooms are a tad bit smaller than your run-of-the-mill Motel 6 (but better quality). The hotel is also right on the Geary Street bus line which runs every 10 minutes during the day. Give it a try. I think you'll agree.", "hotel": "adante_hotel", "year": "2005", "date": "2005-07-12"}
