{"city": "san-francisco", "title": "Liked the Andrews", "text": "My husband and I just returned from a five night stay at the Andrews Hotel in San Francisco and were pleased. When we checked in we were given a king size sunny corner bedroom with two bay windows that faced Post Street. The side windows faced an apartment building. We had two club chairs, fridge and private bathroom with a shower. It was clean and neat and exactly as advertised. Shortly after we dropped our bags in the room there was a knock on the door and a maid appeared with a small vase of flowers. Plus # 1. The next was a note telling the guests of the Andrews that you were welcome to come to the lovely first floor restaurant every night of our stay for a free glass of wine. Plus #2.The refridgerator in the room was stocked with complimentary beverages (non alchoholic), which when used was replaced the next day. Plus #3. And the last nice plus was the lovely continental breakfast that was set out each morning on each floor between 7 and 9:30 AM. You simply went outside, grapped a tray and filled it up with fruit, muffins, coffee and juice. The staff were all pleasant, and in one particular case went over and beyond the cause of helpful, but I'm getting ahead of myself.Every hotel has its issues. Be aware that this is a European style hotel. Built before the 1906 quake, it is well worn, but obviously well cared for. The antique elevator was small. Our bathroom shower was probably two feet by two feet. However, the water was hot and the towels could be replaced as little or often as you asked. They supplied lovely shampoo, etc. and replaced as necessary. I don't believe we received that from a major hotel in Vegas. But again I digress, The second problem stems simply from the hotel's age. It seemed to have very little sound proofing. The curved glass windows are single paned and the walls are thin. We woke up every morning to the daily garbage pick-up and street cleaning. It seemed that every street noise was magnified straight into our room. On our first night in the hotel there was a very loud party coming from either the street or the apartment building next door. I awoke with a start to karakoke voice minicking Elivis singing Neil Diamond. To be fair my husband didn't think the singing was so awful, however we each agreeded it terribly was loud. I called the front desk. The clerk asked which room we were in and then said &quot;hang on a minute&quot;. The phone was placed down and minute later he came back with an apology that there was a loud drunken party going on and that was the last song. Sure enough, the &quot;singing&quot; ended and back to sleep we went. I felt very grateful at that moment. That was the only problem we encountered during our stay, other than the normal city noises.This hotel will appeal to those who prefer a smaller, older, more intimate hotel over the large, sterile, hotel chains that infest the downtowns of most US cities. The Andrews isn't perfect, but has charm, is safe, well located, and is a surprising bargain for the price.", "hotel": "andrews_hotel", "year": "2008", "date": "2008-08-05"}
