{"city": "san-francisco", "title": "OK for students - NOT for families", "text": "We have 3 small children and were looking for a suite in downtown San Francisco, and from the website this hotel looked fine. When we arrived (after getting the bus and a train from the airport to the center of town - very easy and cheap even with 3 kids, a stroller and 2 suitcases), there was a leaflet about the hotel at the Tourist Information Center and it looked great. We walked there (a few blocks, slight hill), and all looked good as we passed a Hilton when we were almost there. All of a sudden the neighborhood started looking really dodgy - adult bookstores, scary characters etc - and there was the Hotel Alexander with a Pakistani restaurant in it. The smell from the restaurant permeated the whole hotel and was especially bad in the elevator. The reception staff was scary (even my husband thought so) and when we got to our suite we were horrified. It was so old and in a very bad state of disrepair. We couldn't even push the stroller in the bedroom it was that small, and the &quot;suite&quot; part meant the smallest room I've ever seen on the other side of the bathroom, with a grotty sofa and TV unit. The electric points were falling off the wall and sparked when we tried to push them back. It was just awful and unsafe - not suitable for young children at all. No cribs either, despite requesting one. That night my husband insisted we got back to the hotel before dark because of the area- and he was right. It was just getting dark when we got there - and I was scared. We slept there that night as we had prepaid on Expedia, but as my husband and I lay there we could feel &quot;things&quot; around our ankles, and I wept as I looked at my kids in the next bed, feeling so bad for making them stay there. We sat and watched various drug-dealer and prostitute types running around the street screaming from the bedroom window in the early hours of the morning. The breakfast was horrid - I would only let the kids eat the cold cereal, nothing else looked sanitary - and I went to brave the front desk. Luckily the man working there was Imran, who was the nicest thing about the whole hotel. He was so kind and helpful, he called Expedia and got us a refund for the remaining nights and let us use the computer to find a better hotel. We ended up staying at the Grosvenor Suites which was great but expensive. We saw lots of other suites which were cheaper and looked great, and not in the bad area. I would recommend staying near Fisherman's Wharf as there is so much to do there - there is hardly anything to do in downtown San Francisco. Plus its really cold!To be fair, Hotel Alexander would be OK for students or those on a budget. The bathroom was surprisingly clean, and I realise that the staff on the front desk have to be that way due to the people wandering round that area at night. The breakfast would be fine for students - they are all are we saw there - we were the only ones with kids - young people with backpacks looked like the only other guests. Also there is a computer for guest use next to front desk.But we won't be going back!", "hotel": "alexander_inn", "year": "2005", "date": "2005-10-16"}
