{"city": "san-francisco", "title": "Horriable Accomodations Good Service Great Location", "text": "My mother and I flew to San Francisco 5/19 for a concert and stayed one night at The Adante Hotel. The hotel definitely needs some work.1) The room accomodations were unsatisfactory. Apon walking into my room I was horrified by the color of the walls, which were a shade of yellow that looked ike someone had urinated on them. There was a hole in the wall that someone had unneatly covered and painted over. The murals on the walls simply show how cheap of a place this hotel is as they did not even purchase framed photographs for their rooms. The bed spread was worn and torn which prompted my mother and I to go out and purchase Lysol, spray down the bed, and sleep with our clothes on. At night, we were both very uncomfortable because the room was freezing and there was not AC control in the room and the door wasn't sealed correctly so light from the hallway pierced our room. Also, the window's lock was broken and a check makeshift lock was installed but one could still open the window from inside or out with the lock on. This made my mother and I feel very unsafe. The good thing is we only stayed one night, slept only 6 hours and checked out of the hotel as soon as we could in the morning.2) The service was decent. Julius the manager accomodated me very well and the desk clerk Tony was also very helpful in letting us know places to go around town. However, when my mother and I needed to store our bags, the clerk gave us a key to a side closet and we had to store our own bags - which means anyone could have had access to our things and easily stolen them.3) The location is good. 4-5 blocks from Union Square. However, when you walk out of the hotel go left not right, as the area borders Tenderloin - a not so friendly place. If asked would I stay at the Adante Hotel again, the answer would be definitely be no. The service and location don't make up for the horriable and disguisting hotel conditions. Even though its inexpensive, next time I'll pay the extra $30 bucks to stay at a nicer hotel.", "hotel": "adante_hotel", "year": "2007", "date": "2007-05-24"}
