{"city": "san-francisco", "title": "beware of the bedbugs", "text": "Today I have returned from a four week trip through the west of the United States. San Francisco was my last stop before travelling home to The Netherlands. I stayed in the Andrews Hotel in Post Street. I choise this hotel because it is only two blocks away from Union Square. The hotel is in a very old building and the rooms are extremely small and the bathroom was tiny. The paint is coming of the walls and the hotel is in desperate need of renovation or maybe even closure. You could hardly move around in the room or in the bath. A typical hostel room in the center of a big city. The staff was friendly enough and there was a glass of complementary wine everyday in the Vino restaurant adjacent to the hotel. The hotel was quite expensive ($139 a night in the weekend and $129 during the week) for the services that they offered and the size of the room, but most hotels in San Francisco are ridiculously overprized. There are many tourists, so they can get away with it. There is a free breakfast that you can take to your room, but it isn't worth getting up for. There is no free internet and that is quite remarkable for any hotels or motel in the USA. I stayed in the Andrews for four nights. The first two nights I slep in room 706. After the first night, I saw two little red bites of my skin. Because I had been to Montery the day before, I thought that they were sandfly bites and didn't react. But after the second night I had a least twenty bites all over my body. A close inspection of the sheets led to the cause. There were crawling with bedbugs. I went down to reception imediately and had the sheets changed and I reported the bedbug situation. They changed me to another room and the last two nights no more bites appeared. The reception informed me that after the sheets were changed, a new inspection was carried out and there was no further cause for alarm. The manager would speak to me next day (Monday) between 11:00 and 12:00 am. I waited in the lobby for his arrival, but he didn't turn up. No reason was given. The next day one hour before my departure for the airport, he did knock on my door. He was very apologetic and told me that he took the bedbug problem very serious. He also informed me that many hotels in San Francisco had a problem with bedbugs. He offered to take one of the four nights of the bill and to have my bagage fumigated. But that would have been helpful a day earlier, but now I had to depart for the airport and had no time left to have my bagage cleaned. So, on getting home from the airport, I washed all my clothes using high temperatures. And I have this itching and am scratching in a least a dozen places. I will have this reminder of my stay in the Andrews for the next couple of weeks. Although this can happen to any hotel, I think I will prevent the Andrews hotel the next time I am in San Francisco. I think I will stay in a more luxurious hotel from no on. After all, I have paid a four star price for a two star accommodation this time and I am regretting my choice. A better hotel will not cost a lot more and the risk of meeting the little pests in your bed is probably lower.", "hotel": "andrews_hotel", "year": "2009", "date": "2009-09-30"}
