{"city": "san-francisco", "title": "Rude A-Hole wouldn't honour my reservation (booked 2 months ahead)", "text": "I arrived on a Thursday night for a 4 night stay. I had reserved a room 2 months in advance.When I arrived the rude a-hole at the desk first tried to tell me that I wasn't even in the system. Then once I showed him the print out that confirmed the reservation, he said that he had no rooms.I asked him what the point of giving him my credit card info and reserving ahead of time was, and he said that I had cancelled my reservation before by telephone.When I told him that I had not cancelled by telephone, he said that I had cancelled by internet. When I asked him why I never received an email confirmation of the cancellation, he told me that it didn't matter. I had cancelled by either telephone or email or something and that another hotel of his down the street would honour my reservation and rates. Then he told me to leave.I went down the street to the other hotel, and the gentleman there said that he didn't even know what I was talking about and that he would not honour my reservation and that he wanted $160 + tax in CASH, with 4 nights upfront. My reserved rate at the original hotel was $115 + tax so I was a little upset.He showed me the room he had and it smelled badly of puke. I told him that there was no way I was paying $160 + tax in cash for a room that smelled like puke. He then said $140 + tax / night in Cash. I told him to [--] and left.I ended up crashing on the floor of my buddies' room for that night.Magically the next day, the original hotel found me a room with 1 King Size instead of 2 Queens. I begrudgingly took it, but make no mistake, these guys are a-holes with no integrity. They will not honour your reservation, no matter how far ahead you book it, if they get a better offer.BEWARE!!!Other than that, the King Size room I got was fine for the price. It would have been even better if I didn't have to deal with a rude [--] at the counter and didn't have to sleep on the floor after spending hours looking for a room the night before.The girl who set me up with a room on the second day seemed nice enough though, but she still wasn't much help.", "hotel": "america_s_best_inn_san_francisco", "year": "2008", "date": "2008-09-02"}
