{"city": "san-francisco", "title": "Perfectly good", "text": "I was very wary after reading the first review below, but the price was tempting, so I booked one night. After I checked in and saw the room, I immediately booked two more nights and then the entire following week; it was that good a value. The person below must have thought they were booking a Marriott... it is not; it is an economy accommodation and a good one at that.The hotel is simple, but very clean and comfortable. Everything is new: the paint, the beds and linen, the carpets, the furniture, the iron and board. It did use to be a hostel, but they've done an excellent job in renovating when they converted into a hotel. The rooms are not terribly large but will comfortably house two guests. They also have a few large suites. They really should hurry up and put up a new name sign on the building; they still have the Globe Hostel sign up.There are the little quirks of a newly-opened place: in some rooms they forgot to refresh the paint inside the bathroom cabinet; but the fixtures are all new and spotless. The window shades are cheap and some are already cracking, but with the thick attractive double curtains - that's not an issue really (they should probably just removed the shades altogether). They should keep the TV remotes in the rooms rather than have to ask for one from the front desk.The location is quite a hike from the touristy places, but bus #12 around the corner will take you there. There are no homeless in the immediate area, and besides the bar downstairs, it's really quiet (ask for a room in the back away from the bar).The front desk people are nice, especially Marvin who seems to always be there.The guests are mostly pleasant middle-class tourists. The neighboring buildings are clean modern lofts and townhouses.Parking is only available a block away, but if you're just staying overnight and will be leaving before 8AM then you can park on the street.Breakfast is lousy, consisting of greasy muffins and coffee. Excellent full breakfasts are available at the restaurant around the corner and at the cool Brain Wash cafe-laundromat across the street. Brain Wash has other great food and live performances for you to enjoy while you do your laundry. Get a $1 coupon from the laundry attendant for use at the cafe.Go on the hotel's website and get a free membership which will allow you to book at a significantly discounted rate. Booking on their website also allows you to cancel up to 24hrs ahead with no charge, unlike Expedia or other websites that impose a cancellation fee.Bottom line: good value for the money for an economy hotel, safe and clean.", "hotel": "americas_best_value_inn_suites_soma", "year": "2007", "date": "2007-10-20"}
