{"city": "san-francisco", "title": "Terrific \"home base\" for San Francisco", "text": "My wife and I visited the Andrews Hotel for three nights as an anniversary getaway, leaving our young child at home. The hotel was a perfect launching off point for our adventures in San Francisco. The &quot;old world&quot; style and charm of the hotel made it a great place for a romantic long weekend. The staff was professional, the room very comfortable despite its modest size, and the location excellent. Having read other TripAdvisor reviews, we booked a &quot;Comfy Queen&quot; and requested an upper-level room if possible. Upon arrival, we were given room 709, back and away from the elevator on the hotel's top floor. It was nicely but simply decorated, with a TV monitor and DVD player in the room. The bed was on the soft side but quite comfortable. There was a small desk and dresser, and a nice leather chair in the corner. If we had wanted to, it would have been a nice quiet spot to spend a little time reading or something.The bathroom was among the more spacious in the hotel, I'm assuming, as others have commented on their tiny size. Ours was actually quite large, with a full bath and shower as well as a separate alcove for toilet, and enough space so both of us could get ready at the same time (although we had to swap space in front of the mirror/sink). The street noise was modest for a hotel in the downtown area of a major city. I slept with ear plugs, as I usually do when I travel, and had slept like a dream. My wife had no problems without her ear plugs, and she is a fairly light sleeper. Continental breakfast will not satisfy those who insist on Americanized breakfast rooms or expect a big meal, but we very much enjoyed the assortment of muffins, croissants, butter and jam, fresh fruit, coffee, and freshly squeezed orange juice. It was nice to have trays set out to carry food back to our room. One nice touch was the captain's chairs folded and waiting in our closet--extra seating on the fly!We enjoyed a complementary glass of wine in Fino, the bar/restaurant in the lobby, one evening. We did not dine there but the food looked and smelled great. We also appreciated having water, tea, and coffee available in the lobby at all times. Location is an easy (although uphill) walk from Union Square, right in the heart of the theater district and near Nob Hill. Convenient to virtually everything, including public transport (cable cars, MUNI, BART station, etc.). The Thai restaurant across the street (Ar Roi) is also quite good, by the way! Though the room would have been cramped if we'd brought our child, we will definitely return to the Andrews Hotel when the two of us are in San Francisco on our own.", "hotel": "andrews_hotel", "year": "2008", "date": "2008-06-04"}
