{"city": "san-francisco", "title": "great value and service", "text": "We stayed at the Andrews Hotel from 12/24 thru 12/30 (6 nites).The Pluses- the room was always clean, the staff from housekeeping to the front desk were superb, the morning continental breakfast on each floor was great. (Assorted pasteries, rolls, coffee, tea, freshly squeezed OJ, fresh fruit- bananas, oranges, apples) As has been mentioned in previous posts Oscar and the front desk staff are great- very patient and genuinely try to please. Great location about 5 minutes to Union Square. We walked to North Beach very easily from this location.The in-hotel restaurant Fino was the best Italian we had while in SF, better than the stuff we tried in North Beach. The servings are huge so don't be afraid to split the plates if you are not in a super hungry mode. We split an appetizer, salad, entree and dessert and we still had too much food. If you are a guest of the Andrews hotel, you also get a free glass of wine with your meal (if served before 6:30pm)Minuses- not many depending on the room your in. The cozy double room is aptly named. The bathroom is really small, about 2.5 feet by 5 feet for the toilet and sink and about 2.5 x 2.5 for the shower. This is not an exaggeration- the rooms vary slightly from floor to floor and our room was located on the 7th floor. If you are a big person you might want to check with the hotel about the bathroom sizes to make sure you can be comfortable with the room. The bedroom portion of the room was cozy but fine. Had a chance to see the rooms with a bathtub, those bathrooms are fine. We faced the rear of the hotel which backs to a parking lot area. The nights were pretty quiet except for the occasional fire or police siren.Conclusion- can't beat the price (About $83 per nite with taxes), staff (Oscar is the man!) the in-hotel restaurant (Fino, Fino, Fino)and the location (a hop, skip and a jump to Union Square and Chinatown and beyond)Will be back for sure! Will be adding photos soon!", "hotel": "andrews_hotel", "year": "2006", "date": "2006-01-03"}
