{"city": "san-francisco", "title": "Good Budget Hotel", "text": "Having stayed at alot of budget hotels, I can honestly tell you about the good, the bad, and the ugly. Adante Hotel definitely falls into &quot;the good&quot; catagory. Once again, this is a budget hotel.....so if you're looking for luxury, this is not for you. But if you're going to be out sightseeing all day (like me) and stop by the room every now and then, and want a good place to crash at nite, then this is the place for you. I was pleasantly surprised when I arrived at the hotel. Check-in was a breeze. The front desk clerk was friendly and very helpful. The room itself was spotless, although somewhat small....ok for 1 or 2 people, but that's it. I liked the funky paintjob. The bed was very comfortable and the bathroom was exceptionally clean...looked brand new. The room also included a large closet with ironing board and iron. Internet acess was provided as well as coffee pot with selection of coffee/teas. Bottled water was provided at extra charge and was clearly labled as such. Cable TV also provided. No AC, but there was a large ceiling fan that did the job. Continental breakfast was included from 7-9am at no extra charge. There is an elevator, but it is somewhat slow. My only complaints....bathroom towels were kinda cheap, maid service will knock on your door at 8am...loudly... if you don't hang the &quot;do not disturb&quot; sign on the door, and the view from my room was that of a brick wall. So except for these few minor things, I would definitely stay at the Adante again. A couple of extra notes....Adante Hotel is in the Union Square &quot;area,&quot; not on Union Square. In fact, it's quite a bit of an uphill walk from Union Square and the Bart/Muni public transport stations. This can be kinda annoying if you've been walking around the city all day. There is a bus stop right in front of the hotel, so you may want to take that instead of walking. The cool thing is that the Powell street cable car line is very close. And yes, the neighborhood has it's share of crack [--] and street people. But if you're used to large city life, you won't care. When I was there, these people mainly kept to themselves. I'ts not nearly as bad as you might think by reading some other people's reviews. So, all in all, Adante Hotel is a good place to stay for the budget sightseer or student traveller. I would go back again.", "hotel": "adante_hotel", "year": "2006", "date": "2006-06-29"}
