{"city": "san-francisco", "title": "Convenient Great Staff but the area...?", "text": "I've stayed in San Francisco at least a dozen times in the last 25 years. This time I had to attend a conference at Contra Contra College in San Pablo, a suburb just North of Berkeley that is not easily accessible to public transit. So I chose to rent a car and, having read the positive reviews of this property, I booked it for two nights.I tend to agree with nearly everything the previous reviewers have said. The staff are extremely helpful and friendly, the bed is extremely comfortable, and the room is more &quot;upscale&quot; than one would expect just looking at the property. When I checked into my room, the safe was locked shut. The kind gentleman who had checked me in a few minutes earlier arrived within seconds with his toolkit and in a few moments , opened the safe. I also found that the sink stopper in the modern bathroom was missing meaning that it was impossible to keep the basin filled with water. That wasn't a problem for me, but I informed the front desk about it for future guests. And the &quot;makeup mirror&quot; was missing a screw to hold it in postion so it would be virtually usless. As for the shower/jaccuzi, the jaccuzi was nice, but the shower &quot;massage&quot; felt like a dentist's gum treatment particularly since the lower two &quot;massage&quot; nozzles were inoperative. Overall, the room was quite nice, and I've posted photos of it so you can judge for yourself. Now as for the area...I've stayed in this area several times before, down the block at the former &quot;Atherton Hotel&quot; which is now a youth hostel. It is a short walk to both Union Square, the Civic Center station of the Muni/Bart and Van Ness Ave where you can connect with virtually any streetcar/bus to any area of the city. So as for convenience to transportation, it is fantastic. The area is also near the theaters and Opera House and Concert Hall. But I honestly have to say that I have never ever seen so many homeless people particularly homeless youth in any of my previous stays in San Francisco. Have you seen the movie &quot;The Pursuit of Happyness?&quot; Do you remember the line of homeless trying to spend the night in the shelter. Well, that is exactly what staying in this neighborhood is like. Yet, at no time did I feel afraid for there was no reason to. Yes, young gang members hang out in this area. Yes, there are numerous &quot;ladies of the evening&quot; who walk in the area. Unfortunately, I did see several autos who had parked on the street (NOT in the motel's lot) with their windows' smashed. So if you do stay here, make sure you park in the motel's lot! My room was on the ground floor with a window on Ellis and I didn't appreciate the knocking on the window at 2am and 4am by locals who I learned mistakenly thought the previous occupant of the room was still checked in.Oh, and one more thing. That jacuzzi... it may be relaxing, but it's NOISY. That's not a problem when you are in it, but if your next door neighbor or your upstairs neighbor decides to use it at 1am, you may get a rude awakening.To sum up... Nice motel though the owners seem over their heads in upkeep, very helpful staff, decent breakfast. My only concern is the area. If you are comfortable with &quot;tough hoods&quot; you'll be fine here. (Think 1980's NY Times Square). But if you are a church going family from the Midwest or Plains states, I'd suggest one of the comparably prices hotels near Union Square (The Beresford, Beresford Arms, Chancellor, and Cartright come to mind). Or you might consider a motel near Fisherman's Wharf or even the Seal Rock Inn.", "hotel": "alexis_park_san_francisco", "year": "2007", "date": "2007-08-19"}
