{"city": "san-francisco", "title": "even the fleas have fled", "text": "We left booking a hotel until the last minute, which gave us few options. On walking up to the Abigail we were a little put off by the ideal location - ideal for the Pride festival being right in the middle of the Civic Center, but every street was awash with litter and debris and winos and other homeless slept in the alleys and doorways near the hotel.The entrance door is flanked by a large early art deco stained glass leadlight that is broken and held together with duct tape - very classy. The entrance foyer is carpeted in a dark red carpet with holes and worn patches. Everything appears to have a coat of paint for each year of operation, some of it flaked off in patches, but just painted over again. Lead poisoning here we come.The first flight of stairs is dangerous - very steep with small width steps, but the warning sign to hold on to the stair rail is at the top of the stairs, and the stair railing is coming away from the wall - a good tug, or the weight of a body grabbing it in a fall will send you crashing down about 15 feet to the floor below.The old-style elevator has no handle on the concertina grill door - meaning you squash your hand if you don't remove it quickly enough.Each floor is the same as the last - with flaking paint and other debris littering the carpet, and evicted residents' belongings and broken appliances left in the hallways.The smoke alarm was broken in our room, as was one of the sash windows - crashing down after I opened it - lucky my head wasn't in the open space - not that there is a view - it looks into an alleyway each side, in which the bag ladies and bagmen sleep in all their stench and glory. There was also no floor plan map on the back of the door to explain where the fire exits where in the case of an emergency.We noticed the certificate for the saftey of the elevator expired in June 2005, a point we took up with the State department responsible even though the duty manager (who gave his names as Andy, Andy Patel, and Andy Suchek) lied many times to us about how they did have a valid certificate at the office and it was being faxed for us to see. We never did get to see it. The fire hose certificate on floor 4 was also expired, but at least the fire extinguisher certificate was current by six months.The bathroom was ventilated with a sash window painted over (and over) opening into a shaft that smelled as if a pigeon had lain deceased at the bottom for some months. No shelf to put your shampoo or makeup on either. When we arrived late in the day, there were no towels other than an old handtowel. When we finally received the full quota of bath linen two days later they were so small and threadbare. A towel when held vertically stretched from the floor to just above the knees - I am 5' 10&quot;.The bed was a king size which would have been lovely except that it left little room in the room for the other furniture - we banged our shins many times getting around the bed. It was made up with white poly/cotton sheets - for a double bed, judging by the amount on each side they were too short. We had to show the Indian maid how to make up the bed with the sheets going north/south instead of east/west. She was right to make the beds east/west though as that was the only way the sheets fitted!!!The blanket had as many holes in it as we stayed nights (six) and the quilted cover had cigarette burns in it, as did the side table.The armchair was covered with a slip cover that was long in need of a good wash - especially as it was splattered with dried blood down one side! Hepatitus B and C here we come!The room carpet was worn and very stained, even more so when at three one morning we awoke to the sound of running water only to find the light fitting above the door was gushing water from the floor above. The carpet remained soggy for the remainder of our stay, even though we were assured they had a wet/dry vacuum cleaner to deal with it.It looks like every problem is fixed by a near-sighted home-handyman - the type that smears plaster over cracks and holes but doesn't sand it smooth before applying liberal coats of paint. This was evident in three large cracks around the ceiling fan, the bedroom wall light switch, the bathroom sink wall mounts, and numerous holes and such patched on each floor in the stairwell.A small bar fridge and microwave was in the room as well as a very large television. Of the 80 or so channels it recieved only two were clear enough to view. The microwave was placed precariously on top of the bar fridge which was too low down on the floor to be comfortably used and the fridge was too large to fit in the aperture for it in the enormous wall unit housing the huge tv. We moved the microwave to atop the large desk taking up an entire corner of the room.The telephone did not work at all, we complained twice and when it was finally fixed, it did not accept 1-800 numbers - we had to make those from a payphone downstairs - a bit difficult to ring up the 1-800 numbers for an alternative hotel. There was also no schedule of charges in the room for such things as stealing the towels or making toll calls.We stayed the length of our stay (six nights) because we had no other place to stay, and accomodation was at a premium due to the Pride festival. We can't say it was clean - as it wasn't. We can't say it was comfortable, as it wasn't when we had to chase bed sheets around all night, and worried over how the huge cracks in the celing surrounding the celing fan mount got there...It certainly wasn't quiet. The smell of the dehydrating pigeon and the years of &quot;residents&quot; in the room meant we kept the one operating window wide open, but it let in the noise of sirens and homeless derelicts fighting in the alley below.Luckily we were usually exhausted from our daily excursions and slept fairly well.With the right owners, managers and staff this could be a boutique hotel commanding more moderate prices, but the cheap cost-cutting and building violations going on in the name of saving a few bucks on maintenance have left this place a death trap.The City and County of San Francisco acted quickly sending a building inspector around on Tuesday (we complained Monday) and he rang me in LA to say they had violated many areas of the building code and were issued with an infringement notice. Hopefully the State Dept responsible for the safety cert for the elevator will act accordingly also.The only good thing about the hotel was it's central location th BART, MUNI, and the Pride Festival. Certainly not worth the fifty dollars nightly we paid to sleep in a death trap, but worth fifty a night once they clean up their act.feel free to email for photos too large to post on site. rosebush40@yahoo.co.nzBruce GrovesRose Bush Entertainments(--)", "hotel": "abigail_hotel", "year": "2006", "date": "2006-06-29"}
