{"city": "san-francisco", "title": "Fantastic stay at the Hotel Argonaut!", "text": "After weighing up boutique hotels downtown with high parking costs vs staying at the Argonaut. w decided on it for three nights-booked by phone and did the parking, breakfast, cable car ticket package. It was a bit of a splurge for us, but worth every penny! This place was so charming and enjoyable. From the minute we met Steve, the valet, we knew it was going to be a good experience! All the staff seemed really well chosen and went out of their way to help, but Steve really made it special! Our room was lovely! We loved the nautical theme and attention to detail - alot of thought has gone into the restoration of this old cannery building and the decorating. So clean and well maintained! Starbucks coffee and Aveda toiletries and a well stocked mini bar (right down to telescopes for the kids!) with prices we thought weren't too bad at all. We were lucky to have a window with a view to the lovely colors and liveliness of the courtyard and even had a bit of a city view with the Transamerica building right there. Yes, there was music playing throughout the day, but if you shut your windows you heard nothing. We did have a noisy baby crying for awhile the first night and it was pretty loud, but it stopped, which was the important thing! Not too keen on the large dogs trotting about with their owners, we must say, and I do suffer from allergies, but we had asked for a non pet room and I was fine.  The breakfast was excellent....one entree, juice coffee came with our package. We also dined in the restaurant and had a few drinks one evening....all good. I must say though that if they opened the room up without that double row of tables in the middle it would be better. If you end up on the non-bar side, it lacks ambience. Super location. Helpful staff - they had stamps to sell and mailed the postcards for me. A tip from the concierge to get over the the City Wide Tours around the corner for around ten-ish enabled us to score some Alcatraz tickets (with the purchase of their tours of course) - which was great, as they were sold out for the next few days.It was for a late run out to the island which limited your time there, but it worked. The tours with these open double decker buses were great. We did the City tour, the park tour and the run to Sausalito and then we took the ferry back. The wine hour they lay on daily was very generous and we had fun getting to know other guests. Yes, there were lots of families and kids and we were a couple, but there were others like us too and everyone was very happy to be there, you could tell.We would highly recomment the Hotel Argonaut!", "hotel": "argonaut_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-09-02"}
