{"city": "san-francisco", "title": "Awesome Hotel- Clean+Comfortable!", "text": "We stayed at the Argonaut Hotel from July 10th-17th, 2009. There were four of us. Overall it was an excellent hotel, and I have very little negative things to say about it.Rooms: The rooms were great! Very comfortable beds, and a nicely sized. For a family of four, it was a perfect room. Five people would have been a bit snug. The bathrooms were very clean, which is important to us. The room had a minibar with snacks ( which were quite expensive....$4 for a bottle of water). The nautical themed room was very nicely designed. There was even an ipod dock for me to charge and listen to my ipod! Location: The location is great, right on the wharf with LOTS of resturaunts and places to shop. The Blue Mermaid that is inside the hotel is AWESOME! I suggest their crab and corn choweder, and their Cioppiono ( I probably spelled that wrong ..but its kind of like a seafood stew with tomatoe sauce and wine). Across the street from the Argonaut, there is a resturaunt called Cioppiono's ...and my mom ordered cioppiono there and it was aweful!! Get it at the blue mermaid!! My other favourite resturaunts while I was there were : The San Franciscian and Joes Crab Shack ( if you dont like being in a loud setting..I wouldn't reccomend this ). The location is also right near bus stops and streetcar stops which can take you anywhere. Oh yeah- this hotel is also right beside a Ben + Jerrys ( for ice cream lovers :) )Tip for shopping: They have many stores that sell tshirts 3/10$ or 5/10$...the further away you walk from the hotel...the better deals you get. Service: Everyone was very helpful and nice! They would try everything for you to have a pleasant stay. The maids were very nice and always made sure you had everything you needed.** Every day at five pm the managers would give out/sample free wine for those staying at the hotel, and non alcoholic punches for kids. The negative: Walls were thin, and you could occasionally hear people in the next room having a conversation. Also, it was very loud as it is right on a busy tourist street...every day we heard a tour guide on a bus say &quot;..Rice-A-Roni...the San Francisco Treat!!&quot;..as well as the loud buses and cars. The way we fixed this problem was that we brought a noisemaker ( one of those small noisemakers you can buy for $20 at the pharmacy that make sounds of waves, thunderstorms, white noise, etc ..) and that helped ALOT to block out the noise when we slept.** Note: My mother is quite picky when it comes to staying at hotels. She always has some complaint about them but she LOVED this one! I didn't hear any complaints from her. The noise is really our only complaint- but as I said...we blocked it out at night with our noise machine.", "hotel": "argonaut_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-08-11"}
