{"city": "san-francisco", "title": "great little hotel for cheap price", "text": "I looked at several hotels while booking my trip to the San Francisco area, and for the price and the location you can't beat the Adante, formerly the known as Hotel Nuvo. I had read other reviews of this hotel about complaints with homeless people, but like any other city, the homeless are there and did not bother me. be kind and at least say hello to them. They won't bite, but rather appreciate the camaraderie.The room I had requested was to be away from street noise and away from the elevator. While I did get a room on the 4th floor away from street noise, I was only a few steps away from the elevator. The rooms were quiet, comfy, clean, and spacious. It is equipped with a couch that doubles as a fold away, 2 night stands, desk, and complimentary in room tea and coffee. TV and phone are obviously included as well, along with extra pillows if needed.The bathroom is equally spacious, with an abundance of towels and amenities including hair dryer, and a closet with a security safe, iron and ironing board. The bed was comfy enough, although I did wake up a few times the first night due to my boisterous neighbors, which was no fault of the hotels.Altthough the entire hotel is non smoking, there is a slight lingering smell of smoke in the hallways. The staff could manage to also check the blankets for wear and tear as there was a patch and hole in the one I had. The continental breakfast was a bit dissapointing as there was none before 7a.m. The juice machine is shut off before this time as well. Another reason why I had booked here was for the continental breakfast. On the second day I did manage to catch a glimpse of their breakfast which was store bought pastries and white toast. On the third day I did not even bother with breakfast as it was already gone, but the juice machine was shut off and it was only around 10am. You are better off wandering the SF area on your own to find a place to eat which there are more than plenty and better than stick around for breakfast here. Besides, you get to experience the city this was as well. Overall I would come book here again.", "hotel": "adante_hotel", "year": "2008", "date": "2008-02-27"}
