{"city": "san-francisco", "title": "Very nice motel experience indifferent area....", "text": "We stayed at the Comfort Inn for 6 nights when we visited San Francisco as part of our round the world trip.As we were on a budget due to the length of our trip overall, we opted for a decent rate of $71 per night. It did go up to over $100 at weekends, but even so judging by a lot of the hotel prices in San Francisco this was a very good deal.We arrived into San Francisco on the BART system. The hotel is about a 10minute walk from the Civic Center stop, although we managed to get a bus up to the property. First impressions were good, we were expecting a motel type property and upon check in the young guy on the front desk was very helpful. We were able to check in despite it being an hour before the room should have been available.When we entered the room we were totally gobsmacked. The room was as good (and as big) as many of the top end hotel chains. Upon talking to the owner (who is a top guy) we found out that all the rooms were refurbished when they took over the running of the hotel. There was a gorgeous king bed (think Sheraton sleeper bed), a huge TV unit/chest of drawers and a very clean bathroom area. The shower also had the massage option where the water comes out of the panel and relaxes your whole body...a nice touch. There was ample space for bags, and a table and chairs which we later found out would be our breakfast table. All in all it was a fantastic room, up there with the best we have experienced in the USA.To the breakfast. It is included in the price (very rare in the US) and is a help yourself service in the main reception. Now this room isn't very big, so if there are lots of people going for breakfast at the same time I would think it could be a bit of a nightmare but as we were always late up, we tended to miss the rush. I would therefore aim for a 9.15 onwards breakfast, great if you are on holiday, maybe not so if you are in SF on business. The breakfast consisted of waffle mix (with a waffle maker available), muffins, cereal bars, cereal and orange juice. You could then use your tray from the room to take the breakfast back and enjoy your breakfast in the bedroom. I know this might not sound like everybody's cup of tea, but it suited us just fine.One word on parking, although it didn't affect us. There is parking available, free of charge, which for San Francisco is amazing value. I gather it is on a first come basis, but there seemed a fair few spaces but I guess it could fill up quite easy at busy periods. Another nice touch though.Now the area, and the only thing the propery falls down on. Having spent 5 months on a round the world trip visiting places like China, Cambodia, Vietnam and Africa we were pretty used to the odd dodgy area. In fairness this probably helped us when we stayed at this hotel, it's not in the best part of San Francisco by any means. You are just about within the Tenderloin area, a notorious few blocks just north of Market where there are plenty of homeless. Now I can honestly say we were never bothered by anyone, but on some occasions we did put our feet down a little so as to get past a few shady characters. We tended to find if you walked up to Geary and then towards downtown you avoided the worst. O'Farrell and a few of the streets below tended to have large concentrations of people hanging around. It's probably like that in most major cities, but since visiting SF in 2004 we noticed a signifcant increase in the homeless which is not good. I would still recommend staying near this area of SF though, it's away from the touristy Fishermans Wharf (still go there though) and near Market with all the shopping, the theatre district and also on a number of bus routes and of course the tram. We tended to walk up to California and get the tram down to the Embarcadero, great value on your 1, 3 or 5 day pass, especially as each tram ride is $5 anyway.To sum up, we really enjoyed our return to San Francisco for our 2nd visit. On a budget we managed to find a great hotel, with fantastic staff, albeit in a slightly dodgy area. The transportation links around the hotel make it a worthwhile visit and for the price I doubt you will get a room as good as that anywhere in San Francisco.", "hotel": "alexis_park_san_francisco", "year": "2006", "date": "2006-12-04"}
