{"city": "san-francisco", "title": "Good value but don't expect the Ritz", "text": "The Adante Hotel was fine for my needs. I basically just needed a place to sleep after being out all day sightseeing. If you are looking for a resort or extras then the Adante is not for you. The people who have written reviews here saying &quot;There was no fitness center!&quot; or &quot;There was no bar!&quot; have only themselves to blame. Nowhere on the Adante website or any other website where you can book a room there does it say it has these things. If you want those things then stay somewhere else! Yes, there are homeless people in the neighborhood, but guess what - they are also outside 5 star $500 a night hotels right down the street. It's a big city, there are homeless people, deal with it or take a vacation in the mountains in the middle of nowhere, where instead of a homeless person asking you for change, a bear will ask you to get in its belly.People should also not complain about the free breakfast. It was FREE, if you don't like it go spend actual money in a restaurant on it, don't forget the tip. The breakfast was fine. I had buttered toast that you make yourself so its nice and hot. Plus I had all the orange juice I could drink. They also have coffee, tea, and muffins.Another complaint people had in reviews: the rooms have no A/C. Well guess what? Most hotels, and even homes, in San Francisco don't have A/C. It never gets hot enough for it. You can open your window in your room and there is also a ceiling fan. If you are out sightseeing during the day you won't even be there at the warmest part of the day. At night it gets very cool on San Francisco. My window faced a wall, no big deal, I didn't book the hotel for a view. Since I was on the side I heard no street noise even with my window wide open, except for sirens, which you could probably hear even with your windows shut. The bathroom was very big, almost as big as the room, and very nice. I was on a floor with an ice machine so that was never a problem. I liked the painted murals. There is free high speed internet access in the rooms, and also an internet cafe connected to the hotel.The hotel is only a few blocks from Union Square - the heart of San Francisco and access point for cable cars, Bart, MUNI, etc. There is also a bus that stops right in front of the hotel, the #38 bus, that will take you to Ocean Beach. That is the wide, sandy beach they have there. Some advice for public transportation: Buy a MUNI Passport. Only $24 for 7 days of unlimited cable car, street car, and bus rides. Quite worth it since cable car rides alone are $5 each way. Overall the Adante is a good value for your money, putting you near the heart of San Francisco while not breaking your budget.", "hotel": "adante_hotel", "year": "2008", "date": "2008-06-12"}
