{"city": "san-francisco", "title": "This place nearly DESTROYED what should have been a very nice trip.", "text": "We had previously stayed at the Alexis Park Hotel and had a good time. It was in an admittedly dicey area of town but I am not one to be put off by a few homeless junkies. I requested one room and wanted that one room ONLY because it is a little more privately located, has upgraded features and a window that looks out onto the street. I would not stay in any other room in this hotel. When I made the reservation months before our travel date I was assured that I would be guarenteed that room. Well you can probably guess where this story is going. When I called to verify our reservation on the date we expected to check in I was told...oh your room has been given to somebody else but we will give you comprable accomodations. We arrived at the hotel late the first night of our stay, exhausted from our travel, and were given a filthy room, urine in the toilet, floor sticky, carpet stinky,and so dirty we had to keep our shoes on to walk around. It was beyond gross. It was very late at night and we decided to just pull the bedcover off the bed and try to sleep for a while touching as few surfaces as possible. I wish now I would have taken photos but we just wanted to get out of there and photos would not communicate the smell and sickening miasma that hovered in the place.The staff was uninterested in our discomfort with the conditions in the room. The room they gave us was in no way like the room we had reserved. They took the attitude that if we did not like it we could leave. We were very happy to do so. We did note that theTripAdvisor ratingsfor this place had plummeted since we had first visited a year ago and mentioned it to the 'owner/manager'. His reponse was to shout obscenities at us in broken English as we walked out of the office and down through the parking lot to our car. It took us about an hour to find a nice place to stay for the next two nights, no big deal, but the change in plans added an unwelcome layer of stress and frustration to our holiday. Please do yourself a favor and steer clear of these scumbags and their seedy site.", "hotel": "alexis_park_san_francisco", "year": "2009", "date": "2009-09-22"}
