{"city": "san-francisco", "title": "Avoid try somewhere else", "text": "in a word....AVOID.I am staying here for 5 nights paying almost 800 bucks for a king spa suite. Well day on after a 17 hour flight i look at the depressing reception hoping things are better upstairs well i was wrong. Given my room card, not told where to go, where the lift is or where the room is. Get to my room, its hot stuffy and smells funky, check the bathroom, no spa bath as advertised. Crappy TV, no wireless internet even though it was advertised and i asked the guy on the desk and he said it worked. SO i go down to see why the Internet wasn't working and was told it is and the guy shrugged his shoulder, then i ask about the bath and he said 'yeah so what do you want me to do' . Tired as I go back to my room, play with computer still no Internet, go down and tell the guy that i will be looking for another hotel.Left for about 3 hours come back and the guy says he has to apologise and offers me the room above, he says it has a bath, still no Internet. It does have a better TV, he also says he can call in a technician for the Internet but they wont be here tilll Monday. I accept, there is a big conference in town, no rooms available, (i booked this room ages ago).Anyway get to new room, 30 mins later the cable TV turns off, the guy downstairs said it has been playing up, they are waiting for the repair guy. The bath doesn't have spa, its just a little bath. Pillows are terrible, no air con. Very noisy from road and nightclub downstairs. Coffee machine in room has cups that are two big to go in, so first time i used it boiling coffee everywhere. The kitchenette doesn't have any plates or cutlery. The halls look like something out of the shining. The young ladies who clean the rooms are friendly, the desk guy not very helpful. The tea and coffee station doesn't get refreshed daily. Also found blood on the bedspread. The room is a good size though and the bed was OK, but did have to remake it each day cos the cover over the mattress is always creased. Oh yeah, one night got in at 4am and the door downstairs was open, noone on the desk, so anyone can get in and to the door to your room without a challenge. How safe is that!!!!Please note I am easily pleased, don't stay in posh hotels and don't feel value should equal crap.", "hotel": "americas_best_value_inn_suites_soma", "year": "2009", "date": "2009-10-26"}
