{"city": "san-francisco", "title": "Good value and service", "text": "My 3-day stay at the Andrews Hotel was a pleasant one overall; I was satisfied with the clean, comfortable room (a &quot;cozy double&quot;) and generally good service. I booked the room directly with the hotel, getting them to match the rate of $79 for weeknights, $99 for weekends, that was quoted by several web booking sites. Note that if you use the hotel's own web site or call the hotel to ask about rates, you're likely to be quoted something higher, so you need to do price-checking on your own and ask them to match the best rate.My room was quite small, as expected, but everything worked well and was clean. The only thing that bothered me a bit was the stained cushions on both the armchair and desk chair. The tiny TV got somewhat inadequate reception of the limited channels available. The room faced east, along the side of the building, so was quieter than front-facing rooms, but there are still bound to be city noises like sirens at times, so it's best to have earplugs on hand. I appreciated the ceiling fan and the two windows in the room, which provided excellent ventilation. The room size was perfectly fine for me, but I think a couple would feel quite cramped in a cozy double room.The Andrews is a small hotel, so there's only one person at a time staffing the front desk. Be prepared to wait if they're already helping someone else. I found almost all the staff to be helpful and professional (esp. Oscar), but the nameless guy on duty when I checked out seemed indifferent to the point of rudeness (he had a friend waiting outside, so seemed to resent having to work). I had to point out to him an error in my bill, and he grudgingly corrected it. It left a somewhat negative impression on what had been a very pleasant stay.Things I especially liked about the Andrews: free breakfast served outside my door each morning; plentiful, high quality, convenient. Things I didn't like: cost of local phone calls; cost of high-speed Internet access.", "hotel": "andrews_hotel", "year": "2006", "date": "2006-03-31"}
