{"city": "san-francisco", "title": "Cheap noisy bad TV ", "text": "I stayed here in 6/06 in a street-facing room, 4th floor. The room was noisy: a Fire Dept. not far down the street, sends engines driving with loud horns 24/7, just below the non-insulated window. There's no real view anyway, so stick to a back room.The TVs have no remote. When I asked for one, I got the run-around (&quot;come tomorrow&quot;, &quot;talk to the manager&quot;, ...) and finally after almost a week the clerk let out the truth: some guests stole some remotes sometime ago, and the manager simply decided to confiscate all remotes from all rooms indefinitely, no exceptions - unbeleivable! The TV itself has only a fw channels with very bad reception. My TV cable was not even plugged properly into the TV until I asked it to be fixed, but the reception, although improved, was horrible even then. You get to see snowy CNN, HBO, Encore, USA and a few local stations.The bath had an old-fashioned tub-on-legs and a sink, both without plugs, so I could only shower, not bathe. The tub had a plastic curtain that I needed to pull around the tub if I didn't want a flood. The 3 towels were all relatively small. I asked the chaimbermaid for a large one, but they don't have any. Oh, and don't forget to bring your own shampoo and drinking glasses/mugs (you get a few clear-plastic cups). The toilet leaked for a while, but that was quickly fixed.The maid cleans, vacuums and tucks-in the bed daily, but linens are not replaced.The living room size was medium, and contained a bed, table+2, small dresser, mini-fridge and small wall closet. Most of the guests were International students in their 20s.The elevator is one of the old kinds, with a folding metal mesh that you need to pull aside to enter and it slams right back on you if you're not careful.There's free wireless access, but reception degrades the farther you get from the lobby. At my 4th floor room, reception quality was low. But there are places to sit in the lobby if you wish to surf, and many do so.Location is 3.5 blocks from Union Square, but in a run-down environment which is unpleasant at night, next to the notorious Tenderloin district. The only reason I give this place a rating of two is it's relatively low price for a location so close to Union Square. Personally, I won't stay here again, and would only recommend it to students on a tight budget.I guess you get what you pay for...", "hotel": "ansonia_abby_hotel", "year": "2006", "date": "2006-06-22"}
