{"city": "san-francisco", "title": "Good location but cramped and unclean", "text": "We stayed in the Adante for two nights when we arrived in SF and again for one night the following week before we left. The hotel is ideally situated only a short walk from Union Square and the front desk staff were helpful. We were allowed to check-in early and were even on our first visit given a larger room (501) than we had booked. The following week we had a normal 2-double room (604) and honestly it was the smallest room we have ever stayed in. We could barely fit our luggage in with the stroller and porta-cot! The first thing you notice when you enter this hotel is that it is old and very cramped. It is impossible to get more than two people with luggage into the elevator and the stairs are very narrow. We made the mistake of returning to the hotel one afternoon around 5pm when a busload of people had arrived to check-in. There was a queue for the elevator for 15 minutes, which was a little annoying.The room we first stayed in, despite being larger than normal (but still small except for the large bathroom), was very unclean. The floor was sticky and we felt dirty if we did not wear shoes. Even worse our 1 year old was crawling around on it - yuk. As for safety with a child: it was lacking. We were on the fifth floor and if we did not close the window our kids could have just fallen straight out to the ground below as there were no flyscreens. The TV did not receive very many channels and on neither occasion we stayed did the promised free wireless internet work. The front desk provided a cable to use the ADSL connection but it did not work either. Unfortunately also the breakfast was served in the lobby due to construction work, making it a cramped experience also and really there was not much food on offer other than a muffin or toast. All up though, the price was decent and in any city in the world you get what you pay for at the budget end of the market - it just surprised us how poor this place was in relation to its description and photos on its website.", "hotel": "adante_hotel", "year": "2009", "date": "2009-10-25"}
