{"city": "san-francisco", "title": "Good cost performance", "text": "A last minute booking. Stayed Saturday &amp; Sunday night. Couldn't find very much reasonably priced on the net. Everything seemed overly exorbitant, and anything in the lower price bracket (prefer to save my money for shopping) showed up as no vacancy on the many hotel booking services I tried. Consequently I rang the hotel (always to be recommended) to find they had one vacancy. $119 for Saturday night, $109 for Sunday, for a small room with a double bed. I found the room small but clean, and as it was on the 4th floor, and near the rear, minimal noise, except for the pigeons (but they too sleep). Breakfast was just outside the door. It starts at 7, so I'd advise gettimg out earlier, grabbing the good pastries (really liked the one with the apple filling), and relaxing in bed with the above, over the squeezed orange juice and coffee. The first day, the juice was all gone, so I called the front for a refill (0.5litre jug is placed on the self serve trolley in the hall outside the rooms on each floor). I also asked for more pastries, but told there were on more, and was advised to check other floors - hence my recommendation to get up early.The free wine is between 5 and 6:30 in the neighbouring FINO restaurant. The food smells good, but I cancelled my booking after showing up 5 minutes late for the wine, and being refused, even though I had given a healthy tip the previous day. It's another story, I suppose, and I was late. Two guys in the restaurant were very helpful on the first day. The guy who refused the wine on the second day should perhaps quit working in the hospitality industry. Of course, this probably has nothing to do with the hotel per se.Anyway, good value, great location, friendly people, so I&quot;m going back again for a longer stay next week - seems like a bargain - a queen size for $99 per night. Stay tuned for the next instalment.", "hotel": "andrews_hotel", "year": "2007", "date": "2007-08-13"}
