{"city": "san-francisco", "title": "The nautical theme and position will appeal to a particular traveller however it didn't to me.", "text": "This hotel came highly recommended by a friend who was participating in a sailing competition with my husband. We were downtown in the JW Marriott and thought it a good idea to be somewhere closer to the Yacht Club. We checked in on 24 August and were shown to our room which was described as 2 Queen suite. The first thing we saw was the toilet which was 2 steps to the right from the door opening, the beds were more like lge singles, the room was pokey, the bright yellow/vivid blue decor a visual affront, a strong odour similar to the Sea Lions at the wharf. I asked to be moved to another room hoping that the smell and size would be improved, it was identical to the previous one with the same rancid odour. This one had a ground floor window outlook - and we were witness to a pedestrian leaning on our window then promptly vomiting. What can I say, the noise, the run down tacky souvenir stores, the odour, pokey rooms, loud decor did not appeal to me. I discreetly approached front desk for a third time and let them know I would not be staying as the rooms were not to my liking. I expressed concern that they had my credit card details and would place a charge on it. I was assured that that would not happen. When we arrived back in Australia and checked our credit card statement they had placed a $258.00 charge on our card for a 'no show' ( meaning we booked then didn't turn up). It has taken 3 International calls, 1 email and speaking to 2 Managers to rectify this problem. I had to prove I had personally been there by naming the 2 front desk staff that I dealt with ( I couldn't ) but luckily I remembered the Bell hop name and a conversation I'd had with him so they had to verify with him!!Needless to say I got on the phone and rebooked us into the JW Marroiott and ran out of there! If you like a nautical theme, won't spend much time in yr room, don't mind the noise of busy street and endless pedestrians, eat seafood, and have a blocked nose then go ahead and book. Also it was twice the price per night as the JW Marriott ( see my review of the Marriott )", "hotel": "argonaut_hotel_a_kimpton_hotel", "year": "2009", "date": "2009-09-12"}
