{"city": "san-francisco", "title": "Fabulous Gem in SF for a GREAT price!", "text": "Just stayed at this Joie de Vivre line boutique hotel for 2 nights and we loved it! My husband had business in the East Bay and UCSF however, we LOVE coming to SF and enjoy staying in boutique hotels in the city. The Andrews was definitely a true gem. Our room was a king size bedroom...I think they call it the &quot;Cozy King&quot; on their website. And cozy certainly defines it. The bed &amp; pillows were VERY comfortable. We are always prepared for the smaller sized rooms when visiting SF, especially in the boutique hotels. Anyone that complains about the size of these types of hotels definitely needs to read up on boutique hotels or stay at the larger chains (even the W has &quot;smaller&quot; rooms for an upscale hotel-it IS San Francisco after all and personally, we'd much rather spend our time IN the city exploring than hanging out in a bedroom!). We were on the 2nd floor and the elevator did not fail us once. We were able to valet the car however, word to the wise, always call for your car at least 15 minutes before you need it! The receptionist was very very friendly and gave us all the information we needed! The Happy Hour in the adjacent Fino Restaurant is from 5-6:30pm and you receive one complimentary glass of wine. The bartenders both nights were super friendly however, Britney was a STAND OUT! She was very open to chatting with us about local hangouts, etc. We went to a Giants game (that stadium is AMAZING!) and not being familiar with that part of the city, we started asking away. She told us about great little joint called O'Neils right outside the stadium near Chophouse (her other job) and we even saw her in there after the game. As a side note to visitors: We have our SF favorites of course and I would recommend House of Nanking on Kearny for THE BEST Chinese food in the city (don't order from the menu...just set it down and wait. Tell him what you like and how hungry you are and you'll be in heaven soon! PS: not for the claustrophobic. You may sit just as close to your unknown dining neighbor as if you were on the city bus!) If you are a micro-brew beer connoisseur, you MUST go to the Toronado Room in Lower Haight-All kinds of local, CA and northwest local brews in addition to a few micros outside the west coast and the Pabst, Bud, etc. options if you MUST have it. Our friends took us to Kate's Kitchen for breakfast one day (also in Lower Haight) and it was excellent! Tons of food-not a single of us could finish and no one spent more than $10/person!We've been to SF many many times, plan on visiting many many more and ALWAYS enjoy ourselves. The Andrews was really a great experience-we couldn't have asked for a better place for a couple nights of fun w/ friends and exploring. And the price can't be beat for the accommodations &amp; location (for the shopaholics-the Andrews Hotel is minutes, literally a few blocks, from Union Square and shopping galore! Don't forget to hit LUSH bath products on Powell!). Overall, we will definitely stay here again and would receommend it to anyone!", "hotel": "andrews_hotel", "year": "2006", "date": "2006-08-26"}
